"""转场效果元数据"""

from .effect_meta import EffectEnum, TransitionMeta

class TransitionType(EffectEnum):
    """转场类型"""

    # 免费特效
    Cutout_Flip          = TransitionMeta("Cutout Flip", False, "7387771481670816257", "7387771481670816257", "290a8f067f8039b1060df3d1e8d07ca0", 0.800, True)
    """默认时长: 0.80s"""
    Fold_Over            = TransitionMeta("Fold Over", False, "7397628078492488209", "7397628078492488209", "091f7995a43fc66fd0a95b2a6b88834f", 1.000, True)
    """默认时长: 1.00s"""
    White_Flash          = TransitionMeta("White Flash", False, "7345079500327096833", "7345079500327096833", "c1f7073a94d22565ace1ab3023d1c154", 0.400, True)
    """默认时长: 0.40s"""
    _3D空间              = TransitionMeta("3D空间 ", False, "7065940410329207297", "7065940410329207297", "aaecc038f6543411f601608fc5539f0b", 0.500, True)
    """默认时长: 0.50s"""
    undefined            = TransitionMeta("undefined", False, "6724866446842663431", "6724866446842663431", "71cabe836d9c88afd44f43654ba67fa7", 0.500, True)
    """默认时长: 0.50s"""
    上移                 = TransitionMeta("上移", False, "6724846395116753416", "6724846395116753416", "df9bc16697464de201a4924de49234a2", 0.500, True)
    """默认时长: 0.50s"""
    下移                 = TransitionMeta("下移", False, "6724849276100284942", "6724849276100284942", "9c042543d4846e7c17e8f950ce6f91c2", 0.500, True)
    """默认时长: 0.50s"""
    中轴旋转             = TransitionMeta("中轴旋转", False, "7237092761361453569", "7237092761361453569", "924f9eeeedd359e19f7ec303e3f79d2b", 0.800, True)
    """默认时长: 0.80s"""
    云朵                 = TransitionMeta("云朵", False, "6959476646155915777", "6959476646155915777", "283bb4bbe729f19f933cb705024a0983", 0.500, True)
    """默认时长: 0.50s"""
    云朵_II              = TransitionMeta("云朵 II", False, "6959477752336486914", "6959477752336486914", "5a8914a3658f88265bbeda060a7c79aa", 0.500, True)
    """默认时长: 0.50s"""
    亮点模糊             = TransitionMeta("亮点模糊", False, "7134999483762348545", "7134999483762348545", "b48f47c097e83842d1c0f919d9c67af6", 0.500, True)
    """默认时长: 0.50s"""
    倒影                 = TransitionMeta("倒影", False, "6748313807031898627", "6748313807031898627", "0ee10b771dc0443c41a90bb9fd6b3c25", 0.500, True)
    """默认时长: 0.50s"""
    光束                 = TransitionMeta("光束", False, "6983988935890309634", "6983988935890309634", "84525ee78728b5cce44c8404d9f50b0d", 0.500, True)
    """默认时长: 0.50s"""
    分割_I               = TransitionMeta("分割 I", False, "6973849417468088833", "6973849417468088833", "ca45695f29bacf2dc29a6eb959e9e968", 0.500, True)
    """默认时长: 0.50s"""
    分割_II              = TransitionMeta("分割 II", False, "6973849510145430018", "6973849510145430018", "5ba1cb89bcf4a0898f86494864348e13", 0.500, True)
    """默认时长: 0.50s"""
    分割_III             = TransitionMeta("分割 III", False, "6973849570912506370", "6973849570912506370", "942fd71d67ca576384b2cd068157ca45", 0.500, True)
    """默认时长: 0.50s"""
    分割_IV              = TransitionMeta("分割 IV", False, "6973849689107993090", "6973849689107993090", "62d08c08542fe62e6a8429f9501e76fa", 0.500, True)
    """默认时长: 0.50s"""
    动漫云朵             = TransitionMeta("动漫云朵", False, "6777178865119793678", "6777178865119793678", "e835cbc7fa7b15af90a2a7090bbf68c3", 0.500, True)
    """默认时长: 0.50s"""
    动漫漩涡             = TransitionMeta("动漫漩涡", False, "6858191448827761160", "6858191448827761160", "fa7ba99b13036c0ff167ea3b7d5c31a2", 0.500, True)
    """默认时长: 0.50s"""
    动漫火焰             = TransitionMeta("动漫火焰", False, "6777178765643485709", "6777178765643485709", "8e7c247c5ebd58aa5c3582273e9c840b", 0.500, True)
    """默认时长: 0.50s"""
    动漫闪电             = TransitionMeta("动漫闪电", False, "6777178696609436174", "6777178696609436174", "3fd5d0c7c48668ba5305c57ac0b5d596", 0.500, True)
    """默认时长: 0.50s"""
    压缩                 = TransitionMeta("压缩", False, "6751618376780485133", "6751618376780485133", "337d4cd9be4e1860bd1e7e50a9a93841", 0.500, True)
    """默认时长: 0.50s"""
    叠化                 = TransitionMeta("叠化", False, "6724845717472416269", "6724845717472416269", "7b53f4c008c4c684fccf8c7d4d46cc92", 0.500, True)
    """默认时长: 0.50s"""
    右移                 = TransitionMeta("右移", False, "6726711296063967748", "6726711296063967748", "2712989c4cdece84c2979196c16186a6", 1.000, True)
    """默认时长: 1.00s"""
    向上                 = TransitionMeta("向上", False, "6724227090872275463", "6724227090872275463", "349746a951e130fe896415f51c9eb36a", 0.500, True)
    """默认时长: 0.50s"""
    向上擦除             = TransitionMeta("向上擦除", False, "6724849456891564557", "6724849456891564557", "5d4d41dbfec9fb012d964d124d546e20", 0.500, True)
    """默认时长: 0.50s"""
    向下                 = TransitionMeta("向下", False, "6724227330190873100", "6724227330190873100", "a61ca47476e8bdcde0a2cfc229b264cd", 0.500, True)
    """默认时长: 0.50s"""
    向下擦除             = TransitionMeta("向下擦除", False, "6724849752921346573", "6724849752921346573", "13adfb6cb7b736fdca5c4690d212d6d9", 0.500, True)
    """默认时长: 0.50s"""
    向右                 = TransitionMeta("向右", False, "6724227599616184836", "6724227599616184836", "94ddc5b44c66c523dbf70622efb612d3", 0.500, True)
    """默认时长: 0.50s"""
    向右上               = TransitionMeta("向右上", False, "6724227870559834635", "6724227870559834635", "f64b7fb5d42576af0bd47958d18d9ebe", 0.500, True)
    """默认时长: 0.50s"""
    向右下               = TransitionMeta("向右下", False, "6724228621742903815", "6724228621742903815", "4689db416f0f78ae5530a9bc08d09b1d", 0.500, True)
    """默认时长: 0.50s"""
    向右拉伸             = TransitionMeta("向右拉伸", False, "6989922560506860033", "6989922560506860033", "0742c22666c136224b39762d2ead4e63", 0.500, True)
    """默认时长: 0.50s"""
    向右擦除             = TransitionMeta("向右擦除", False, "6724849898857959950", "6724849898857959950", "316d71f3567673d63575f027e9e9df18", 0.500, True)
    """默认时长: 0.50s"""
    向左                 = TransitionMeta("向左", False, "6724227717195108867", "6724227717195108867", "d623e56c3ec69ac4920fac8740b456ae", 0.500, True)
    """默认时长: 0.50s"""
    向左上               = TransitionMeta("向左上", False, "6724230442679013902", "6724230442679013902", "64cddad53e059e23879addb4021cfbd0", 0.500, True)
    """默认时长: 0.50s"""
    向左下               = TransitionMeta("向左下", False, "6724230577211314695", "6724230577211314695", "c76650d4ea9bc4e3b0530c9b9f05f28e", 0.500, True)
    """默认时长: 0.50s"""
    向左拉伸             = TransitionMeta("向左拉伸", False, "6989922429980119554", "6989922429980119554", "b0dd96c3c203104a2df46d83dd91b7bd", 0.500, True)
    """默认时长: 0.50s"""
    向左擦除             = TransitionMeta("向左擦除", False, "6724849999336706573", "6724849999336706573", "ea955d4c6033e6e3720a3c40eb2929bf", 0.500, True)
    """默认时长: 0.50s"""
    喜欢                 = TransitionMeta("喜欢", False, "7071174465245172226", "7071174465245172226", "945ee55ddc4b7c9762b55c0ee302bdce", 0.500, True)
    """默认时长: 0.50s"""
    回忆                 = TransitionMeta("回忆", False, "6748220149284737550", "6748220149284737550", "48a73d2ca44a59d8faf88ab0c4bb39f6", 0.500, True)
    """默认时长: 0.50s"""
    回忆_II              = TransitionMeta("回忆 II", False, "6748220462746046989", "6748220462746046989", "bfb17d87ed3db6332a6e0855299809d9", 0.500, True)
    """默认时长: 0.50s"""
    回忆下滑             = TransitionMeta("回忆下滑", False, "7311903191128347138", "7311903191128347138", "7e8f1b10bb9979d7ed184d29f301b93d", 1.000, True)
    """默认时长: 1.00s"""
    圆形分割_II          = TransitionMeta("圆形分割 II", False, "7320530650979635713", "7320530650979635713", "de6b1094111db6d63840edad9aacbe6d", 0.800, True)
    """默认时长: 0.80s"""
    圆形扫描             = TransitionMeta("圆形扫描", False, "6851775006418932238", "6851775006418932238", "0260ab98d7a840c3344cb5b3e70b7d4b", 0.500, True)
    """默认时长: 0.50s"""
    圆形遮罩             = TransitionMeta("圆形遮罩", False, "6725767129519362573", "6725767129519362573", "a7eb1d47f97049b17f49669622d07f3d", 0.500, True)
    """默认时长: 0.50s"""
    圆形遮罩_II          = TransitionMeta("圆形遮罩 II", False, "6724850215364334083", "6724850215364334083", "2772ad7c8c7e30c6421be7c2e5dd3f15", 0.500, True)
    """默认时长: 0.50s"""
    复古放映             = TransitionMeta("复古放映", False, "7242576260310766082", "7242576260310766082", "d9589a91617889714a627160b4d314d9", 0.600, True)
    """默认时长: 0.60s"""
    小恶魔               = TransitionMeta("小恶魔", False, "7078647070499803649", "7078647070499803649", "c9a87dfafa58fbc0d401fc182fbaf6fc", 0.500, True)
    """默认时长: 0.50s"""
    岁月的痕迹           = TransitionMeta("岁月的痕迹", False, "7012818976015127041", "7012818976015127041", "ce3cfe333baf3493f6a3714c08eaae12", 0.500, True)
    """默认时长: 0.50s"""
    左下方_II            = TransitionMeta("左下方 II", False, "7291513615989871105", "7291513615989871105", "e0296196f0ec6666a33b33fead4f63d6", 0.700, True)
    """默认时长: 0.70s"""
    左移                 = TransitionMeta("左移", False, "6726711499676455435", "6726711499676455435", "1315a55c2f804d86894e1453976b48fd", 0.500, True)
    """默认时长: 0.50s"""
    开幕                 = TransitionMeta("开幕", False, "6750893890712113677", "6750893890712113677", "d5f097e701ddaa984a590249896fc51a", 0.500, True)
    """默认时长: 0.50s"""
    开心                 = TransitionMeta("开心", False, "7075898402810106369", "7075898402810106369", "2d832a85cc67784686b6554f2c85e9c1", 0.500, True)
    """默认时长: 0.50s"""
    弹跳                 = TransitionMeta("弹跳", False, "6747865141120864779", "6747865141120864779", "4b3b8b53bc1f947d57a30489d81387eb", 0.500, True)
    """默认时长: 0.50s"""
    彩色故障             = TransitionMeta("彩色故障", False, "7480389949041200390", "7480389949041200390", "4ab3aeca2bc4a82817cf9e978849496d", 1.000, True)
    """默认时长: 1.00s"""
    彩色波纹             = TransitionMeta("彩色波纹", False, "7480387198152379653", "7480387198152379653", "5c5e0e3c721a279c64ba196cf3f944a6", 1.000, True)
    """默认时长: 1.00s"""
    彩色漩涡             = TransitionMeta("彩色漩涡", False, "7480765113809620279", "7480765113809620279", "b015b3ecd87f1bc8d678cff4203fefc2", 1.000, True)
    """默认时长: 1.00s"""
    彩色负片频闪         = TransitionMeta("彩色负片频闪", False, "7480764852131155206", "7480764852131155206", "c19609823e3c48b75c95969131e48e45", 1.000, True)
    """默认时长: 1.00s"""
    快门                 = TransitionMeta("快门", False, "6885172292339372546", "6885172292339372546", "2df569fefb5004c041af5509c10d6c53", 0.500, True)
    """默认时长: 0.50s"""
    快门_II              = TransitionMeta("快门 II", False, "7306783264209900034", "7306783264209900034", "6e0d086441ba1fa0cb6c905b4e1f8f01", 0.600, True)
    """默认时长: 0.60s"""
    扭曲                 = TransitionMeta("扭曲", False, "7169838836304843265", "7169838836304843265", "f864724f43f1d853c15e1d4a1d11117d", 0.500, True)
    """默认时长: 0.50s"""
    抖动                 = TransitionMeta("抖动", False, "7252670515926536705", "7252670515926536705", "c1447e068949ba2fb1d8c6738656c2e9", 0.800, True)
    """默认时长: 0.80s"""
    抖动_II              = TransitionMeta("抖动 II", False, "7252670609811837442", "7252670609811837442", "813875703746cf85379610ce150eaade", 0.800, True)
    """默认时长: 0.80s"""
    拉伸                 = TransitionMeta("拉伸", False, "7250006074781078017", "7250006074781078017", "4fd21b4a2e6382ee8851c51c8f65ed73", 1.200, True)
    """默认时长: 1.20s"""
    拉伸_ll              = TransitionMeta("拉伸 ll", False, "7260116495974273538", "7260116495974273538", "d28fee612c51edf28da804983d220f8d", 0.600, True)
    """默认时长: 0.60s"""
    拉远                 = TransitionMeta("拉远", False, "6724226338418332167", "6724226338418332167", "8d97f1c1a60d9393c97ff4e9da0669ae", 0.500, True)
    """默认时长: 0.50s"""
    推近                 = TransitionMeta("推近", False, "6724226861666144779", "6724226861666144779", "4d5a316f2eae582e7d0604b47feb8c32", 0.500, True)
    """默认时长: 0.50s"""
    摄像机               = TransitionMeta("摄像机", False, "7071174465245155841", "7071174465245155841", "bb0b9fa428e5a3fde828c03022b5082d", 0.500, True)
    """默认时长: 0.50s"""
    撕纸                 = TransitionMeta("撕纸", False, "6885172333560992257", "6885172333560992257", "131ae40c737ab9f5c79e35e3639a4bad", 0.500, True)
    """默认时长: 0.50s"""
    播放界面             = TransitionMeta("播放界面", False, "7531931099430259984", "7531931099430259984", "6a3c7ba9f63d5db8bbc21ab8807281c2", 2.000, True)
    """默认时长: 2.00s"""
    放射                 = TransitionMeta("放射", False, "6724239584663704071", "6724239584663704071", "06cc8d49c558d57e21207f68a6a7dbc0", 0.500, True)
    """默认时长: 0.50s"""
    故障                 = TransitionMeta("故障", False, "6725771847444468236", "6725771847444468236", "7bec08ae5dae8806e3ba0c66622d0fd3", 0.500, True)
    """默认时长: 0.50s"""
    故障爆闪             = TransitionMeta("故障爆闪", False, "7480387121325395255", "7480387121325395255", "48bc6b9d80ab44ada1be807611a0ed23", 1.000, True)
    """默认时长: 1.00s"""
    斜向分割             = TransitionMeta("斜向分割", False, "7090080734941024769", "7090080734941024769", "6ae9eb3ee4b08afa67e3d079a2ece505", 0.500, True)
    """默认时长: 0.50s"""
    旋焦                 = TransitionMeta("旋焦", False, "7215489792597824001", "7215489792597824001", "917c209246e975d4f10d9b8c8c78035f", 0.500, True)
    """默认时长: 0.50s"""
    无限穿越_Ⅰ           = TransitionMeta("无限穿越 Ⅰ", False, "7037372228270297602", "7037372228270297602", "3ee3fc9318dc2315d250f0baa1763e5b", 0.500, True)
    """默认时长: 0.50s"""
    无限穿越_Ⅱ           = TransitionMeta("无限穿越 Ⅱ", False, "7037372139221029377", "7037372139221029377", "b87498756c478952cf7c804234f97bbb", 0.500, True)
    """默认时长: 0.50s"""
    旧胶片               = TransitionMeta("旧胶片", False, "7131932238618300929", "7131932238618300929", "79901fab61f0b8c2960c73a78e84e5a3", 0.500, True)
    """默认时长: 0.50s"""
    星星                 = TransitionMeta("星星", False, "6751564373317128708", "6751564373317128708", "5ad3a484b1784e3f5391bf3fa7b188f4", 0.500, True)
    """默认时长: 0.50s"""
    星星变焦             = TransitionMeta("星星变焦", False, "7452646287326843393", "7452646287326843393", "7eeeca7c07e67b54519995ebdf71d6fc", 1.000, True)
    """默认时长: 1.00s"""
    模糊细闪             = TransitionMeta("模糊细闪", False, "7452646287318454785", "7452646287318454785", "486a1593cc532d15663279bd4a127a45", 1.170, True)
    """默认时长: 1.17s"""
    横向分割             = TransitionMeta("横向分割", False, "7090080817849831938", "7090080817849831938", "aa0aa4a72fc236611d3fd4bf75a12ca3", 0.500, True)
    """默认时长: 0.50s"""
    横向拉幕             = TransitionMeta("横向拉幕", False, "6724492948144132621", "6724492948144132621", "de63aa2d5225bb6a65b5bab8702aa1f5", 0.500, True)
    """默认时长: 0.50s"""
    横向模糊             = TransitionMeta("横向模糊", False, "7451535587812594193", "7451535587812594193", "38f584c24f4383e9d10037ad4ce6fa00", 0.500, True)
    """默认时长: 0.50s"""
    横线                 = TransitionMeta("横线", False, "6724845810892149251", "6724845810892149251", "36c1c8edb0171ea082c98d38ffa8bd36", 0.500, True)
    """默认时长: 0.50s"""
    水墨                 = TransitionMeta("水墨", False, "6789847231873683976", "6789847231873683976", "d1dd3dd8905f0b96be756bd34be1a84d", 0.500, True)
    """默认时长: 0.50s"""
    水波卷动             = TransitionMeta("水波卷动", False, "6858191497280360973", "6858191497280360973", "cf9bac91349a227a6155eca9d94a8af8", 0.500, True)
    """默认时长: 0.50s"""
    水波向右             = TransitionMeta("水波向右", False, "6858191510865711629", "6858191510865711629", "e9301bacebc6dc444aa4e6f835dd4a31", 0.500, True)
    """默认时长: 0.50s"""
    水波向左             = TransitionMeta("水波向左", False, "6858191524312650248", "6858191524312650248", "6b6499879310b6d29e9595799829cb15", 0.500, True)
    """默认时长: 0.50s"""
    泛光                 = TransitionMeta("泛光", False, "6916426858368078338", "6916426858368078338", "c978e2e22e9a9768813f5fd8d486b792", 1.000, True)
    """默认时长: 1.00s"""
    泛白                 = TransitionMeta("泛白", False, "6952697453275517442", "6952697453275517442", "9fae2e7e4e9b0c3b0da92e35accbd280", 0.500, True)
    """默认时长: 0.50s"""
    泡泡模糊             = TransitionMeta("泡泡模糊", False, "7159450506648097281", "7159450506648097281", "10478b300821fa6eccadf67b07b63208", 1.000, True)
    """默认时长: 1.00s"""
    波点向右             = TransitionMeta("波点向右", False, "6858191541706428941", "6858191541706428941", "74c13e6250cdff7a4e860625d1098e0c", 0.500, True)
    """默认时长: 0.50s"""
    渐变擦除             = TransitionMeta("渐变擦除", False, "6923134021744464386", "6923134021744464386", "2fff9b60c929559bce574ab8ef2c14a7", 0.500, True)
    """默认时长: 0.50s"""
    滑动                 = TransitionMeta("滑动", False, "6757982416649851399", "6757982416649851399", "b99916e2936aeb2e56892ca617888694", 0.500, True)
    """默认时长: 0.50s"""
    漩涡                 = TransitionMeta("漩涡", False, "6851810799510360583", "6851810799510360583", "31d2de43e6711a9eeb831d60529d0393", 0.500, True)
    """默认时长: 0.50s"""
    炫光                 = TransitionMeta("炫光", False, "6726707814028284423", "6726707814028284423", "a3fd6266c293496fd9480884a93fb90e", 0.500, True)
    """默认时长: 0.50s"""
    炫光_II              = TransitionMeta("炫光 II", False, "6952697917563998722", "6952697917563998722", "aafb556352016d087cddd1939ada20f8", 0.500, True)
    """默认时长: 0.50s"""
    炫光_III             = TransitionMeta("炫光 III", False, "6952698136951263746", "6952698136951263746", "5ed29701053e9f7640ecf8dcfc34c7cc", 0.500, True)
    """默认时长: 0.50s"""
    烟雾转场             = TransitionMeta("烟雾转场", False, "7451535589498688016", "7451535589498688016", "67dc647cf7b1c45ada91d32bebc2bde7", 1.500, True)
    """默认时长: 1.50s"""
    燃烧_Ⅰ               = TransitionMeta("燃烧 Ⅰ", False, "7091576396731912705", "7091576396731912705", "da10f2f4ae0aa70ad4d61b2c750aef6b", 0.500, True)
    """默认时长: 0.50s"""
    燃烧_ⅠⅠ              = TransitionMeta("燃烧 ⅠⅠ", False, "7091585702927798786", "7091585702927798786", "164c1073bde892dcd9f21d8026fb3cbd", 0.500, True)
    """默认时长: 0.50s"""
    燃烧_ⅠⅠⅠ             = TransitionMeta("燃烧 ⅠⅠⅠ", False, "7091585010544677377", "7091585010544677377", "0f42e514001c30186e1c9c68e1ebfee9", 0.500, True)
    """默认时长: 0.50s"""
    爱心_I               = TransitionMeta("爱心 I", False, "6748289440130535947", "6748289440130535947", "d1797b315a25f37a4db8982bd36e2be1", 0.500, True)
    """默认时长: 0.50s"""
    爱心_II              = TransitionMeta("爱心 II", False, "6789846472343949837", "6789846472343949837", "0c04684566638932cb6f6d86cdfabda6", 0.500, True)
    """默认时长: 0.50s"""
    爱心冲击             = TransitionMeta("爱心冲击", False, "6789846355742298632", "6789846355742298632", "6ca91f7bba738e2e4a67cbf8104eb7b0", 0.500, True)
    """默认时长: 0.50s"""
    生气                 = TransitionMeta("生气", False, "7071174465245155842", "7071174465245155842", "9a149a5d9a4da6fd86acf22c3602918a", 0.500, True)
    """默认时长: 0.50s"""
    画中画放大           = TransitionMeta("画中画放大", False, "7480764752713534726", "7480764752713534726", "18a3de7b9f814c72a773e274d732508d", 1.000, True)
    """默认时长: 1.00s"""
    画笔擦除             = TransitionMeta("画笔擦除", False, "6789846828788486664", "6789846828788486664", "4fafb5343d5c9e726278e90b5e0c1c93", 0.500, True)
    """默认时长: 0.50s"""
    白色墨花             = TransitionMeta("白色墨花", False, "6858191556055142919", "6858191556055142919", "775ccf71576e2b8fb075f0e61e980923", 0.500, True)
    """默认时长: 0.50s"""
    白色烟雾             = TransitionMeta("白色烟雾", False, "6886274983962612226", "6886274983962612226", "9b679b32ec03c42932fa37b10c141bda", 0.500, True)
    """默认时长: 0.50s"""
    百叶窗               = TransitionMeta("百叶窗", False, "6789847331060584974", "6789847331060584974", "9f37c3f6f5e84b37b3a0560803a16c30", 0.500, True)
    """默认时长: 0.50s"""
    眨眼                 = TransitionMeta("眨眼", False, "6864867302936941064", "6864867302936941064", "bf695506c8091f7a01ee7b1323a4d601", 0.500, True)
    """默认时长: 0.50s"""
    眩光叠化             = TransitionMeta("眩光叠化", False, "7481553072678784311", "7481553072678784311", "c0cbbcfab2b63efeac02dedc1929da3e", 2.000, True)
    """默认时长: 2.00s"""
    窗格                 = TransitionMeta("窗格", False, "6747989545448378888", "6747989545448378888", "cd6a7ff53319efa1c57690f61c8737a0", 0.500, True)
    """默认时长: 0.50s"""
    立方体               = TransitionMeta("立方体", False, "7429600601161338117", "7429600601161338117", "be45578bb628a21eaae268a8d8df868f", 0.500, True)
    """默认时长: 0.50s"""
    竖向分割             = TransitionMeta("竖向分割", False, "7090080890201575938", "7090080890201575938", "7cc017d4e1b6ab58ec4b6900432522ff", 0.500, True)
    """默认时长: 0.50s"""
    竖向拉幕             = TransitionMeta("竖向拉幕", False, "6726711903684399619", "6726711903684399619", "84f91be5a43cc6a9d03505a465418206", 0.500, True)
    """默认时长: 0.50s"""
    竖向模糊             = TransitionMeta("竖向模糊", False, "7140916992118100482", "7140916992118100482", "f55306a27ff8e0a8ae29584bb661ad73", 0.500, True)
    """默认时长: 0.50s"""
    竖向模糊_II          = TransitionMeta("竖向模糊 II", False, "7291574063514784257", "7291574063514784257", "85e381982a94778e003f3acc9527d5cf", 0.660, True)
    """默认时长: 0.66s"""
    竖线                 = TransitionMeta("竖线", False, "6724846536041173511", "6724846536041173511", "75019c1486b2366675d95602f58430e2", 0.500, True)
    """默认时长: 0.50s"""
    粒子                 = TransitionMeta("粒子", False, "6873386344463208961", "6873386344463208961", "3895bd9b5abd7037c3bfc0d2a8a589c9", 0.500, True)
    """默认时长: 0.50s"""
    翻页                 = TransitionMeta("翻页", False, "6747979085894390279", "6747979085894390279", "2f157ee5d78c197efc26f8ed37490573", 0.500, True)
    """默认时长: 0.50s"""
    色差故障             = TransitionMeta("色差故障", False, "6724239785205961228", "6724239785205961228", "9de90519d59e432b81c38423aa0393d7", 0.500, True)
    """默认时长: 0.50s"""
    色差逆时针           = TransitionMeta("色差逆时针", False, "6941282383836484098", "6941282383836484098", "de63b182c2c654b2eef98b8681d12f2c", 0.500, True)
    """默认时长: 0.50s"""
    色差顺时针           = TransitionMeta("色差顺时针", False, "6941282502480761346", "6941282502480761346", "191c91dacfa44e337ac1a02f72514735", 0.500, True)
    """默认时长: 0.50s"""
    色彩溶解             = TransitionMeta("色彩溶解", False, "6724846004274729480", "6724846004274729480", "986161b2af25f7aa752278aa8b39c7b7", 0.500, True)
    """默认时长: 0.50s"""
    色彩溶解_II          = TransitionMeta("色彩溶解 II", False, "6724866927933526542", "6724866927933526542", "8179e342f9b24dd1817c56f7ef1f8f9b", 0.500, True)
    """默认时长: 0.50s"""
    色彩溶解_III         = TransitionMeta("色彩溶解 III", False, "6724867032312975875", "6724867032312975875", "293a03bd140d09b0c616f879bda235e1", 0.500, True)
    """默认时长: 0.50s"""
    荧光扫描             = TransitionMeta("荧光扫描", False, "7224393850444321282", "7224393850444321282", "1941195d514a2078634b4132f1127f7d", 0.800, True)
    """默认时长: 0.80s"""
    蓝色线条             = TransitionMeta("蓝色线条", False, "6858191605384352263", "6858191605384352263", "d4d2996c3f6cf97fb8602f825d98a4da", 0.500, True)
    """默认时长: 0.50s"""
    负片爆闪             = TransitionMeta("负片爆闪", False, "7480386514338237701", "7480386514338237701", "a3317352c6b4da741bd7a0aed6cb37b9", 1.000, True)
    """默认时长: 1.00s"""
    超赞                 = TransitionMeta("超赞", False, "7071174465249350146", "7071174465249350146", "e0bd13b237d73eb121473c442c752a23", 0.500, True)
    """默认时长: 0.50s"""
    转场_叠加            = TransitionMeta("转场-叠加", False, "6917578154089386498", "6917578154089386498", "437b07f8bdff88d67d91760874fa6fcc", 0.500, True)
    """默认时长: 0.50s"""
    转场_模糊            = TransitionMeta("转场-模糊", False, "6916426617455645186", "6916426617455645186", "fc1352435f88c6f284b6c6dce8552ffe", 0.500, True)
    """默认时长: 0.50s"""
    辉光运镜             = TransitionMeta("辉光运镜", False, "7480386884728917254", "7480386884728917254", "56e4dca1f4540d77784eaf42a3fe6ea5", 1.030, True)
    """默认时长: 1.03s"""
    逆时针旋转           = TransitionMeta("逆时针旋转", False, "6724226603372515853", "6724226603372515853", "a88b779d96204dc15634c0b9f0e60ee0", 0.500, True)
    """默认时长: 0.50s"""
    逆时针旋转_II        = TransitionMeta("逆时针旋转 II", False, "7252989957319430658", "7252989957319430658", "248ab60641bf5ff2760a16c7f0df15d6", 0.800, True)
    """默认时长: 0.80s"""
    闪光灯               = TransitionMeta("闪光灯", False, "6987208055511323137", "6987208055511323137", "009f3e9678994c70c3b45e8a5ea4b999", 0.500, True)
    """默认时长: 0.50s"""
    闪动光斑             = TransitionMeta("闪动光斑", False, "6777178510050988551", "6777178510050988551", "06560e9ea51f532b18b7e5ae23bd2b9c", 0.500, True)
    """默认时长: 0.50s"""
    闪白                 = TransitionMeta("闪白", False, "6724845376098013708", "6724845376098013708", "b033ea56618d5b0f098071fb326bb02a", 0.500, True)
    """默认时长: 0.50s"""
    闪黑                 = TransitionMeta("闪黑", False, "6724239388189921806", "6724239388189921806", "3bca53e9f3dfa2c184fbee96438ea097", 0.500, True)
    """默认时长: 0.50s"""
    震动                 = TransitionMeta("震动", False, "7198424967803834881", "7198424967803834881", "3a0fd76188f0955a96b967a9cce139b3", 0.500, True)
    """默认时长: 0.50s"""
    顺时针旋转           = TransitionMeta("顺时针旋转", False, "6724226684721041932", "6724226684721041932", "2cb18ab485b109c0c3470bd3fb1759a3", 0.500, True)
    """默认时长: 0.50s"""
    顺时针旋转_II        = TransitionMeta("顺时针旋转 II", False, "7252989706198061569", "7252989706198061569", "daafcc4b40351ba97bc8c4a2ba33408d", 0.800, True)
    """默认时长: 0.80s"""
    频闪                 = TransitionMeta("频闪", False, "7131930101599441410", "7131930101599441410", "35a76b77dd0812f7012911109db35799", 0.500, True)
    """默认时长: 0.50s"""
    风车                 = TransitionMeta("风车", False, "6748286529921094157", "6748286529921094157", "367b8b51b2eeb63eb2009bf5b356bc2f", 0.500, True)
    """默认时长: 0.50s"""
    飘雪                 = TransitionMeta("飘雪", False, "7171709546262434306", "7171709546262434306", "c5c7c3c9c9ea3ca576acefe8a278f6ed", 0.500, True)
    """默认时长: 0.50s"""
    马赛克               = TransitionMeta("马赛克", False, "6724866519022440967", "6724866519022440967", "eed93b26d9cd6296b10d2f5065ee396e", 0.500, True)
    """默认时长: 0.50s"""
    黑白闪光             = TransitionMeta("黑白闪光", False, "7481552579042774278", "7481552579042774278", "ca293bf055b3ff4fdd6d8ff720d47322", 2.000, True)
    """默认时长: 2.00s"""
    黑色块               = TransitionMeta("黑色块", False, "6724866346569437710", "6724866346569437710", "357e865f3bb0c6529ee882ebf279d7c6", 0.500, True)
    """默认时长: 0.50s"""
    黑色烟雾             = TransitionMeta("黑色烟雾", False, "6886275127743353346", "6886275127743353346", "fa02f80c28a9671a206c2ccf17b41c58", 0.500, True)
    """默认时长: 0.50s"""

    # 付费特效
    Big_Wave             = TransitionMeta("Big Wave", True, "7426939408210727441", "7426939408210727441", "e63143bff5e6394a018f2b802e1d832e", 0.833, True)
    """默认时长: 0.83s"""
    Bump                 = TransitionMeta("Bump", True, "7340917662802776577", "7340917662802776577", "4f77c735f448ec5f6df27f21d88e4ee6", 0.600, True)
    """默认时长: 0.60s"""
    CRT_快拍             = TransitionMeta("CRT 快拍", True, "7501626273580502325", "7501626273580502325", "697244324a111260ce657494580abf0a", 1.000, True)
    """默认时长: 1.00s"""
    CRT扫描              = TransitionMeta("CRT扫描", True, "7426273088041390593", "7426273088041390593", "87bd40bfa4f188fa096a161d68c35037", 1.000, True)
    """默认时长: 1.00s"""
    Center_Rotate        = TransitionMeta("Center Rotate", True, "7397628076722541073", "7397628076722541073", "dc1ea47698728162001d4f8ee1f22a80", 1.000, True)
    """默认时长: 1.00s"""
    Corner_Slide         = TransitionMeta("Corner Slide", True, "7484147174364712247", "7484147174364712247", "fe3e70fc6b2e9047725fb246bf509a38", 1.000, True)
    """默认时长: 1.00s"""
    Cube_Rotate          = TransitionMeta("Cube Rotate", True, "7402129574017896976", "7402129574017896976", "e84ed5b0059d6d3fa22ea14cf6650dd8", 1.000, True)
    """默认时长: 1.00s"""
    Cubic_Flip           = TransitionMeta("Cubic Flip", True, "7353221922009649665", "7353221922009649665", "b4f34c534b20fc25c79d3477de603713", 0.800, True)
    """默认时长: 0.80s"""
    Dazzle_Pulse         = TransitionMeta("Dazzle Pulse", True, "7438462583708848656", "7438462583708848656", "a1fef85b1aaae8625494711a77ac1903", 0.700, True)
    """默认时长: 0.70s"""
    Dirty_Frame          = TransitionMeta("Dirty Frame", True, "7480765603612052742", "7480765603612052742", "bf12f1fc41afc54d0598cc1f8749cbce", 2.000, True)
    """默认时长: 2.00s"""
    Dreamy_Bubbles       = TransitionMeta("Dreamy Bubbles", True, "7330894968266953217", "7330894968266953217", "e8c2d6e1bc4f3a41a52d7cca8b016080", 1.000, True)
    """默认时长: 1.00s"""
    Drop_3               = TransitionMeta("Drop 3", True, "7338421331009999361", "7338421331009999361", "32eea5171000b838f2eb74941fb751d7", 1.100, True)
    """默认时长: 1.10s"""
    Drop_Expand          = TransitionMeta("Drop & Expand", True, "7343864924348617217", "7343864924348617217", "bb190e71a692bc20d9060b22b4311896", 1.000, True)
    """默认时长: 1.00s"""
    EDM_蓝调             = TransitionMeta("EDM 蓝调", True, "7508753378927856949", "7508753378927856949", "aa280b64be7ad9f55533751fd12269a7", 1.000, True)
    """默认时长: 1.00s"""
    Elastic_Glowing      = TransitionMeta("Elastic & Glowing", True, "7347995429541253633", "7347995429541253633", "ed351591432a32553f06cc762db259ca", 0.800, True)
    """默认时长: 0.80s"""
    Film_Burn            = TransitionMeta("Film Burn", True, "7348263282286793218", "7348263282286793218", "563d0dfa49528bb59646384d8a18552a", 0.700, True)
    """默认时长: 0.70s"""
    Flash                = TransitionMeta("Flash", True, "7345444349682913793", "7345444349682913793", "c911cc41c158afbd43636d1aa465e1d2", 1.300, True)
    """默认时长: 1.30s"""
    Flip_Page            = TransitionMeta("Flip Page", True, "7340927445446431233", "7340927445446431233", "46d525166125a781ce8cf9c6e6370454", 0.700, True)
    """默认时长: 0.70s"""
    Flip_Zoom            = TransitionMeta("Flip & Zoom", True, "7359420146219225616", "7359420146219225616", "c1ebaab317335c387d342a3d0b42a65b", 1.200, True)
    """默认时长: 1.20s"""
    GPS_指示             = TransitionMeta("GPS 指示", True, "7532818825759296821", "7532818825759296821", "f1ed2bf44c1c828ee73419bb6ec3a64c", 2.000, True)
    """默认时长: 2.00s"""
    Gameboy_滑动         = TransitionMeta("Gameboy 滑动", True, "7530589748713377085", "7530589748713377085", "25f702d40ea32a96c02df7019499d759", 2.000, True)
    """默认时长: 2.00s"""
    Hand_gesture         = TransitionMeta("Hand gesture", True, "7475716564164119869", "7475716564164119869", "02a89960cac531d53eb7b3b639c78d3c", 2.000, True)
    """默认时长: 2.00s"""
    Horizontal_Triptych  = TransitionMeta("Horizontal Triptych", True, "7352880297018397201", "7352880297018397201", "9b32def73cc4e91d29a92bd640a92e81", 1.000, True)
    """默认时长: 1.00s"""
    Hot_Shimmers         = TransitionMeta("Hot Shimmers", True, "7397628076726686209", "7397628076726686209", "133e52c43b2639f2a202b3b1394846bf", 1.000, True)
    """默认时长: 1.00s"""
    IG_弹出              = TransitionMeta("IG 弹出", True, "7519021184000740669", "7519021184000740669", "cbf0fc17b62d581e63c383481254e9b4", 2.000, True)
    """默认时长: 2.00s"""
    Jerky_Camera         = TransitionMeta("Jerky Camera", True, "7367356291833926161", "7367356291833926161", "4ffdc4b55688e65262a229d5e7b987ca", 0.900, True)
    """默认时长: 0.90s"""
    Kaleidoscope         = TransitionMeta("Kaleidoscope", True, "7366139534834143760", "7366139534834143760", "99c0d1524575c7f7020cd77d36a6b008", 1.450, True)
    """默认时长: 1.45s"""
    Kurzgesagt_液体      = TransitionMeta("Kurzgesagt 液体", True, "7497226227237866813", "7497226227237866813", "127fa2e9a395b0ec6fcb45ab10a7ce84", 2.000, True)
    """默认时长: 2.00s"""
    LED_隧道             = TransitionMeta("LED 隧道", True, "7533160871720226109", "7533160871720226109", "69dd0e27ee6082c022cae8a3a3b752ce", 1.830, True)
    """默认时长: 1.83s"""
    Light_Leaks          = TransitionMeta("Light Leaks", True, "7356530479287243281", "7356530479287243281", "d3eb0fe7d4088694cc0f9ca02cad07b2", 1.000, True)
    """默认时长: 1.00s"""
    Lightflow_Scan       = TransitionMeta("Lightflow Scan", True, "7371762306780238353", "7371762306780238353", "4bd676f9001765af20ac02b252da5575", 1.467, True)
    """默认时长: 1.47s"""
    Lumin_Flash          = TransitionMeta("Lumin Flash", True, "7342515863662105090", "7342515863662105090", "a2d70591b5f8dcc52298426ca626c931", 0.800, True)
    """默认时长: 0.80s"""
    Neon                 = TransitionMeta("Neon", True, "7340108078282445314", "7340108078282445314", "60cee393e1ddf8c117ca6856e474d47d", 0.600, True)
    """默认时长: 0.60s"""
    Neon_2               = TransitionMeta("Neon 2", True, "7340108569368334850", "7340108569368334850", "b87a9bf7d6c8e93cc9873ccb47ffc4d0", 0.500, True)
    """默认时长: 0.50s"""
    O_缩放               = TransitionMeta("O 缩放", True, "7475322253287247165", "7475322253287247165", "d1e8851bf478b93c79e3cc66449d24d2", 2.000, True)
    """默认时长: 2.00s"""
    Paper_Flip           = TransitionMeta("Paper Flip", True, "7397628076726686225", "7397628076726686225", "79aa9cd257fd246d038451cc8735ffb8", 1.000, True)
    """默认时长: 1.00s"""
    Pass_Through_3       = TransitionMeta("Pass Through 3", True, "7343204606060532225", "7343204606060532225", "6d6fa95fe1414d4b4a45db9ddec0ee9b", 0.800, True)
    """默认时长: 0.80s"""
    Push_Away_2          = TransitionMeta("Push Away 2", True, "7361006433795576321", "7361006433795576321", "0a10553e75180add06fd336bf16fa8aa", 1.000, True)
    """默认时长: 1.00s"""
    RGB_弹射             = TransitionMeta("RGB 弹射", True, "7530628010894953781", "7530628010894953781", "14e9599d5bada94a830976d584c686f4", 2.000, True)
    """默认时长: 2.00s"""
    RGB_阴影             = TransitionMeta("RGB 阴影", True, "7481481155674524934", "7481481155674524934", "6f9f666ef8da102781ac97c363bdc406", 2.000, True)
    """默认时长: 2.00s"""
    RGB旋转              = TransitionMeta("RGB旋转", True, "7499818905565744437", "7499818905565744437", "c9835cc05607fb5d46d3b9b22acc0567", 1.330, True)
    """默认时长: 1.33s"""
    Rainbow_Twist        = TransitionMeta("Rainbow Twist", True, "7402130914253214224", "7402130914253214224", "59aaa373c4205aadd62cae40f80df9b5", 1.000, True)
    """默认时长: 1.00s"""
    Reveal_Brush         = TransitionMeta("Reveal Brush", True, "7438462581410370065", "7438462581410370065", "0de59ee84b2fc1195497ade8dea6d5ed", 2.000, True)
    """默认时长: 2.00s"""
    Rotate_Change        = TransitionMeta("Rotate & Change", True, "7327547930728993282", "7327547930728993282", "70bea2644a8dc8bc2b24102d8fa90ca4", 0.600, True)
    """默认时长: 0.60s"""
    Shake_down           = TransitionMeta("Shake down", True, "7338723334563041793", "7338723334563041793", "1a44879e265bc89746e30f59d2ff0245", 1.300, True)
    """默认时长: 1.30s"""
    Shaky_Inhale         = TransitionMeta("Shaky Inhale", True, "7347695573199229442", "7347695573199229442", "88939867fef0a71b39f549558d724d31", 1.000, True)
    """默认时长: 1.00s"""
    Shrink               = TransitionMeta("Shrink", True, "7340928567821210114", "7340928567821210114", "3cb961ebfd78ef43742e78bca2d04d06", 1.100, True)
    """默认时长: 1.10s"""
    Sideway_Bounce       = TransitionMeta("Sideway Bounce", True, "7460766405273588241", "7460766405273588241", "d8795a3b3e4941199461fa646999d042", 1.000, True)
    """默认时长: 1.00s"""
    Signal_Glitch_2      = TransitionMeta("Signal Glitch 2", True, "7343854374147330562", "7343854374147330562", "bc6d04c47df8aa910544fdf657419ab7", 0.670, False)
    """默认时长: 0.67s"""
    Slide_Drop           = TransitionMeta("Slide Drop", True, "7483024564956581125", "7483024564956581125", "c5f718b0a5efc99de9afdbf2e01c1d5a", 1.270, True)
    """默认时长: 1.27s"""
    Slide_Interface      = TransitionMeta("Slide Interface", True, "7483353476551167237", "7483353476551167237", "b0f43f1f4832c97de5cd1a9d2e7bb853", 1.830, True)
    """默认时长: 1.83s"""
    Slosh                = TransitionMeta("Slosh", True, "7340902143936696834", "7340902143936696834", "554ea6d10cd7fbb24ccd24bd91d8c7e1", 0.600, True)
    """默认时长: 0.60s"""
    Snap_Zoom            = TransitionMeta("Snap Zoom", True, "7359420846022070800", "7359420846022070800", "2fb5734ab118c745bfa0596264533e54", 0.900, True)
    """默认时长: 0.90s"""
    Snapshot             = TransitionMeta("Snapshot", True, "7351356201088586241", "7351356201088586241", "f2b536b7d3f17bc58e0e4957f517ece0", 1.000, True)
    """默认时长: 1.00s"""
    Split_Drop           = TransitionMeta("Split Drop", True, "7483025300884933893", "7483025300884933893", "ecaaf7178338e389bef2715d870d2916", 2.030, True)
    """默认时长: 2.03s"""
    Split_Drop_1         = TransitionMeta("Split Drop 1", True, "7483780232609058053", "7483780232609058053", "ea9b5d6510a5db341a9bcb119e0cf924", 2.000, True)
    """默认时长: 2.00s"""
    Subject_Flash        = TransitionMeta("Subject Flash", True, "7397628076722508305", "7397628076722508305", "1572d6a430d4e5e782e7b86262de8ebe", 1.000, True)
    """默认时长: 1.00s"""
    Swipe_Left           = TransitionMeta("Swipe Left", True, "7347595541234061826", "7347595541234061826", "a2c4ddc0f96c5694e941d738ed52cdf4", 1.300, True)
    """默认时长: 1.30s"""
    Swirl                = TransitionMeta("Swirl", True, "7343576699100992001", "7343576699100992001", "e05493559e59bf7f4c4a9ea5a5d212de", 1.800, True)
    """默认时长: 1.80s"""
    TV_Flickers          = TransitionMeta("TV Flickers", True, "7460018714935562768", "7460018714935562768", "2e90f5ac0327dc1bdfa68858dd509cad", 1.000, True)
    """默认时长: 1.00s"""
    Thermal_Imaging_3    = TransitionMeta("Thermal Imaging 3", True, "7438462583528493584", "7438462583528493584", "ed973037edcf37c1c8272776af27ef7b", 1.000, True)
    """默认时长: 1.00s"""
    Turn_Table           = TransitionMeta("Turn Table", True, "7343096928718033410", "7343096928718033410", "835a263f9afbb614cfc5467343968642", 0.700, True)
    """默认时长: 0.70s"""
    Whip_Tear            = TransitionMeta("Whip Tear", True, "7436323942207345168", "7436323942207345168", "ca0072e8c95318ca9babfa5a6d699cac", 0.830, True)
    """默认时长: 0.83s"""
    Whirl                = TransitionMeta("Whirl", True, "7345098830003573249", "7345098830003573249", "e5d36f065e3f0e8801c43a625a7d9947", 1.500, True)
    """默认时长: 1.50s"""
    Wide_Ripple          = TransitionMeta("Wide Ripple", True, "7438462581414564353", "7438462581414564353", "3b87acb614610bef693ceeb28833378b", 2.000, True)
    """默认时长: 2.00s"""
    X光拉开              = TransitionMeta("X光拉开", True, "7527518517013351696", "7527518517013351696", "96c3c6cafab9a24749c31b57cef7106b", 1.730, True)
    """默认时长: 1.73s"""
    X形震动              = TransitionMeta("X形震动", True, "7407436924291387921", "7407436924291387921", "07f3707be8fced05b149f16252c3aabc", 1.000, True)
    """默认时长: 1.00s"""
    Zoom_Shake_2         = TransitionMeta("Zoom Shake 2", True, "7340177833508999681", "7340177833508999681", "137d3f03fbd4dddbc6a2a0dd1f371e17", 1.000, True)
    """默认时长: 1.00s"""
    Zoom_Transition      = TransitionMeta("Zoom Transition", True, "7327552457381253634", "7327552457381253634", "a746b6b7c2e83275d90864d0b28173aa", 1.000, True)
    """默认时长: 1.00s"""
    Zoom_to_Change       = TransitionMeta("Zoom to Change", True, "7348018344760447489", "7348018344760447489", "b7f8e6cd03560d1f52e1270dcf7c9ba4", 0.800, True)
    """默认时长: 0.80s"""
    _2024回忆流          = TransitionMeta("2024回忆流", True, "7450018653921088017", "7450018653921088017", "e21c31c4d68bb535ab10905af32a8486", 2.000, True)
    """默认时长: 2.00s"""
    _2_Screen_Swipe      = TransitionMeta("2-Screen Swipe", True, "7338385951594385921", "7338385951594385921", "eb4e4368773f40a8c807e77497acab4f", 0.900, True)
    """默认时长: 0.90s"""
    _2_卡洗牌            = TransitionMeta("2 卡洗牌", True, "7532516358639078709", "7532516358639078709", "261ebfa67ec204a00d97dd41765f5e0a", 2.000, True)
    """默认时长: 2.00s"""
    _3D_旋转木马_2       = TransitionMeta("3D 旋转木马 2", True, "7522047509460421949", "7522047509460421949", "be72e3bee59023c81dcd0f88345c7cc6", 2.000, True)
    """默认时长: 2.00s"""
    _3D小卡              = TransitionMeta("3D小卡", True, "7490760605515697409", "7490760605515697409", "1d50e4d9332deccccca9ebf18601fbff", 2.000, True)
    """默认时长: 2.00s"""
    _3D照片              = TransitionMeta("3D照片", True, "7478589595400016401", "7478589595400016401", "fbea2ca7f6826300a7365f3f1615495a", 2.000, True)
    """默认时长: 2.00s"""
    _3D爱心              = TransitionMeta("3D爱心", True, "7470416935671321089", "7470416935671321089", "b3a946a64371a8ba9a102489dbc40111", 2.800, True)
    """默认时长: 2.80s"""
    _3D爱心气球          = TransitionMeta("3D爱心气球", True, "7470416935662948880", "7470416935662948880", "bd2c38ad3da24ebe402e48dd46f02629", 2.130, True)
    """默认时长: 2.13s"""
    _3D环绕              = TransitionMeta("3D环绕", True, "7481582458241043767", "7481582458241043767", "f68b806517b4def97c1b732626e13783", 1.960, True)
    """默认时长: 1.96s"""
    _3D翻页01            = TransitionMeta("3D翻页01", True, "7522590901785447697", "7522590901785447697", "9ddea0c79bb1370deae69ee1afb275c4", 1.000, True)
    """默认时长: 1.00s"""
    _3D翻页02            = TransitionMeta("3D翻页02", True, "7524036475948748033", "7524036475948748033", "342e703c74308e3b40eabfd4e8f6cbc5", 1.000, True)
    """默认时长: 1.00s"""
    _3D轮播              = TransitionMeta("3D轮播", True, "7490522544471035189", "7490522544471035189", "73ca6a1232719bdbf6bc4387bb3831fa", 2.000, True)
    """默认时长: 2.00s"""
    _3D钥匙              = TransitionMeta("3D钥匙", True, "7477828540969259521", "7477828540969259521", "fc765cd814b9ad6c38624632b5d00a04", 2.000, True)
    """默认时长: 2.00s"""
    _3D魔方              = TransitionMeta("3D魔方", True, "7522415446914501904", "7522415446914501904", "41a1a3b0c64d977942ed9d8d1c4e8f74", 2.000, True)
    """默认时长: 2.00s"""
    _3_框滑动            = TransitionMeta("3 框滑动", True, "7478447880483720501", "7478447880483720501", "2a58edff06ed6cc6950dea8fe93f5f2b", 2.000, True)
    """默认时长: 2.00s"""
    _4帧切换             = TransitionMeta("4帧切换", True, "7522500283616791869", "7522500283616791869", "160784598ea1c7f34a17760c0979655c", 2.000, True)
    """默认时长: 2.00s"""
    一闪而过             = TransitionMeta("一闪而过", True, "7497047817244986641", "7497047817244986641", "e975ff343bb9e74b9f31952cb8f311a0", 1.640, True)
    """默认时长: 1.64s"""
    一闪而过II           = TransitionMeta("一闪而过II", True, "7501147899141639440", "7501147899141639440", "b619c85ffd2eaf7ced2f46de4066973e", 1.600, True)
    """默认时长: 1.60s"""
    万花筒               = TransitionMeta("万花筒", True, "7258172571294634498", "7258172571294634498", "0aa1d28fdb90725586089436e6ccd243", 0.800, True)
    """默认时长: 0.80s"""
    三卡切换             = TransitionMeta("三卡切换", True, "7495714511308016949", "7495714511308016949", "a545c4854480577ab243e2b536e45082", 2.000, True)
    """默认时长: 2.00s"""
    三屏放大             = TransitionMeta("三屏放大", True, "7320493998710198786", "7320493998710198786", "b59a3df958aeeba78f1ceb075be189f0", 1.000, True)
    """默认时长: 1.00s"""
    三屏闪切             = TransitionMeta("三屏闪切", True, "7252631917437129218", "7252631917437129218", "e47aeeef97032d11bf767bd290881da4", 0.800, True)
    """默认时长: 0.80s"""
    三帧幻灯片_2         = TransitionMeta("三帧幻灯片 2", True, "7509413701385030965", "7509413701385030965", "e321a66645a36bebf9875cf58889ccb3", 2.000, True)
    """默认时长: 2.00s"""
    三片撕裂             = TransitionMeta("三片撕裂", True, "7508582186770042173", "7508582186770042173", "10ba5f1837784cb57ac77889e02f4c2d", 1.170, True)
    """默认时长: 1.17s"""
    三维旋转             = TransitionMeta("三维旋转", True, "7522417141698530561", "7522417141698530561", "0470e2cc3d3efb6a2c15a462a666bc74", 1.670, True)
    """默认时长: 1.67s"""
    三行立体翻转         = TransitionMeta("三行立体翻转", True, "7517491271045336336", "7517491271045336336", "a721940650cba1775f0384b259a7952a", 1.480, True)
    """默认时长: 1.48s"""
    三角分割             = TransitionMeta("三角分割", True, "7320499125974209026", "7320499125974209026", "03a80eec3a2b28713a66dc7ce8bf6f0a", 0.600, True)
    """默认时长: 0.60s"""
    三重断裂             = TransitionMeta("三重断裂", True, "7504973613095783741", "7504973613095783741", "642cdd758db6644c8d9e10c37a2230e1", 2.000, True)
    """默认时长: 2.00s"""
    上下扭闪             = TransitionMeta("上下扭闪", True, "7495952251886849296", "7495952251886849296", "41aa74cd04f043fe3b5b3ed64a452358", 1.170, True)
    """默认时长: 1.17s"""
    上下眩晕             = TransitionMeta("上下眩晕", True, "7530871204857580853", "7530871204857580853", "101cc8206154a06a2a0087bf8b2c5052", 1.000, True)
    """默认时长: 1.00s"""
    下坠                 = TransitionMeta("下坠", True, "7399927453642134033", "7399927453642134033", "8d1c0ecc937132dea6852ae18ca031a4", 1.100, True)
    """默认时长: 1.10s"""
    下扭滑页             = TransitionMeta("下扭滑页", True, "7511579932963769601", "7511579932963769601", "4f3f19b504acfc12f65ee66a766d342d", 1.000, True)
    """默认时长: 1.00s"""
    下拉负片             = TransitionMeta("下拉负片", True, "7506766775481158928", "7506766775481158928", "a3ccbb5d551ad1b5522a2c906cb47b43", 0.620, True)
    """默认时长: 0.62s"""
    下滑                 = TransitionMeta("下滑", True, "7309454269982183938", "7309454269982183938", "9c54ccb7b27ab98f7c3bb03a5d4acc4b", 0.550, True)
    """默认时长: 0.55s"""
    丑角催眠             = TransitionMeta("丑角催眠", True, "7526839710925344061", "7526839710925344061", "d717db4abfa099537319796153fcaef5", 2.000, True)
    """默认时长: 2.00s"""
    丝滑渐隐             = TransitionMeta("丝滑渐隐", True, "7530475620757720321", "7530475620757720321", "f992808c49c695b8bf5e79ec79d3ef4a", 2.000, True)
    """默认时长: 2.00s"""
    丝滑马赛克           = TransitionMeta("丝滑马赛克", True, "7529386966392065296", "7529386966392065296", "b9cbc4b5db0635eb1af0b67a7823fde3", 1.170, True)
    """默认时长: 1.17s"""
    中心切开             = TransitionMeta("中心切开", True, "7451535589569991185", "7451535589569991185", "bd58325fc11ddc0a5b865da741d48215", 2.000, True)
    """默认时长: 2.00s"""
    中心隐藏             = TransitionMeta("中心隐藏", True, "7532036955014548789", "7532036955014548789", "e1be6b37cea72b9a18aeabbdc5eb0b54", 2.000, True)
    """默认时长: 2.00s"""
    中轴翻转             = TransitionMeta("中轴翻转", True, "7532791872822037821", "7532791872822037821", "5b9bcc10dcff7248076e1c6265d5b2b5", 2.000, True)
    """默认时长: 2.00s"""
    主扫描               = TransitionMeta("主扫描", True, "7508585156421225781", "7508585156421225781", "29f6892521a311c14f058fa9b11d0728", 2.000, True)
    """默认时长: 2.00s"""
    乱码胶片             = TransitionMeta("乱码胶片", True, "7217496143461093889", "7217496143461093889", "723d75e7c96c63be6e0bc8bbd9491fbb", 0.750, True)
    """默认时长: 0.75s"""
    乱码胶片_II          = TransitionMeta("乱码胶片 II", True, "7267840362134114818", "7267840362134114818", "76dc82ba6f0b2fca64d39179015a4dda", 0.700, True)
    """默认时长: 0.70s"""
    二分滑动             = TransitionMeta("二分滑动", True, "7529386766839729425", "7529386766839729425", "9586397e56512d338809190cb10e9e8b", 2.000, True)
    """默认时长: 2.00s"""
    二次元烟效           = TransitionMeta("二次元烟效", True, "7439647267235041793", "7439647267235041793", "e4a8dcb9c3a3244f38fbafd54df1875d", 1.920, True)
    """默认时长: 1.92s"""
    云爆发               = TransitionMeta("云爆发", True, "7530875853752847669", "7530875853752847669", "540bfbd0cf12acacb72b225ec70b6f48", 2.000, True)
    """默认时长: 2.00s"""
    云雾散开             = TransitionMeta("云雾散开", True, "7528016281648385341", "7528016281648385341", "69a7b35254b983a2630d094ba966591f", 2.000, True)
    """默认时长: 2.00s"""
    交叉剪辑             = TransitionMeta("交叉剪辑", True, "7526829797511548221", "7526829797511548221", "f3a65cd433fd44c788faddff0d96c026", 2.000, True)
    """默认时长: 2.00s"""
    交叉破裂             = TransitionMeta("交叉破裂", True, "7483390336790727997", "7483390336790727997", "5eeb11b15d922d84524635a44600779e", 2.000, True)
    """默认时长: 2.00s"""
    交错滑动             = TransitionMeta("交错滑动", True, "7508766426568707381", "7508766426568707381", "1d1b154f2aa895a43a92dd6d624c7bdb", 1.170, True)
    """默认时长: 1.17s"""
    亮度控制             = TransitionMeta("亮度控制", True, "7532247939037564213", "7532247939037564213", "d00b5cf3cc28a37fe229a63c1dc3b809", 1.280, True)
    """默认时长: 1.28s"""
    传单飞走             = TransitionMeta("传单飞走", True, "7521482072578362625", "7521482072578362625", "fe5fe05c71911d0bb7a727a4c2d157f1", 2.370, True)
    """默认时长: 2.37s"""
    传送光束             = TransitionMeta("传送光束", True, "7529027315347508533", "7529027315347508533", "8ffecc903d53c097165cf0038a47125e", 1.830, True)
    """默认时长: 1.83s"""
    位移器               = TransitionMeta("位移器", True, "7490530580610780477", "7490530580610780477", "9492b443d04d43fcc2287a2079878f53", 2.000, True)
    """默认时长: 2.00s"""
    余烬快闪             = TransitionMeta("余烬快闪", True, "7530566706733796661", "7530566706733796661", "1904e7a54a01ca61e3d3646d38348ef1", 1.830, True)
    """默认时长: 1.83s"""
    侧边翻转             = TransitionMeta("侧边翻转", True, "7527917356031446325", "7527917356031446325", "e4fa3dd403ce526dfe8c8f5fd0096652", 2.000, True)
    """默认时长: 2.00s"""
    俏皮像素化效果       = TransitionMeta("俏皮像素化效果", True, "7489013625462607165", "7489013625462607165", "0cf61edb46f3d4bef10c55ccffab37ad", 2.000, True)
    """默认时长: 2.00s"""
    信号故障             = TransitionMeta("信号故障", True, "7290867805031764482", "7290867805031764482", "961d9bf17a500bbea9e675dde367f3e7", 0.500, True)
    """默认时长: 0.50s"""
    信号错误             = TransitionMeta("信号错误", True, "7524995697079242037", "7524995697079242037", "15aa7917eb0f169083e5bc8bbe0961dd", 2.000, True)
    """默认时长: 2.00s"""
    倒放俄罗斯方块       = TransitionMeta("倒放俄罗斯方块", True, "7530587212757486909", "7530587212757486909", "d8784bd36953d4d4db20e28b93aa8be1", 2.000, True)
    """默认时长: 2.00s"""
    倒置半屏             = TransitionMeta("倒置半屏", True, "7532895167523736885", "7532895167523736885", "6c7dac55621a2fabea4470f7b3f4441d", 1.000, True)
    """默认时长: 1.00s"""
    倒计时突袭           = TransitionMeta("倒计时突袭", True, "7528637098434235701", "7528637098434235701", "5ea386c4fd56164f2490b149b494afd5", 2.000, True)
    """默认时长: 2.00s"""
    倾斜分割             = TransitionMeta("倾斜分割", True, "7514177573828480309", "7514177573828480309", "24ea0e006cd65f57d5b6f0c0e3dbdd4e", 2.000, True)
    """默认时长: 2.00s"""
    倾斜切片             = TransitionMeta("倾斜切片", True, "7533159920871558453", "7533159920871558453", "056c85d3ea133148054b55b18e407a37", 1.830, True)
    """默认时长: 1.83s"""
    倾斜开关             = TransitionMeta("倾斜开关", True, "7479201727120559421", "7479201727120559421", "f451accb6a076d8973e9e3f4e87b598c", 2.000, True)
    """默认时长: 2.00s"""
    倾斜拉伸             = TransitionMeta("倾斜拉伸", True, "7384007623328141841", "7384007623328141841", "c87e594192131b1b82e1c34cd383f807", 0.800, True)
    """默认时长: 0.80s"""
    倾斜拉开             = TransitionMeta("倾斜拉开", True, "7451535587808383489", "7451535587808383489", "5e528175496005ab698956e2ae692828", 2.000, True)
    """默认时长: 2.00s"""
    倾斜滑动             = TransitionMeta("倾斜滑动", True, "7468341562280348989", "7468341562280348989", "aa5d900a86ee219edbde83a1ff00bedb", 2.000, True)
    """默认时长: 2.00s"""
    倾斜滚动             = TransitionMeta("倾斜滚动", True, "7524356598265941301", "7524356598265941301", "adf4e9c0506a6e3e49d9c2371472acb5", 2.000, True)
    """默认时长: 2.00s"""
    偏移重复             = TransitionMeta("偏移重复", True, "7506751003622952253", "7506751003622952253", "9359975ad6940715c52d3042359cc51d", 2.000, True)
    """默认时长: 2.00s"""
    催眠漩涡             = TransitionMeta("催眠漩涡", True, "7530563154191846717", "7530563154191846717", "020db734b0216efa85630d6376f42db6", 2.000, True)
    """默认时长: 2.00s"""
    像素条形分割         = TransitionMeta("像素条形分割", True, "7481553140429475127", "7481553140429475127", "510082fe5079fd9f0028cf562bd4a2c7", 1.970, True)
    """默认时长: 1.97s"""
    像素洞               = TransitionMeta("像素洞", True, "7513912974633913653", "7513912974633913653", "07ed602a4bfd299061fd34b1cd24476e", 1.000, True)
    """默认时长: 1.00s"""
    像素渐隐             = TransitionMeta("像素渐隐", True, "7500917399399566653", "7500917399399566653", "3f84978e45b50d77aa3e649c27327a90", 2.200, True)
    """默认时长: 2.20s"""
    像素漫画             = TransitionMeta("像素漫画", True, "7239651142827774465", "7239651142827774465", "c45a03a10ebc48475a40e7a79d5e18ef", 0.600, True)
    """默认时长: 0.60s"""
    像素爱心             = TransitionMeta("像素爱心", True, "7508070167113387325", "7508070167113387325", "c9572de597561159e1797ae6f2c460e1", 2.530, True)
    """默认时长: 2.53s"""
    像素粉               = TransitionMeta("像素粉", True, "7498332943513914677", "7498332943513914677", "39af34cb6790234416bb85ae3b5671fa", 2.000, True)
    """默认时长: 2.00s"""
    光剑切割             = TransitionMeta("光剑切割", True, "7488330406916263221", "7488330406916263221", "7b89f142f64cc818053c084415b6a086", 2.000, True)
    """默认时长: 2.00s"""
    光学耀斑             = TransitionMeta("光学耀斑", True, "7483071937208388917", "7483071937208388917", "03e1bdeb40903c81fee636297fb736c1", 2.000, True)
    """默认时长: 2.00s"""
    光影闪动             = TransitionMeta("光影闪动", True, "7488098106727238929", "7488098106727238929", "0a5a75f8d0bd17df3f8c1ca4ba507e37", 1.000, True)
    """默认时长: 1.00s"""
    光晕变焦             = TransitionMeta("光晕变焦", True, "7269672934933795329", "7269672934933795329", "6b5534065b70ca08340997bad86ed435", 0.800, True)
    """默认时长: 0.80s"""
    光晕缩放             = TransitionMeta("光晕缩放", True, "7508775551004314933", "7508775551004314933", "e27709696bfbf0b85249b59ecb62cfe5", 2.000, True)
    """默认时长: 2.00s"""
    光条                 = TransitionMeta("光条", True, "7527992534648311101", "7527992534648311101", "3eab1494a568ecd96d0a8cae6c5950ea", 2.000, True)
    """默认时长: 2.00s"""
    光标点击             = TransitionMeta("光标点击", True, "7480326427292847413", "7480326427292847413", "70c51185784d53e1c4cf0bf1a2012af5", 2.000, True)
    """默认时长: 2.00s"""
    光爆                 = TransitionMeta("光爆", True, "7479375858440916285", "7479375858440916285", "3430e6a0c6d58d85346a2482ace05b7a", 2.000, True)
    """默认时长: 2.00s"""
    光盘切换             = TransitionMeta("光盘切换", True, "7522496670173498677", "7522496670173498677", "05c1ea77cee763b0c05a49b91108282b", 2.000, True)
    """默认时长: 2.00s"""
    光线涂鸦             = TransitionMeta("光线涂鸦", True, "7502324503830154497", "7502324503830154497", "5cfd98c995a9a0386cd1c2d97a648ff8", 0.480, True)
    """默认时长: 0.48s"""
    光辉出口             = TransitionMeta("光辉出口", True, "7516461471019158845", "7516461471019158845", "fe66afc14ff06e1dce18bf32c3fa3653", 1.830, True)
    """默认时长: 1.83s"""
    光速扭曲             = TransitionMeta("光速扭曲", True, "7513975664463203645", "7513975664463203645", "5d74e528527f12d3d1b91eb18979ebeb", 1.330, True)
    """默认时长: 1.33s"""
    克隆激光             = TransitionMeta("克隆激光", True, "7514228964672507189", "7514228964672507189", "733e802c9cde966ca9f3e9a4de2d0b4f", 1.830, True)
    """默认时长: 1.83s"""
    克隆翻转             = TransitionMeta("克隆翻转", True, "7528382656225054005", "7528382656225054005", "d467908a22581d02b4e59921e6be0224", 2.000, True)
    """默认时长: 2.00s"""
    克隆错误             = TransitionMeta("克隆错误", True, "7501280153457184053", "7501280153457184053", "7deff676d26a8753727d16cc246e8c2e", 1.330, True)
    """默认时长: 1.33s"""
    全息扫描             = TransitionMeta("全息扫描", True, "7487751510525283637", "7487751510525283637", "c965981ab16686135338d65ea98aeb6d", 2.000, True)
    """默认时长: 2.00s"""
    全息投影             = TransitionMeta("全息投影", True, "7299463699784274433", "7299463699784274433", "95a2a049736e0843b5984e0090276f7b", 0.400, True)
    """默认时长: 0.40s"""
    全息投影旋转         = TransitionMeta("全息投影旋转", True, "7478680279666773309", "7478680279666773309", "e311f449f40193e6520b70c1ba24c0df", 2.000, True)
    """默认时长: 2.00s"""
    全息撕裂             = TransitionMeta("全息撕裂", True, "7477916504663625021", "7477916504663625021", "bb2c258912a01c59a2c28ac15e161e60", 1.000, True)
    """默认时长: 1.00s"""
    六边形Kira           = TransitionMeta("六边形Kira", True, "7522416272844295441", "7522416272844295441", "567c8f354d92f03366df5ca07d42ec1a", 1.530, True)
    """默认时长: 1.53s"""
    六边形变焦           = TransitionMeta("六边形变焦", True, "7184693655641264641", "7184693655641264641", "acfd328bcace433d08e7d64ae91261e3", 0.500, True)
    """默认时长: 0.50s"""
    冰冷光环             = TransitionMeta("冰冷光环", True, "7509786351001177397", "7509786351001177397", "57bc1fb35178313c1235c5a651b5ac34", 2.000, True)
    """默认时长: 2.00s"""
    冰柱故障             = TransitionMeta("冰柱故障", True, "7508772657375055165", "7508772657375055165", "71cf980fb24f84508fcc1a5a281a7e3c", 2.000, True)
    """默认时长: 2.00s"""
    冲击感               = TransitionMeta("冲击感", True, "7495955168005999888", "7495955168005999888", "3ab399bd349a68ba0fd047563be32124", 1.640, True)
    """默认时长: 1.64s"""
    冲击波               = TransitionMeta("冲击波", True, "7385064341524976145", "7385064341524976145", "608a4f0f4729821ff115f72bfb57a909", 0.900, True)
    """默认时长: 0.90s"""
    凌乱的橡皮擦         = TransitionMeta("凌乱的橡皮擦", True, "7502089271134752053", "7502089271134752053", "8303f3de8804d3218f214022b0a0593b", 1.070, True)
    """默认时长: 1.07s"""
    几何分割             = TransitionMeta("几何分割", True, "7140916985566597634", "7140916985566597634", "4f6209fcc7e8746a7c1e43d8a1704827", 0.500, True)
    """默认时长: 0.50s"""
    几何滑动             = TransitionMeta("几何滑动", True, "7439647267235041809", "7439647267235041809", "954c56284f79c2d01b291802cc6449e1", 1.000, True)
    """默认时长: 1.00s"""
    凸起瓷砖             = TransitionMeta("凸起瓷砖", True, "7522436559778368829", "7522436559778368829", "4db437b6b6477720678855e96fa87652", 2.000, True)
    """默认时长: 2.00s"""
    击掌                 = TransitionMeta("击掌", True, "7512385189935467837", "7512385189935467837", "50c14a7225fb3cea79208a9a2a09782a", 1.500, True)
    """默认时长: 1.50s"""
    分割                 = TransitionMeta("分割", True, "7337995755698786818", "7337995755698786818", "68a7408f6c6af86d6572c906e925b7e7", 1.000, True)
    """默认时长: 1.00s"""
    分割缩放             = TransitionMeta("分割缩放", True, "7531966204181794065", "7531966204181794065", "507917e78cda32bbaaafe2b635b69956", 1.000, True)
    """默认时长: 1.00s"""
    分割翻转             = TransitionMeta("分割翻转", True, "7528380679315295549", "7528380679315295549", "ece18f1bf9ab4851529b55d1b74cb175", 2.000, True)
    """默认时长: 2.00s"""
    分割转场             = TransitionMeta("分割转场", True, "7457440690373446965", "7457440690373446965", "c4e81325ddb7fd35f307422c02893650", 1.000, True)
    """默认时长: 1.00s"""
    分区缩放             = TransitionMeta("分区缩放", True, "7495600350498458941", "7495600350498458941", "8997cd62a0b3cfac79e90766e45fbe7e", 2.000, True)
    """默认时长: 2.00s"""
    分格翻转             = TransitionMeta("分格翻转", True, "7522414284815486224", "7522414284815486224", "5b5522969e0649aea496438276b1d8c2", 2.000, True)
    """默认时长: 2.00s"""
    分解                 = TransitionMeta("分解", True, "7507966750487629109", "7507966750487629109", "84f460c6e78eb315e0f441c005ebb4cb", 2.000, True)
    """默认时长: 2.00s"""
    分身拼贴             = TransitionMeta("分身拼贴", True, "7275622903087895042", "7275622903087895042", "c292162ca12a35c8c0e2b349df4dbe43", 0.800, True)
    """默认时长: 0.80s"""
    切换快门             = TransitionMeta("切换快门", True, "7516991123294883133", "7516991123294883133", "4e29af6b652d2aa17a8ed3eb5a9a02d0", 2.000, True)
    """默认时长: 2.00s"""
    切片滑动             = TransitionMeta("切片滑动", True, "7479463324699086133", "7479463324699086133", "0b5f69c9c6abf74b4c98b4f89e0bb636", 2.000, True)
    """默认时长: 2.00s"""
    划掉                 = TransitionMeta("划掉", True, "7493100911724743997", "7493100911724743997", "eebebac7b5aa0b99d1c7cb02735b2c52", 1.430, True)
    """默认时长: 1.43s"""
    划痕纸               = TransitionMeta("划痕纸", True, "7508677818092358973", "7508677818092358973", "9fd1cccc9c3e1cefe7a2fbf4fcb18482", 1.000, True)
    """默认时长: 1.00s"""
    列车驶过             = TransitionMeta("列车驶过", True, "7495955168006114576", "7495955168006114576", "39ccb96f8ca97bd3888c91b434037c00", 2.500, True)
    """默认时长: 2.50s"""
    刮划                 = TransitionMeta("刮划", True, "7478693780615466301", "7478693780615466301", "319dcbf3d0753580a6ca8609d454c5b2", 1.830, True)
    """默认时长: 1.83s"""
    刷卡                 = TransitionMeta("刷卡", True, "7527645021026225469", "7527645021026225469", "7a9768dae013b0abf58359b61d010621", 2.000, True)
    """默认时长: 2.00s"""
    刷子图框             = TransitionMeta("刷子图框", True, "7498284965306600757", "7498284965306600757", "ca259de86e02f4cd66a9b708a99051d3", 1.000, True)
    """默认时长: 1.00s"""
    刷门户               = TransitionMeta("刷门户", True, "7494163336699874621", "7494163336699874621", "607670fe425f5b733d815df301fe7b89", 2.000, True)
    """默认时长: 2.00s"""
    前后对比             = TransitionMeta("前后对比", True, "7205856409794122242", "7205856409794122242", "f38bc39938f58a4ee3f9c7bfcf4f524f", 1.200, True)
    """默认时长: 1.20s"""
    剥离                 = TransitionMeta("剥离", True, "7485992336841837830", "7485992336841837830", "b154d4f92c62c7efdc79efedf93720f9", 1.990, True)
    """默认时长: 1.99s"""
    剪切与扩写           = TransitionMeta("剪切与扩写", True, "7512684552104594749", "7512684552104594749", "453a611b62430691a9e125bd6fa485db", 2.000, True)
    """默认时长: 2.00s"""
    剪切失真             = TransitionMeta("剪切失真", True, "7505107948251761973", "7505107948251761973", "05d78869423179d646146b3d8852bf79", 2.000, True)
    """默认时长: 2.00s"""
    剪影位移             = TransitionMeta("剪影位移", True, "7502302035413355829", "7502302035413355829", "05146e399af8430694d6704ed20feec7", 2.000, True)
    """默认时长: 2.00s"""
    剪裁切换             = TransitionMeta("剪裁切换", True, "7471141080247881013", "7471141080247881013", "b84f8e82547c0d84f4345ee38a2d451c", 2.000, True)
    """默认时长: 2.00s"""
    剪贴簿装裱           = TransitionMeta("剪贴簿装裱", True, "7514640569105222965", "7514640569105222965", "a315f9b21c515ad42a38dd43b092908b", 1.000, True)
    """默认时长: 1.00s"""
    剪辑场景混搭         = TransitionMeta("剪辑场景混搭", True, "7530900876819565877", "7530900876819565877", "9c130d778ff6275f72e350c66a94e69a", 2.000, True)
    """默认时长: 2.00s"""
    劈开                 = TransitionMeta("劈开", True, "7520102352884337973", "7520102352884337973", "1be83747c496e6ad3865375b22c2fe8e", 2.000, True)
    """默认时长: 2.00s"""
    动作剪辑             = TransitionMeta("动作剪辑", True, "7517269537532710205", "7517269537532710205", "fef8d2fce80e77d6fa2c7ad71652819c", 2.000, True)
    """默认时长: 2.00s"""
    动力缩放             = TransitionMeta("动力缩放", True, "7531057139125734709", "7531057139125734709", "c6d68fc2c29f8c31ab86c4b311be10f5", 2.000, True)
    """默认时长: 2.00s"""
    动感下拉             = TransitionMeta("动感下拉", True, "7530467385636179217", "7530467385636179217", "a7592d392b37875183b3e28d493119f8", 1.040, True)
    """默认时长: 1.04s"""
    动漫变速             = TransitionMeta("动漫变速", True, "7527993768037928253", "7527993768037928253", "12abe6e80ddad0ed4c0aad19fa2e9ca4", 2.000, True)
    """默认时长: 2.00s"""
    动漫爆炸             = TransitionMeta("动漫爆炸", True, "7477912769984089405", "7477912769984089405", "93407ec057e16f243a75df0bb38279bb", 2.000, True)
    """默认时长: 2.00s"""
    十字切分             = TransitionMeta("十字切分", True, "7506007023301954832", "7506007023301954832", "acb120e1582f401ca997eb98ac50851b", 1.000, True)
    """默认时长: 1.00s"""
    半色调切换           = TransitionMeta("半色调切换", True, "7495332294446632245", "7495332294446632245", "903dc5c84e2c70fa97dafe8808cca118", 2.000, True)
    """默认时长: 2.00s"""
    半色调幻灯片         = TransitionMeta("半色调幻灯片", True, "7527217934847053109", "7527217934847053109", "5a653fb75df132179eeed79beb47091f", 2.000, True)
    """默认时长: 2.00s"""
    半色调擦除           = TransitionMeta("半色调擦除", True, "7525367414175960381", "7525367414175960381", "6c087e9ab5c606dc6bffcc65c1b27ee8", 2.000, True)
    """默认时长: 2.00s"""
    卡住的滑块           = TransitionMeta("卡住的滑块", True, "7473109016051256629", "7473109016051256629", "85bc95e68948091d3a203ca50e582885", 2.000, True)
    """默认时长: 2.00s"""
    卡片弹出             = TransitionMeta("卡片弹出", True, "7384368193122341377", "7384368193122341377", "67660fa9cdb387454a59d3a747cff6ef", 1.000, True)
    """默认时长: 1.00s"""
    卡片洗牌             = TransitionMeta("卡片洗牌", True, "7502334410407152949", "7502334410407152949", "340f9f49ba6f7b068b016d57e386cdf2", 2.000, True)
    """默认时长: 2.00s"""
    卡片空间             = TransitionMeta("卡片空间", True, "7490777235301993729", "7490777235301993729", "1ded50cf5b5f12da24b27ca0c00f9132", 1.500, True)
    """默认时长: 1.50s"""
    卡片选择             = TransitionMeta("卡片选择", True, "7497122597956554045", "7497122597956554045", "1ab8bd9c96bbf29614fce3e900ce071e", 2.000, True)
    """默认时长: 2.00s"""
    卡纸掉落             = TransitionMeta("卡纸掉落", True, "7527519457149766913", "7527519457149766913", "a8301b4260541e8b8914b85cced45519", 1.500, True)
    """默认时长: 1.50s"""
    卡通火光蔓延         = TransitionMeta("卡通火光蔓延", True, "7528108400459238709", "7528108400459238709", "fff64e6d63bf755fbb9d58340d26b9c5", 2.000, True)
    """默认时长: 2.00s"""
    压缩滑动             = TransitionMeta("压缩滑动", True, "7516940476096777525", "7516940476096777525", "1905adb5aac168233b99987da1f61369", 2.000, True)
    """默认时长: 2.00s"""
    双卡切换             = TransitionMeta("双卡切换", True, "7527320825876286773", "7527320825876286773", "1b78519074e2c889df0b15b651a06e25", 1.030, True)
    """默认时长: 1.03s"""
    双图切换             = TransitionMeta("双图切换", True, "7522356952895163701", "7522356952895163701", "739335c962f79ed38de44ab91cc0eb0c", 2.000, True)
    """默认时长: 2.00s"""
    双重故障             = TransitionMeta("双重故障", True, "7476348440029515061", "7476348440029515061", "09a45aa644dd43e7e3b91b8fe6c033f5", 1.000, True)
    """默认时长: 1.00s"""
    双重翻转             = TransitionMeta("双重翻转", True, "7511915595621797181", "7511915595621797181", "61eeff6ef646b30266bfd7669c17b1a0", 2.000, True)
    """默认时长: 2.00s"""
    反相转场             = TransitionMeta("反相转场", True, "7473710407333450241", "7473710407333450241", "21550cb2256b73e8dcfdd96a9b469bab", 1.000, True)
    """默认时长: 1.00s"""
    反色频闪             = TransitionMeta("反色频闪", True, "7426273233906700816", "7426273233906700816", "5c3cf25dc9d037b7ddcf526bedbabaec", 1.000, True)
    """默认时长: 1.00s"""
    发光变焦             = TransitionMeta("发光变焦", True, "7403002581816971777", "7403002581816971777", "9faeac55ef029bce5e933ff4022dfe1d", 1.000, True)
    """默认时长: 1.00s"""
    发光圆盘             = TransitionMeta("发光圆盘", True, "7532795522868923701", "7532795522868923701", "088fe7217670466ee17a5928adc852bd", 2.000, True)
    """默认时长: 2.00s"""
    发光扭动             = TransitionMeta("发光扭动", True, "7514146553007787281", "7514146553007787281", "e5820aa77f40324a778cf813707edbc2", 1.120, True)
    """默认时长: 1.12s"""
    发光重影             = TransitionMeta("发光重影", True, "7496023270265834768", "7496023270265834768", "845c0cc95a0bf15e542cd3d7696d6deb", 1.000, True)
    """默认时长: 1.00s"""
    变形旋转             = TransitionMeta("变形旋转", True, "7533143661681462589", "7533143661681462589", "ab4fdf3ba1035ba64b6f94f7996fd3ad", 2.000, True)
    """默认时长: 2.00s"""
    变速滚动             = TransitionMeta("变速滚动", True, "7484415976553909565", "7484415976553909565", "338deee7bf62d43291848f9bbd40f75f", 2.000, True)
    """默认时长: 2.00s"""
    变速翻转             = TransitionMeta("变速翻转", True, "7494276772784098613", "7494276772784098613", "75ff13f90c87ef47ce7cb9649fe60686", 1.000, True)
    """默认时长: 1.00s"""
    叠化反相             = TransitionMeta("叠化反相", True, "7525540055239150864", "7525540055239150864", "553e4ef5adc9a5c2422ef0e7312e26f2", 2.000, True)
    """默认时长: 2.00s"""
    叠化扭曲             = TransitionMeta("叠化扭曲", True, "7441466472955646465", "7441466472955646465", "c0d00a409f16dab9ebe8a94802a3a757", 0.500, True)
    """默认时长: 0.50s"""
    叠影幻灯             = TransitionMeta("叠影幻灯", True, "7533468878630948157", "7533468878630948157", "34661bbde464d4ace1aadce26d24c0aa", 2.000, True)
    """默认时长: 2.00s"""
    叠影旋转             = TransitionMeta("叠影旋转", True, "7490376418958773521", "7490376418958773521", "1406d4ffbb7f159a8cd81f8436f9c7d5", 1.030, True)
    """默认时长: 1.03s"""
    可爱龙龙             = TransitionMeta("可爱龙龙", True, "7332719562468626945", "7332719562468626945", "9a498314d92e4fc192efe64608b40b60", 1.000, True)
    """默认时长: 1.00s"""
    吃掉                 = TransitionMeta("吃掉", True, "7373885226138735105", "7373885226138735105", "9ad9702be8e45423f7fae7ebd1a85b5b", 0.900, True)
    """默认时长: 0.90s"""
    同步错误             = TransitionMeta("同步错误", True, "7511520545301597501", "7511520545301597501", "b64c36689a5e2cab58e260bb7f3b2b6f", 2.000, True)
    """默认时长: 2.00s"""
    后台切换             = TransitionMeta("后台切换", True, "7320518175005610497", "7320518175005610497", "c5092413343f5e808ffc27ab8b02e7c4", 0.800, True)
    """默认时长: 0.80s"""
    向上波动             = TransitionMeta("向上波动", True, "7148737647546995201", "7148737647546995201", "69a520845b900b142b203cf2e677abd5", 0.500, True)
    """默认时长: 0.50s"""
    向下拖拽             = TransitionMeta("向下拖拽", True, "7200694892517921281", "7200694892517921281", "f1d490e1e2a87013bee63a8aa4191f9f", 0.500, True)
    """默认时长: 0.50s"""
    向下涂刷             = TransitionMeta("向下涂刷", True, "7497075442877222197", "7497075442877222197", "e43941b26ccdbdfa8cdbf8047640e806", 2.000, True)
    """默认时长: 2.00s"""
    向下翻转             = TransitionMeta("向下翻转", True, "7525326077883845949", "7525326077883845949", "14ff758cf9d39049a221994ba30f59c8", 2.000, True)
    """默认时长: 2.00s"""
    向右滑动             = TransitionMeta("向右滑动", True, "7509340213584416016", "7509340213584416016", "c64c2579605d2264946f8a735a573845", 2.430, True)
    """默认时长: 2.43s"""
    向右翻转             = TransitionMeta("向右翻转", True, "7525323882941762869", "7525323882941762869", "923db2f70943b16946c945cfe742e542", 2.000, True)
    """默认时长: 2.00s"""
    向左拉屏             = TransitionMeta("向左拉屏", True, "7131930113452544513", "7131930113452544513", "202ceeb31cd138bbd4db4216e74cbb5b", 0.500, True)
    """默认时长: 0.50s"""
    向左波动             = TransitionMeta("向左波动", True, "7148999973114221058", "7148999973114221058", "ff50e84f65b28c5a20f3844726b1ad96", 0.500, True)
    """默认时长: 0.50s"""
    吸收                 = TransitionMeta("吸收", True, "7486288371376049413", "7486288371376049413", "141b391d38432d6c741b485f22804e95", 1.000, True)
    """默认时长: 1.00s"""
    咬嚼特效             = TransitionMeta("咬嚼特效", True, "7507441595671743797", "7507441595671743797", "72f9a9a7104c13818182a494a89b8685", 2.000, True)
    """默认时长: 2.00s"""
    喷漆                 = TransitionMeta("喷漆", True, "7483054112779668797", "7483054112779668797", "a46bff0721ddb60bb13d12dc314fe778", 2.000, True)
    """默认时长: 2.00s"""
    嗖嗖滑动             = TransitionMeta("嗖嗖滑动", True, "7498297262318046525", "7498297262318046525", "9eded330bb15f459a188ec445ef4a23e", 2.000, True)
    """默认时长: 2.00s"""
    嗡嗡滑动             = TransitionMeta("嗡嗡滑动", True, "7517937038407109941", "7517937038407109941", "2fdfb8cb373a6d2c5b37323d8a61d3bd", 2.000, True)
    """默认时长: 2.00s"""
    四格展开             = TransitionMeta("四格展开", True, "7526857129483865405", "7526857129483865405", "4adca296c17ff7ea3dc17afd3d9944ef", 2.000, True)
    """默认时长: 2.00s"""
    四窗口翻转           = TransitionMeta("四窗口翻转", True, "7525392327997705525", "7525392327997705525", "adef4a892cd23eae0227b4e82ccb2de4", 2.000, True)
    """默认时长: 2.00s"""
    四边展开             = TransitionMeta("四边展开", True, "7498201831902924048", "7498201831902924048", "72debc9ea67b752f9bca2eea13e12ec9", 1.030, True)
    """默认时长: 1.03s"""
    回忆拉屏             = TransitionMeta("回忆拉屏", True, "7187341797293560322", "7187341797293560322", "3bc26bcea93ea43b349c60c28bea394f", 0.500, True)
    """默认时长: 0.50s"""
    回忆拉屏_II          = TransitionMeta("回忆拉屏 II", True, "7309740200605782530", "7309740200605782530", "2464d4afc9c5f43072935915c6a86c29", 0.700, True)
    """默认时长: 0.70s"""
    图框弹跳             = TransitionMeta("图框弹跳", True, "7497435549234482493", "7497435549234482493", "9a7299bfba0a48b017a79653f6379f28", 1.870, True)
    """默认时长: 1.87s"""
    图框收缩             = TransitionMeta("图框收缩", True, "7483058889043332413", "7483058889043332413", "17b227ee7bd038fd95d3c45fab2d4175", 2.000, True)
    """默认时长: 2.00s"""
    图框滑动             = TransitionMeta("图框滑动", True, "7459391126168980797", "7459391126168980797", "93329554ecf0b388d890daee3190f2f4", 2.000, True)
    """默认时长: 2.00s"""
    图框选择             = TransitionMeta("图框选择", True, "7500639930691915069", "7500639930691915069", "c77dcefa898507f02c7201586e45728b", 1.000, True)
    """默认时长: 1.00s"""
    图片放大             = TransitionMeta("图片放大", True, "7434830442303328784", "7434830442303328784", "4974e799766ed1567d4e5bfafa79e14f", 1.000, True)
    """默认时长: 1.00s"""
    圆形分割             = TransitionMeta("圆形分割", True, "7131930085874995713", "7131930085874995713", "14e8876b21909dc5633e790b92700b42", 0.500, True)
    """默认时长: 0.50s"""
    圆形擦除             = TransitionMeta("圆形擦除", True, "7482962896377384245", "7482962896377384245", "77c219911972b5d5c0a370d02978a1e4", 2.000, True)
    """默认时长: 2.00s"""
    圆形滚动             = TransitionMeta("圆形滚动", True, "7532578081949715773", "7532578081949715773", "b58aae2be57704193116f42f44f328ba", 2.000, True)
    """默认时长: 2.00s"""
    圆角暗点             = TransitionMeta("圆角暗点", True, "7526885673912077621", "7526885673912077621", "7105c60d1c6757515414b93582c880b0", 2.000, True)
    """默认时长: 2.00s"""
    圣诞树               = TransitionMeta("圣诞树", True, "7304577707612836353", "7304577707612836353", "8c40262df8758d19446264aa5749008a", 0.700, True)
    """默认时长: 0.70s"""
    圣诞礼盒             = TransitionMeta("圣诞礼盒", True, "7449258379584737809", "7449258379584737809", "6da15163fec7a5af3ab7a25e44f94da9", 1.500, True)
    """默认时长: 1.50s"""
    地平线拉伸           = TransitionMeta("地平线拉伸", True, "7529416112253996341", "7529416112253996341", "8b34c25a660a8b079513f00078c21fdd", 2.000, True)
    """默认时长: 2.00s"""
    垂直模糊             = TransitionMeta("垂直模糊", True, "7525013839469874493", "7525013839469874493", "745fb9efb0e5a42b803aaf020ab572a6", 2.000, True)
    """默认时长: 2.00s"""
    垂直滑动             = TransitionMeta("垂直滑动", True, "7457841062753635645", "7457841062753635645", "f7750e61fe8fad34947624984c3fb463", 2.000, True)
    """默认时长: 2.00s"""
    垂直闪烁             = TransitionMeta("垂直闪烁", True, "7522769055699242293", "7522769055699242293", "97149fc7f6330f1212e05b3849b43699", 2.000, True)
    """默认时长: 2.00s"""
    塑料封面             = TransitionMeta("塑料封面", True, "7486112207500102965", "7486112207500102965", "0fe2de32fc1eacfcd64654cd2f6f67b0", 1.070, True)
    """默认时长: 1.07s"""
    复制品画廊           = TransitionMeta("复制品画廊", True, "7510137608035470653", "7510137608035470653", "869d491dc68fbff06dee2a5412e51944", 2.000, True)
    """默认时长: 2.00s"""
    复古撕裂             = TransitionMeta("复古撕裂", True, "7532922192615574845", "7532922192615574845", "14c7b5ea903bc265dea3980e72089ba0", 2.000, True)
    """默认时长: 2.00s"""
    复古泛光             = TransitionMeta("复古泛光", True, "7524921397928316176", "7524921397928316176", "828de67258365dacbbecb33638201f11", 0.870, True)
    """默认时长: 0.87s"""
    复古漏光             = TransitionMeta("复古漏光", True, "7184376846199296513", "7184376846199296513", "cd29228622ee4f3a94e6c9e1702f05a2", 0.500, True)
    """默认时长: 0.50s"""
    复古胶片             = TransitionMeta("复古胶片", True, "7263373235025089025", "7263373235025089025", "c5686c7e832a5e8c178c5cadb42d9ab4", 1.000, True)
    """默认时长: 1.00s"""
    复古赛博朋克         = TransitionMeta("复古赛博朋克", True, "7532477881394449717", "7532477881394449717", "7a6d741725075fb54fd564fbf29d7b3d", 1.200, True)
    """默认时长: 1.20s"""
    复古闪白             = TransitionMeta("复古闪白", True, "7475286070066680337", "7475286070066680337", "9dac31877321c222445437d3f147b167", 1.670, True)
    """默认时长: 1.67s"""
    多元宇宙碎裂         = TransitionMeta("多元宇宙碎裂", True, "7519793179697188149", "7519793179697188149", "99dee8dcb346cb1e968291403087188f", 1.500, True)
    """默认时长: 1.50s"""
    多层环形             = TransitionMeta("多层环形", True, "7374416694162231809", "7374416694162231809", "cf6da6be1066054f86c4524fa6494d8e", 1.500, True)
    """默认时长: 1.50s"""
    多屏定格             = TransitionMeta("多屏定格", True, "7291879285080461826", "7291879285080461826", "c12aeac3828eb06fd5d0f865ee7041d1", 0.800, True)
    """默认时长: 0.80s"""
    多屏球形             = TransitionMeta("多屏球形", True, "7517185774635240721", "7517185774635240721", "47b2760be2c8c891b1dd44b0ef38437f", 1.800, True)
    """默认时长: 1.80s"""
    多彩破坏             = TransitionMeta("多彩破坏", True, "7508759642005196093", "7508759642005196093", "e360f27d8d0853143d35382c07e87621", 2.000, True)
    """默认时长: 2.00s"""
    多彩错误             = TransitionMeta("多彩错误", True, "7493110523945405757", "7493110523945405757", "e2c6b6cab4998fddf326f3e3a9ca00eb", 1.670, True)
    """默认时长: 1.67s"""
    多轨滑动             = TransitionMeta("多轨滑动", True, "7507458552345169153", "7507458552345169153", "5a54c94248a9a4f30a2cf57aa219452b", 2.340, True)
    """默认时长: 2.34s"""
    多边形展开           = TransitionMeta("多边形展开", True, "7497537357411913021", "7497537357411913021", "90f3269200fc24a29791c7d91d1b946e", 2.000, True)
    """默认时长: 2.00s"""
    多边形缩放           = TransitionMeta("多边形缩放", True, "7512323514360270141", "7512323514360270141", "fe4160f2ad4cbcdf8cba2556d18af6f3", 2.000, True)
    """默认时长: 2.00s"""
    多面旋转             = TransitionMeta("多面旋转", True, "7531966268795014417", "7531966268795014417", "8895e32ac13476cd2944407f82c55cbd", 1.500, True)
    """默认时长: 1.50s"""
    大像素               = TransitionMeta("大像素", True, "7516512378461162805", "7516512378461162805", "9f5210b45b3f32490a5c3aa43d643e4c", 2.000, True)
    """默认时长: 2.00s"""
    大圆盘               = TransitionMeta("大圆盘", True, "7362947185249358353", "7362947185249358353", "9d6a02b47846369cec6d19a35826570d", 0.800, True)
    """默认时长: 0.80s"""
    太阳粉               = TransitionMeta("太阳粉", True, "7488641067756162365", "7488641067756162365", "0e77b10878bb4603170f659f802f53e7", 2.000, True)
    """默认时长: 2.00s"""
    太阳耀斑             = TransitionMeta("太阳耀斑", True, "7478183814045453629", "7478183814045453629", "15cb4308456e4dd933fe1322729f3173", 2.000, True)
    """默认时长: 2.00s"""
    夹扣翻转             = TransitionMeta("夹扣翻转", True, "7532893155402763581", "7532893155402763581", "14e2f94d84d07c6f0f6c3c057a18f427", 2.000, True)
    """默认时长: 2.00s"""
    威弗利格子           = TransitionMeta("威弗利格子", True, "7516939616700714301", "7516939616700714301", "bef754d6b5f618a139ba2361dbd4d1c5", 1.200, True)
    """默认时长: 1.20s"""
    字母拼贴             = TransitionMeta("字母拼贴", True, "7314555975376048641", "7314555975376048641", "24be4f664fcf760c00d897362194e276", 1.000, True)
    """默认时长: 1.00s"""
    宇宙翻转             = TransitionMeta("宇宙翻转", True, "7526857541674880309", "7526857541674880309", "9745328db276957010cdd1fce36843c2", 2.000, True)
    """默认时长: 2.00s"""
    宝石滴落             = TransitionMeta("宝石滴落", True, "7531981589761330485", "7531981589761330485", "cf29b9839a2e85441235048959a0232a", 2.000, True)
    """默认时长: 2.00s"""
    对折                 = TransitionMeta("对折", True, "7488159889504685313", "7488159889504685313", "9f2a0a235ad4f7d57d07dc735fe46291", 1.000, True)
    """默认时长: 1.00s"""
    对比分屏             = TransitionMeta("对比分屏", True, "7460753045769425425", "7460753045769425425", "a893316f7a6f29be4ede58d0e539638c", 1.000, True)
    """默认时长: 1.00s"""
    对角切割             = TransitionMeta("对角切割", True, "7505106089361329469", "7505106089361329469", "3c7750b24bd6f67342f584dc81f76797", 1.630, True)
    """默认时长: 1.63s"""
    对角撕纸             = TransitionMeta("对角撕纸", True, "7526884751764950325", "7526884751764950325", "2aca5c761d73ecf4f77a1e4ce86ac1d3", 2.000, True)
    """默认时长: 2.00s"""
    对话框               = TransitionMeta("对话框", True, "7496746937408867637", "7496746937408867637", "ac91145c676de8234104c59dee209bf5", 2.000, True)
    """默认时长: 2.00s"""
    居中分割             = TransitionMeta("居中分割", True, "7516934750024568125", "7516934750024568125", "daaf14b12abcdf88048b75a2efd5e5c5", 2.000, True)
    """默认时长: 2.00s"""
    居中翻转             = TransitionMeta("居中翻转", True, "7528332551136578869", "7528332551136578869", "7c48f14b48193b27f15287139fd4c1c6", 2.000, True)
    """默认时长: 2.00s"""
    屏幕切换             = TransitionMeta("屏幕切换", True, "7474956991220158993", "7474956991220158993", "167292f9e55466e79981aac5156a8e0a", 2.000, True)
    """默认时长: 2.00s"""
    屏幕切换_2           = TransitionMeta("屏幕切换 2", True, "7477433641581169981", "7477433641581169981", "9fbceeded97f10f0f46f48941234990e", 2.000, True)
    """默认时长: 2.00s"""
    屏幕异常             = TransitionMeta("屏幕异常", True, "7486828452696345909", "7486828452696345909", "912a9caf489c5d49a7de58b051f6fd66", 2.000, True)
    """默认时长: 2.00s"""
    屏蔽闪烁             = TransitionMeta("屏蔽闪烁", True, "7478246002756193597", "7478246002756193597", "4c628cbec531e8f450b6f591318fb8d8", 1.000, True)
    """默认时长: 1.00s"""
    左下旋入             = TransitionMeta("左下旋入", True, "7529380650726460689", "7529380650726460689", "3fedbbbf71c01c352b2ff7a702e9d3d8", 0.670, True)
    """默认时长: 0.67s"""
    左移切换             = TransitionMeta("左移切换", True, "7530461967044185360", "7530461967044185360", "df66beb096ab4517248612941fc61fb7", 2.000, True)
    """默认时长: 2.00s"""
    左移弹动             = TransitionMeta("左移弹动", True, "7314596142363185665", "7314596142363185665", "fa3f7df94e7fc6a7dfaee203590aff47", 0.800, True)
    """默认时长: 0.80s"""
    平滑切换             = TransitionMeta("平滑切换", True, "7516940583722585397", "7516940583722585397", "7fa663552f3e83ce2c66d4b49cc47cc0", 2.000, True)
    """默认时长: 2.00s"""
    平铺视图滑动         = TransitionMeta("平铺视图滑动", True, "7517620489683062069", "7517620489683062069", "2c923f2898c590d18dc740089adae488", 2.000, True)
    """默认时长: 2.00s"""
    幻影                 = TransitionMeta("幻影", True, "7219124910302433793", "7219124910302433793", "12e5752b106a972f1ccff2dd448ed2d5", 0.800, True)
    """默认时长: 0.80s"""
    幻影波动             = TransitionMeta("幻影波动", True, "7233996535921381890", "7233996535921381890", "608f44052079ccd3b1940ceeb1b34330", 0.670, True)
    """默认时长: 0.67s"""
    幻影疾驰             = TransitionMeta("幻影疾驰", True, "7496169852407745853", "7496169852407745853", "8240f61e7471910c9af85b08d85ba2a1", 2.000, True)
    """默认时长: 2.00s"""
    幻影闪现             = TransitionMeta("幻影闪现", True, "7245221222504468994", "7245221222504468994", "1cbd2578fe72157825089c49f44533e7", 0.800, True)
    """默认时长: 0.80s"""
    幻灯片立方体         = TransitionMeta("幻灯片立方体", True, "7494243043839610165", "7494243043839610165", "120e533f13e28517134fda2af80afbdd", 2.000, True)
    """默认时长: 2.00s"""
    幻觉                 = TransitionMeta("幻觉", True, "7395460612987294209", "7395460612987294209", "cb9796c59a719185df8c9c5d1922b061", 1.000, True)
    """默认时长: 1.00s"""
    幽灵闪光             = TransitionMeta("幽灵闪光", True, "7512061087039114557", "7512061087039114557", "96df23b8528447083fcd986d319995ae", 2.000, True)
    """默认时长: 2.00s"""
    应用切换             = TransitionMeta("应用切换", True, "7524598527708679485", "7524598527708679485", "728bb6dd96cddda30a46f4404d629ae4", 2.000, True)
    """默认时长: 2.00s"""
    开箱                 = TransitionMeta("开箱", True, "7485990943800298758", "7485990943800298758", "b56db7e927d012f0f03e0cebbf9e284e", 1.733, True)
    """默认时长: 1.73s"""
    弹出                 = TransitionMeta("弹出", True, "7395479726980076033", "7395479726980076033", "5c7ab5f82d4253e2225b57ba734edd3a", 0.900, True)
    """默认时长: 0.90s"""
    弹力拉扯             = TransitionMeta("弹力拉扯", True, "7485283161048370438", "7485283161048370438", "c2b8f8d46f4b71773c8acc2986266c17", 1.170, True)
    """默认时长: 1.17s"""
    弹动扭曲             = TransitionMeta("弹动扭曲", True, "7494109600627674385", "7494109600627674385", "aa462b58b27163fa6265120276b5dee5", 1.800, True)
    """默认时长: 1.80s"""
    弹射旋转             = TransitionMeta("弹射旋转", True, "7530565850831539509", "7530565850831539509", "2415c77be0be08e5e457be0314280957", 1.100, True)
    """默认时长: 1.10s"""
    弹性下坠             = TransitionMeta("弹性下坠", True, "7473044437115867665", "7473044437115867665", "fb71bd56b9777ee87ddf44a61f1b72f9", 0.670, True)
    """默认时长: 0.67s"""
    弹性擦拭             = TransitionMeta("弹性擦拭", True, "7532498057745665333", "7532498057745665333", "5643916ee0a857f0eee78e044b35243b", 2.000, True)
    """默认时长: 2.00s"""
    弹性镜头             = TransitionMeta("弹性镜头", True, "7525364104219970877", "7525364104219970877", "70b704a9a63dd9265156265a1857de88", 2.000, True)
    """默认时长: 2.00s"""
    弹框切换             = TransitionMeta("弹框切换", True, "7524071614707666193", "7524071614707666193", "7aae0a4cefc752dcf48d54136d5c8b39", 1.170, True)
    """默认时长: 1.17s"""
    弹窗转换             = TransitionMeta("弹窗转换", True, "7475413891892268341", "7475413891892268341", "00acf53c91a98ddaabcfa21e8dff4750", 1.330, True)
    """默认时长: 1.33s"""
    弹跳光芒             = TransitionMeta("弹跳光芒", True, "7521174278079778109", "7521174278079778109", "b77a2a4fcaf5a0441963a0b777b0edbf", 2.000, True)
    """默认时长: 2.00s"""
    弹跳压缩             = TransitionMeta("弹跳压缩", True, "7528328499719867709", "7528328499719867709", "f463b67f97f2ccb431d3d32e5bf936f4", 1.000, True)
    """默认时长: 1.00s"""
    弹跳黑白             = TransitionMeta("弹跳黑白", True, "7501190724734455041", "7501190724734455041", "b62db7037175fd1c2745938ebcbab073", 2.000, True)
    """默认时长: 2.00s"""
    强劲下扯             = TransitionMeta("强劲下扯", True, "7504171579174096145", "7504171579174096145", "be04d096836f8fae4bd6855f11913774", 1.480, True)
    """默认时长: 1.48s"""
    强烈阳光             = TransitionMeta("强烈阳光", True, "7528021414771805493", "7528021414771805493", "c34fbd20fbacdc79bf8611817a02b1fb", 4.000, True)
    """默认时长: 4.00s"""
    强震闪动             = TransitionMeta("强震闪动", True, "7504478382281837841", "7504478382281837841", "db894dc615efb5ca46dc2eea6f967a99", 1.240, True)
    """默认时长: 1.24s"""
    形状模糊             = TransitionMeta("形状模糊", True, "7526955248057863477", "7526955248057863477", "41a9f1c1b9c2b3fe3dfb1a02b84f17d9", 2.000, True)
    """默认时长: 2.00s"""
    彩色快照             = TransitionMeta("彩色快照", True, "7500209409117670717", "7500209409117670717", "a4ac655c9c07d0965ba043f26030ae62", 1.000, True)
    """默认时长: 1.00s"""
    彩色滑片             = TransitionMeta("彩色滑片", True, "7439647267230847504", "7439647267230847504", "08a7fd3434943bdd3dc0c2f6d9714989", 1.500, True)
    """默认时长: 1.50s"""
    彩虹烟雾             = TransitionMeta("彩虹烟雾", True, "7527884019359305021", "7527884019359305021", "138478340d20e51560255078936918b6", 2.000, True)
    """默认时长: 2.00s"""
    彩虹焦散             = TransitionMeta("彩虹焦散", True, "7524058686470294800", "7524058686470294800", "172deae2b2e36353a57c1e0548e8aeac", 2.000, True)
    """默认时长: 2.00s"""
    往复剪辑             = TransitionMeta("往复剪辑", True, "7532003808801574205", "7532003808801574205", "b7c699d14c56e00f94a09a287c55246a", 2.000, True)
    """默认时长: 2.00s"""
    微微旋转             = TransitionMeta("微微旋转", True, "7501546854874844432", "7501546854874844432", "dbdc9b19cc7befe86a3d2e35e622738b", 1.100, True)
    """默认时长: 1.10s"""
    微抖动               = TransitionMeta("微抖动", True, "7368739846019355137", "7368739846019355137", "9870ae40f2c8a325debc06d25ef46895", 1.500, True)
    """默认时长: 1.50s"""
    微晃拉扯             = TransitionMeta("微晃拉扯", True, "7527511904521096465", "7527511904521096465", "6a9413032d7b97b4260c1dc20cefa69a", 1.570, True)
    """默认时长: 1.57s"""
    微调翻转             = TransitionMeta("微调翻转", True, "7501668631915367741", "7501668631915367741", "8d10dc1d51e68a5de99a56507fa8957a", 2.000, True)
    """默认时长: 2.00s"""
    微震闪黑             = TransitionMeta("微震闪黑", True, "7504513585289219345", "7504513585289219345", "e8b19e94de155dbdc4a38575417798fb", 1.330, True)
    """默认时长: 1.33s"""
    心动缩放             = TransitionMeta("心动缩放", True, "7478306750995762485", "7478306750995762485", "54f73e5b847c187f9eb1aeda24a95e27", 2.000, True)
    """默认时长: 2.00s"""
    心形飞溅             = TransitionMeta("心形飞溅", True, "7500595520214207805", "7500595520214207805", "af0abaa404e3e82cfa596d9a70ee60c4", 2.000, True)
    """默认时长: 2.00s"""
    心脏爆裂             = TransitionMeta("心脏爆裂", True, "7516939245836193077", "7516939245836193077", "db790b3ce8808a37d68eedb3aaec19ea", 2.000, True)
    """默认时长: 2.00s"""
    快涂擦除             = TransitionMeta("快涂擦除", True, "7451535587820982800", "7451535587820982800", "584bed7ede0c38de9d86fb5e9199ec29", 0.500, True)
    """默认时长: 0.50s"""
    快照切换_2           = TransitionMeta("快照切换 2", True, "7507202425535630653", "7507202425535630653", "9e78a77059e69ef455b671a5411d88ae", 2.000, True)
    """默认时长: 2.00s"""
    快速三段切           = TransitionMeta("快速三段切", True, "7530479807566515517", "7530479807566515517", "b25d2026c3da196f1f9c368053629dd3", 2.000, True)
    """默认时长: 2.00s"""
    快速切换             = TransitionMeta("快速切换", True, "7504254101081918781", "7504254101081918781", "642131792010c2d07af0a40731e39932", 2.000, True)
    """默认时长: 2.00s"""
    快速挥动             = TransitionMeta("快速挥动", True, "7461924036055027005", "7461924036055027005", "080ec9bac61b01b7e9e516817be09e68", 2.000, True)
    """默认时长: 2.00s"""
    快速缩放             = TransitionMeta("快速缩放", True, "7382514553134780945", "7382514553134780945", "e5243d36be3aa1fbafb4cb7ce9d1db5d", 1.000, True)
    """默认时长: 1.00s"""
    快速震闪             = TransitionMeta("快速震闪", True, "7403600793435116049", "7403600793435116049", "5d1d93e09913898ffd9140351d7a9224", 1.000, True)
    """默认时长: 1.00s"""
    快门滑动             = TransitionMeta("快门滑动", True, "7502705364014599485", "7502705364014599485", "ad2b22a1a8b563542d4ffcfd48c04d0c", 2.000, True)
    """默认时长: 2.00s"""
    快闪模糊             = TransitionMeta("快闪模糊", True, "7488319647759076669", "7488319647759076669", "b7b34f2784097199b6d25b7e07cc1185", 2.000, True)
    """默认时长: 2.00s"""
    怪异轨迹             = TransitionMeta("怪异轨迹", True, "7526988100120087861", "7526988100120087861", "a0550deae1b16fc29576130303cb04a8", 1.830, True)
    """默认时长: 1.83s"""
    怪物干扰             = TransitionMeta("怪物干扰", True, "7488651962548849981", "7488651962548849981", "08fa3e92bb89967bb8e105d576d8945d", 2.000, True)
    """默认时长: 2.00s"""
    惊悚频闪             = TransitionMeta("惊悚频闪", True, "7426273384826147345", "7426273384826147345", "7bad249a916e313a5e2f422291e9d4e9", 1.000, True)
    """默认时长: 1.00s"""
    感知变形             = TransitionMeta("感知变形", True, "7529909830895652157", "7529909830895652157", "a28d64599233c6b55909223ad60e3802", 2.000, True)
    """默认时长: 2.00s"""
    截图                 = TransitionMeta("截图", True, "7519769997170789693", "7519769997170789693", "af46901b50880dcff720c8c82019e9c5", 2.000, True)
    """默认时长: 2.00s"""
    扇形卡片             = TransitionMeta("扇形卡片", True, "7526882939833994549", "7526882939833994549", "a9243492cea5fe3ffa975665c8c84e22", 2.000, True)
    """默认时长: 2.00s"""
    手动点击             = TransitionMeta("手动点击", True, "7519647656428326205", "7519647656428326205", "8311f39ae3433653ba6bf96bda9e0a0e", 2.000, True)
    """默认时长: 2.00s"""
    手势爱心2            = TransitionMeta("手势爱心2", True, "7532080044135468349", "7532080044135468349", "0cf59abc3c3b286514947404495abed8", 2.000, True)
    """默认时长: 2.00s"""
    手机屏放大           = TransitionMeta("手机屏放大", True, "7451535589339304465", "7451535589339304465", "47f7a2d93348de0cc3363f8bed9e27b8", 2.000, True)
    """默认时长: 2.00s"""
    手机相机             = TransitionMeta("手机相机", True, "7530440186765888784", "7530440186765888784", "b5f4290e725f2b3c5e7ffa9f1d676517", 2.000, True)
    """默认时长: 2.00s"""
    手比心               = TransitionMeta("手比心", True, "7532080731946847549", "7532080731946847549", "99519c0305e76006ba821b1a2c7011b2", 2.000, True)
    """默认时长: 2.00s"""
    打孔特效             = TransitionMeta("打孔特效", True, "7480491054760856893", "7480491054760856893", "eb81709b36ef93561be8397093149078", 2.000, True)
    """默认时长: 2.00s"""
    扫光                 = TransitionMeta("扫光 ", True, "7131931631589265921", "7131931631589265921", "333aa7e9d8b24e358ea60784ce47b6fe", 0.500, True)
    """默认时长: 0.50s"""
    扫描捕捉             = TransitionMeta("扫描捕捉", True, "7462548923551321397", "7462548923551321397", "31bfe7b7bb30aadbd6901bf02612d8cf", 1.830, True)
    """默认时长: 1.83s"""
    扭动漩涡旋转         = TransitionMeta("扭动漩涡旋转", True, "7517572329996619069", "7517572329996619069", "9dfeeb4ec2ef90c0f7afe4f735f8cd67", 1.600, True)
    """默认时长: 1.60s"""
    扭曲一闪             = TransitionMeta("扭曲一闪", True, "7496725459804146961", "7496725459804146961", "14764ae36fbfacd33d73ad630ed5d6bc", 1.000, True)
    """默认时长: 1.00s"""
    扭曲像素             = TransitionMeta("扭曲像素", True, "7514119481837227325", "7514119481837227325", "d0962a8a6f6202b12c36337a9759c437", 2.000, True)
    """默认时长: 2.00s"""
    扭曲弹动             = TransitionMeta("扭曲弹动", True, "7405898006198751761", "7405898006198751761", "014956443b20f5c5e87edf79fe2aa5e3", 1.000, True)
    """默认时长: 1.00s"""
    扭曲扫光             = TransitionMeta("扭曲扫光", True, "7320545826294469122", "7320545826294469122", "cf37e1b162d3987e20a317bebc96908c", 1.000, True)
    """默认时长: 1.00s"""
    扭曲摇摆             = TransitionMeta("扭曲摇摆", True, "7506462312409189685", "7506462312409189685", "12485925a7736ec3125455e9d51f6239", 1.000, True)
    """默认时长: 1.00s"""
    扭曲模糊             = TransitionMeta("扭曲模糊", True, "7484146254616792326", "7484146254616792326", "880eb0249af6989a46c0faa184293ce4", 1.000, True)
    """默认时长: 1.00s"""
    扭曲溶解             = TransitionMeta("扭曲溶解", True, "7374776469232292369", "7374776469232292369", "756df14869da51538ed41e2bfac3b779", 1.000, True)
    """默认时长: 1.00s"""
    扭曲滑动             = TransitionMeta("扭曲滑动", True, "7488640939188112693", "7488640939188112693", "a1e712c084f1a3fce940446b35cd89c4", 2.000, True)
    """默认时长: 2.00s"""
    扭转                 = TransitionMeta("扭转", True, "7477473758828040705", "7477473758828040705", "c946f7f4b689603f519bdbac5796d2f0", 0.933, True)
    """默认时长: 0.93s"""
    投影幻灯片           = TransitionMeta("投影幻灯片", True, "7488617515870850365", "7488617515870850365", "4418bee69c472fcf496c8943177cdfb3", 2.000, True)
    """默认时长: 2.00s"""
    投掷切换             = TransitionMeta("投掷切换", True, "7497196657856105789", "7497196657856105789", "83e2c9710ba016d6f46c1315204f3b34", 1.500, True)
    """默认时长: 1.50s"""
    抖动放大             = TransitionMeta("抖动放大", True, "7262258307128103425", "7262258307128103425", "e4cafc076ecab223a39a26fe6f05b6db", 0.800, True)
    """默认时长: 0.80s"""
    抖动缩小             = TransitionMeta("抖动缩小", True, "7290397683808735746", "7290397683808735746", "f496d4f42f7ad9121a9153cb811a3ade", 0.700, True)
    """默认时长: 0.70s"""
    折痕胶带             = TransitionMeta("折痕胶带", True, "7439647271064441361", "7439647271064441361", "949b5a139458534e713b4751f89cc366", 1.000, True)
    """默认时长: 1.00s"""
    抛掷与切换           = TransitionMeta("抛掷与切换", True, "7527559843113225525", "7527559843113225525", "86ef6909f3f9fea5617afd5dea397659", 2.000, True)
    """默认时长: 2.00s"""
    报纸闪屏             = TransitionMeta("报纸闪屏", True, "7496831699871878461", "7496831699871878461", "dc6591153405328f39001bcebd84cbb8", 1.000, True)
    """默认时长: 1.00s"""
    抹布擦拭             = TransitionMeta("抹布擦拭", True, "7489326278521261373", "7489326278521261373", "61bd1455c84cf729fb94363802f335b3", 2.000, True)
    """默认时长: 2.00s"""
    抽帧下移             = TransitionMeta("抽帧下移", True, "7483353657434475782", "7483353657434475782", "b268d9c81de57fd1530d854a50375e89", 2.000, True)
    """默认时长: 2.00s"""
    抽象扭曲             = TransitionMeta("抽象扭曲", True, "7514227054921960765", "7514227054921960765", "076285aaf7774f98ab54162040d871cf", 2.000, True)
    """默认时长: 2.00s"""
    抽象涂抹             = TransitionMeta("抽象涂抹", True, "7533098668744903989", "7533098668744903989", "7d6067d645734d95bd6d450810e2c00c", 2.000, True)
    """默认时长: 2.00s"""
    拆分旋切             = TransitionMeta("拆分旋切", True, "7534572044034329872", "7534572044034329872", "10791e886cfd8aa0eae92576dcc5f6f1", 2.000, True)
    """默认时长: 2.00s"""
    拆解                 = TransitionMeta("拆解", True, "7490956087546498357", "7490956087546498357", "bbe3c4d74c1e8f0632fd1ea08cdbf83f", 1.670, True)
    """默认时长: 1.67s"""
    拉伸包裹             = TransitionMeta("拉伸包裹", True, "7504034877369634101", "7504034877369634101", "b0e9d4300a27e7f84e9b39f12fdff7cf", 2.000, True)
    """默认时长: 2.00s"""
    拉开                 = TransitionMeta("拉开", True, "7384371275499573761", "7384371275499573761", "ce662e83f73f6dd820d26978029e341d", 0.600, True)
    """默认时长: 0.60s"""
    拉框入屏             = TransitionMeta("拉框入屏", True, "7299677351879643649", "7299677351879643649", "bfc8a51d2b304be3dd36a68331f8d0f8", 1.000, True)
    """默认时长: 1.00s"""
    拉远一闪             = TransitionMeta("拉远一闪", True, "7497827305750793473", "7497827305750793473", "47423c52a78f06db20d586b306837159", 1.240, True)
    """默认时长: 1.24s"""
    拉链                 = TransitionMeta("拉链", True, "7282947311867531778", "7282947311867531778", "d6bdfbc3a9572f2419310c1e917590ac", 1.000, True)
    """默认时长: 1.00s"""
    拍立得切换           = TransitionMeta("拍立得切换", True, "7529380721606053137", "7529380721606053137", "f5ccef978905693ed533ddf1dd86f05f", 2.000, True)
    """默认时长: 2.00s"""
    拖动切换             = TransitionMeta("拖动切换", True, "7514921593722719541", "7514921593722719541", "d4fe64bf3d5d953230ce46f924ab9a6b", 2.000, True)
    """默认时长: 2.00s"""
    拖动切换特效         = TransitionMeta("拖动切换特效", True, "7480591537580150069", "7480591537580150069", "c91c7ef96b2aae898b3d263a1afdfe41", 1.330, True)
    """默认时长: 1.33s"""
    拖影光效             = TransitionMeta("拖影光效", True, "7524078231016721680", "7524078231016721680", "72860710b8ae2f6bbd671ae6915d3cdc", 1.670, True)
    """默认时长: 1.67s"""
    拖拽滑动             = TransitionMeta("拖拽滑动", True, "7516419565996330301", "7516419565996330301", "b7062303ff0fdbff8a6c53c184e576cd", 2.000, True)
    """默认时长: 2.00s"""
    拼图剪辑             = TransitionMeta("拼图剪辑", True, "7529601152929860917", "7529601152929860917", "f684743113b161f1bb2522a7ccb3359c", 2.000, True)
    """默认时长: 2.00s"""
    拼图波纹             = TransitionMeta("拼图波纹", True, "7509129297878158645", "7509129297878158645", "7eb32cec4f8d6f2fafc59a7f765e56ee", 2.000, True)
    """默认时长: 2.00s"""
    拼图盒子             = TransitionMeta("拼图盒子", True, "7493835265807502653", "7493835265807502653", "a2d5094606af0d60357d458e637cf3bc", 2.000, True)
    """默认时长: 2.00s"""
    拼图碎片             = TransitionMeta("拼图碎片", True, "7533204890198248757", "7533204890198248757", "2ff26bbad23e6513983011552c6a3d5b", 2.000, True)
    """默认时长: 2.00s"""
    拼贴旋转             = TransitionMeta("拼贴旋转", True, "7524906726877973777", "7524906726877973777", "ac76940bc26f7531902150b9b2056b5f", 2.000, True)
    """默认时长: 2.00s"""
    按压回弹             = TransitionMeta("按压回弹", True, "7533462851084717365", "7533462851084717365", "27994df5c50adcfc4cc7630166dfad4f", 1.470, True)
    """默认时长: 1.47s"""
    换台                 = TransitionMeta("换台", True, "7237422538874163714", "7237422538874163714", "4208f0dc7437ce36d760d1eae344950b", 0.400, True)
    """默认时长: 0.40s"""
    推倒效果             = TransitionMeta("推倒效果", True, "7527992067511815477", "7527992067511815477", "4255dbf868c9fed641f534107ca73c30", 2.000, True)
    """默认时长: 2.00s"""
    推近_II              = TransitionMeta("推近 II", True, "7291211157254181377", "7291211157254181377", "94815943a86e741a5fec1737fbb46d60", 0.900, True)
    """默认时长: 0.90s"""
    揉皱圆圈             = TransitionMeta("揉皱圆圈", True, "7522716631802449213", "7522716631802449213", "01983c4daffdffc9159c2d6595cbef79", 2.000, True)
    """默认时长: 2.00s"""
    描边震动             = TransitionMeta("描边震动", True, "7275226457062773250", "7275226457062773250", "6c252e55ca09c991e2caca8e71af1706", 1.000, True)
    """默认时长: 1.00s"""
    提丰扭曲             = TransitionMeta("提丰扭曲", True, "7516748573027896637", "7516748573027896637", "b7f1a675936eba102187256a184ff529", 2.000, True)
    """默认时长: 2.00s"""
    摇摆左移             = TransitionMeta("摇摆左移", True, "7486717085842754821", "7486717085842754821", "db83f508c464bef4d45a37a858515695", 1.130, True)
    """默认时长: 1.13s"""
    摇摆旋转             = TransitionMeta("摇摆旋转", True, "7479824058771655989", "7479824058771655989", "58d6cb0bf46a0d7de6be9d3e3d6a4578", 2.000, True)
    """默认时长: 2.00s"""
    摇摆晃动             = TransitionMeta("摇摆晃动", True, "7523890271176641845", "7523890271176641845", "309b80b5f1b43688bb52a466640582c7", 2.000, True)
    """默认时长: 2.00s"""
    摇摆缩放             = TransitionMeta("摇摆缩放", True, "7483358649105042749", "7483358649105042749", "46e0fc0536e51700a893744de2b40d06", 1.830, True)
    """默认时长: 1.83s"""
    摇晃拉扯             = TransitionMeta("摇晃拉扯", True, "7493742056335002881", "7493742056335002881", "ccb08938e92afec3486c9dc71000cf52", 1.500, True)
    """默认时长: 1.50s"""
    摇镜                 = TransitionMeta("摇镜", True, "7308582778608554498", "7308582778608554498", "f215c106100f76dcf6c550d0f8217ecb", 0.700, True)
    """默认时长: 0.70s"""
    撕纸出现             = TransitionMeta("撕纸出现", True, "7470416935671304705", "7470416935671304705", "c867458026b6d8c5deedcad096101504", 1.460, True)
    """默认时长: 1.46s"""
    撕纸快拼             = TransitionMeta("撕纸快拼", True, "7502327979834461441", "7502327979834461441", "d066a112e5cb2d92bacdd98b10a14436", 1.200, True)
    """默认时长: 1.20s"""
    撕纸拉屏             = TransitionMeta("撕纸拉屏", True, "7293158558919561730", "7293158558919561730", "c500d2310388b63f3a4e66ff0b15f6dc", 0.700, True)
    """默认时长: 0.70s"""
    撕裂光晕             = TransitionMeta("撕裂光晕", True, "7492669911941025085", "7492669911941025085", "53cad2622f34af55b0e4a9027b35d59a", 2.000, True)
    """默认时长: 2.00s"""
    撕裂图层             = TransitionMeta("撕裂图层", True, "7495691884384308541", "7495691884384308541", "cedd2b7ec31a946b11bce82a62d8e5ea", 1.870, True)
    """默认时长: 1.87s"""
    撕裂翻转             = TransitionMeta("撕裂翻转", True, "7502439516179844413", "7502439516179844413", "7b16f074f880756c42ddd42314e40229", 2.000, True)
    """默认时长: 2.00s"""
    放大上移             = TransitionMeta("放大上移", True, "7488157742956350737", "7488157742956350737", "b9c75e5e406051bcfda6a1048fbb2677", 1.000, True)
    """默认时长: 1.00s"""
    放大镜               = TransitionMeta("放大镜 ", True, "7314276069178085890", "7314276069178085890", "91aee5fc06c85dda958101a677f19c0b", 0.700, True)
    """默认时长: 0.70s"""
    故障弹窗转场         = TransitionMeta("故障弹窗转场", True, "7475286070066696720", "7475286070066696720", "aabf9f9334523152c2a370abbef7f657", 1.420, True)
    """默认时长: 1.42s"""
    故障扩写             = TransitionMeta("故障扩写", True, "7486147847088262461", "7486147847088262461", "a9ce145b2e3b5dfc479dec0c349ee145", 2.000, True)
    """默认时长: 2.00s"""
    故障拉屏             = TransitionMeta("故障拉屏", True, "7280000130772636162", "7280000130772636162", "ca57b5e7702d930a0b7ca394d1aca5e7", 1.200, True)
    """默认时长: 1.20s"""
    数字橡皮擦           = TransitionMeta("数字橡皮擦", True, "7526939341910789437", "7526939341910789437", "6e110d2b786c56d262a7b0c8425c30f7", 2.000, True)
    """默认时长: 2.00s"""
    数字矩阵             = TransitionMeta("数字矩阵", True, "7276059655145525761", "7276059655145525761", "7280830e8841dd6a0de9f39ae048d83c", 1.000, True)
    """默认时长: 1.00s"""
    数字绘画             = TransitionMeta("数字绘画", True, "7472330249439612221", "7472330249439612221", "35406b15767923e787438c38888898da", 2.000, True)
    """默认时长: 2.00s"""
    斜向撕纸             = TransitionMeta("斜向撕纸", True, "7509416272224963901", "7509416272224963901", "436e759408918769a7d206337385d534", 2.000, True)
    """默认时长: 2.00s"""
    斜向模糊             = TransitionMeta("斜向模糊", True, "7140916990713008641", "7140916990713008641", "b14d9650ca6eef79d6b19c16c65166d3", 0.800, True)
    """默认时长: 0.80s"""
    斜向闪光             = TransitionMeta("斜向闪光", True, "7384407588219130369", "7384407588219130369", "eba796256a96c4ff0d1b331a8819c6f2", 0.700, True)
    """默认时长: 0.70s"""
    斜线切换             = TransitionMeta("斜线切换", True, "7476349700124265789", "7476349700124265789", "a5f0c660b7fa18ea2eabf2e8260688fa", 2.000, True)
    """默认时长: 2.00s"""
    断电切换             = TransitionMeta("断电切换", True, "7529853850069601589", "7529853850069601589", "70e188dbf004a800961126f96c688853", 1.140, True)
    """默认时长: 1.14s"""
    方块弹转             = TransitionMeta("方块弹转", True, "7525557375147707664", "7525557375147707664", "fedf4746d38e16a9d573a40d3841e4d0", 0.930, True)
    """默认时长: 0.93s"""
    方块滑动             = TransitionMeta("方块滑动", True, "7530430104959339793", "7530430104959339793", "650f04e1de5158e42c67dc6ace8d4157", 1.670, True)
    """默认时长: 1.67s"""
    方块翻转             = TransitionMeta("方块翻转", True, "7457474737195717137", "7457474737195717137", "418d4795972e2f70533f05304e796c22", 1.100, True)
    """默认时长: 1.10s"""
    方形分割             = TransitionMeta("方形分割", True, "7140917005028168193", "7140917005028168193", "9f29e50ac72b66f4b0320ee1ea9d112f", 0.500, True)
    """默认时长: 0.50s"""
    方形变焦             = TransitionMeta("方形变焦", True, "7400965733477257745", "7400965733477257745", "93317b58455482c7f5213b943a7e01ce", 1.000, True)
    """默认时长: 1.00s"""
    方形模糊             = TransitionMeta("方形模糊", True, "7140916993317671425", "7140916993317671425", "8e3579bda4787d20d8c8ab1b0c68112d", 0.500, True)
    """默认时长: 0.50s"""
    方形模糊_II          = TransitionMeta("方形模糊 II", True, "7384056244421530113", "7384056244421530113", "301fe868bf7b1549d6d07af9405beb4a", 1.000, True)
    """默认时长: 1.00s"""
    方形闪烁             = TransitionMeta("方形闪烁", True, "7531989522779819317", "7531989522779819317", "6338bfad4ed7096595e126c72fb96b90", 2.000, True)
    """默认时长: 2.00s"""
    方框旋转             = TransitionMeta("方框旋转", True, "7532986494001220925", "7532986494001220925", "50354d211d0fef09d97976b6d2a73d63", 1.970, True)
    """默认时长: 1.97s"""
    旋转圆球             = TransitionMeta("旋转圆球", True, "7381417137463628304", "7381417137463628304", "34211e59f420adb42bc00b9a8d36bb6a", 0.800, True)
    """默认时长: 0.80s"""
    旋转圆盘             = TransitionMeta("旋转圆盘", True, "7262931631860617730", "7262931631860617730", "4ae7635e1f70b62825c450bb2954f919", 1.000, True)
    """默认时长: 1.00s"""
    旋转圆盘_ll          = TransitionMeta("旋转圆盘 ll", True, "7265660115364090370", "7265660115364090370", "17d1ac181dd7b623059b8aed82d2ef13", 1.000, True)
    """默认时长: 1.00s"""
    旋转拨盘             = TransitionMeta("旋转拨盘", True, "7368848574861283856", "7368848574861283856", "88ac2494e5cdec7f874c4157555d2d2b", 1.000, True)
    """默认时长: 1.00s"""
    旋转故障             = TransitionMeta("旋转故障", True, "7507454716817853697", "7507454716817853697", "b47d8c9da2e3c09f2d2677f6064f403a", 0.970, True)
    """默认时长: 0.97s"""
    旋转模糊             = TransitionMeta("旋转模糊", True, "7332509233117663745", "7332509233117663745", "20a42c8fe4fccbd4837ae0d03b19cc8b", 1.000, True)
    """默认时长: 1.00s"""
    旋转纵深             = TransitionMeta("旋转纵深", True, "7369533153800622593", "7369533153800622593", "e717dfe6ccb3c6a6c6a6f70987b1a894", 0.900, True)
    """默认时长: 0.90s"""
    旋转跳卡             = TransitionMeta("旋转跳卡", True, "7532331327983488273", "7532331327983488273", "ee213c75427181d38b81e1780ac5de24", 1.400, True)
    """默认时长: 1.40s"""
    旋转转场             = TransitionMeta("旋转转场", True, "7514141163293527313", "7514141163293527313", "2069cda70ea3801ccca4c6bc46172ca6", 1.370, True)
    """默认时长: 1.37s"""
    旋风转               = TransitionMeta("旋风转", True, "7498262262084308277", "7498262262084308277", "f825241f412a93b8e6c9af0903ae2566", 2.000, True)
    """默认时长: 2.00s"""
    无缝扭曲             = TransitionMeta("无缝扭曲", True, "7532522671045610813", "7532522671045610813", "793c6ff8a227bc310148c0f069876f00", 1.970, True)
    """默认时长: 1.97s"""
    无缝撕裂             = TransitionMeta("无缝撕裂", True, "7439647269546103313", "7439647269546103313", "afcefb6980d7212c51229927c39c89e0", 1.500, True)
    """默认时长: 1.50s"""
    日落闪光             = TransitionMeta("日落闪光", True, "7467507679578148157", "7467507679578148157", "da64210f7f1bd2b79c5cb60fdf617239", 1.840, True)
    """默认时长: 1.84s"""
    旧杂志               = TransitionMeta("旧杂志", True, "7482812861195111741", "7482812861195111741", "dac602d705fb4a756617946b8ac9993e", 2.000, True)
    """默认时长: 2.00s"""
    旧胶片_II            = TransitionMeta("旧胶片 II", True, "7131930331501826561", "7131930331501826561", "79901fab61f0b8c2960c73a78e84e5a3", 0.500, True)
    """默认时长: 0.50s"""
    时光穿梭             = TransitionMeta("时光穿梭", True, "7307189728036524545", "7307189728036524545", "74eab27c1dc1a568b851a2e543682058", 1.100, True)
    """默认时长: 1.10s"""
    时针切换             = TransitionMeta("时针切换", True, "7477827925019069757", "7477827925019069757", "20a9bf210477d525057a34ea494967b8", 2.000, True)
    """默认时长: 2.00s"""
    明信片缩放           = TransitionMeta("明信片缩放", True, "7498853918005300533", "7498853918005300533", "cc5dcc6aa4c750652a40006fbb398d28", 1.000, True)
    """默认时长: 1.00s"""
    星光叠化             = TransitionMeta("星光叠化", True, "7314646319933428225", "7314646319933428225", "f6d691dd1f991655b2826964c3883772", 0.800, True)
    """默认时长: 0.80s"""
    星光炸开             = TransitionMeta("星光炸开", True, "7309457690088968705", "7309457690088968705", "b7523d4d583c515035937de1c191c808", 1.300, True)
    """默认时长: 1.30s"""
    星星_II              = TransitionMeta("星星 II", True, "7293780230005592577", "7293780230005592577", "03569614aabe25fb2f6cb6fed8c59a00", 0.500, True)
    """默认时长: 0.50s"""
    星星冲屏             = TransitionMeta("星星冲屏", True, "7497042437244865809", "7497042437244865809", "cf25d9712371f08d7530d0fe2832002b", 1.320, True)
    """默认时长: 1.32s"""
    星星吸入             = TransitionMeta("星星吸入", True, "7307085539499315713", "7307085539499315713", "6ce2a58bc6a3df532a3c1ca890c97394", 1.000, True)
    """默认时长: 1.00s"""
    星级切换             = TransitionMeta("星级切换", True, "7515941028096904509", "7515941028096904509", "c4afea942b3b787332912fc32957bb70", 1.000, True)
    """默认时长: 1.00s"""
    晃动快门             = TransitionMeta("晃动快门", True, "7522413623046638864", "7522413623046638864", "4d2c7691e7e3aedd7770f7f7307cfe83", 1.600, True)
    """默认时长: 1.60s"""
    暗影擦除             = TransitionMeta("暗影擦除", True, "7530516972275125565", "7530516972275125565", "d57bebe5cc22e0d82e8419cedd32dea8", 2.000, True)
    """默认时长: 2.00s"""
    暗影滑动             = TransitionMeta("暗影滑动", True, "7526842552562109757", "7526842552562109757", "aa2c2f7bcb32839d1aa95139887a104f", 2.000, True)
    """默认时长: 2.00s"""
    曝光拉丝             = TransitionMeta("曝光拉丝", True, "7309375693798773249", "7309375693798773249", "56eaaf319007193c199f17554890abb4", 2.000, True)
    """默认时长: 2.00s"""
    曝光拉影             = TransitionMeta("曝光拉影", True, "7522416201629191425", "7522416201629191425", "2c030fc42e24627e7bd7aa18e413781c", 0.480, True)
    """默认时长: 0.48s"""
    曝光摇镜             = TransitionMeta("曝光摇镜", True, "7288260263898255874", "7288260263898255874", "e0ee1d0a29d1138f7a3b673ffbad91d5", 0.700, True)
    """默认时长: 0.70s"""
    望远镜闪烁           = TransitionMeta("望远镜闪烁", True, "7532510711046491453", "7532510711046491453", "f21e573d97caae78105ef74a7cdf5ba3", 2.000, True)
    """默认时长: 2.00s"""
    未压皱               = TransitionMeta("未压皱", True, "7511264705231473981", "7511264705231473981", "09ac79d863041c3ec0a066b90e9e3bdd", 1.000, True)
    """默认时长: 1.00s"""
    未来光谱             = TransitionMeta("未来光谱", True, "7179129265470837249", "7179129265470837249", "7974c984bf60d60079cc03be5928f74d", 0.500, True)
    """默认时长: 0.50s"""
    未来光谱_II          = TransitionMeta("未来光谱 II", True, "7179129531360350721", "7179129531360350721", "524895c4bce265b44ffa8ac92bf0dd6a", 0.500, True)
    """默认时长: 0.50s"""
    未来屏幕             = TransitionMeta("未来屏幕", True, "7494276003557068093", "7494276003557068093", "9fb27f3c5b255d5378e4f7ae89664b52", 1.000, True)
    """默认时长: 1.00s"""
    条形模糊             = TransitionMeta("条形模糊", True, "7140916996262072833", "7140916996262072833", "0a5742430e336b3a1e1b6ff9983c5d25", 1.000, True)
    """默认时长: 1.00s"""
    条码故障             = TransitionMeta("条码故障", True, "7496846170820447549", "7496846170820447549", "c4209dd958f746f8c8cfde6d298adf38", 1.030, True)
    """默认时长: 1.03s"""
    极地光感             = TransitionMeta("极地光感", True, "7516417483251715381", "7516417483251715381", "e44bef5b858092a8bba545df63f4c9ea", 2.000, True)
    """默认时长: 2.00s"""
    极致耀光             = TransitionMeta("极致耀光", True, "7527998370854522173", "7527998370854522173", "5ce62a031917539dca2ae895b92af33e", 2.000, True)
    """默认时长: 2.00s"""
    极速缩放             = TransitionMeta("极速缩放", True, "7485609247800102205", "7485609247800102205", "7d2c3582eeb894ff78e365821916de21", 2.000, True)
    """默认时长: 2.00s"""
    枫叶烟花             = TransitionMeta("枫叶烟花", True, "7532003216083389749", "7532003216083389749", "d5f1885fd4cba96f21f08a5cce7c4d36", 2.000, True)
    """默认时长: 2.00s"""
    柔光呼吸             = TransitionMeta("柔光呼吸", True, "7496722952331758864", "7496722952331758864", "dba36e130c2b39008b60570859acbbfb", 1.500, True)
    """默认时长: 1.50s"""
    柔光斜移             = TransitionMeta("柔光斜移", True, "7495955168006016272", "7495955168006016272", "b348e2d2e425983f140e37816364c937", 1.000, True)
    """默认时长: 1.00s"""
    柔彩云爆             = TransitionMeta("柔彩云爆", True, "7532117821170453821", "7532117821170453821", "c2fa18e41e51c2db5fc1b7ba488edebb", 1.470, True)
    """默认时长: 1.47s"""
    柔彩雏菊             = TransitionMeta("柔彩雏菊", True, "7532388468488408373", "7532388468488408373", "336aff3d3c86028275586abbdabf76c7", 2.000, True)
    """默认时长: 2.00s"""
    标记涂鸦             = TransitionMeta("标记涂鸦", True, "7501760820896976181", "7501760820896976181", "ec3ee3afd8be779f8300dfeac063e6cd", 1.000, True)
    """默认时长: 1.00s"""
    桌面切换             = TransitionMeta("桌面切换", True, "7522988547394063677", "7522988547394063677", "5a6db25483d0b1b4ac841382100e6c36", 2.000, True)
    """默认时长: 2.00s"""
    梦境变形             = TransitionMeta("梦境变形", True, "7511784518949309757", "7511784518949309757", "df1da91228f64ae226e06de9c718c8b5", 1.000, True)
    """默认时长: 1.00s"""
    梦幻转变             = TransitionMeta("梦幻转变", True, "7473046078581984573", "7473046078581984573", "fcd3eddade9c603b7cc49841362009c4", 2.000, True)
    """默认时长: 2.00s"""
    棋盘翻转             = TransitionMeta("棋盘翻转", True, "7529440200905280821", "7529440200905280821", "4762ae54813fe408d393374fa3a56d77", 2.000, True)
    """默认时长: 2.00s"""
    棱镜快拍             = TransitionMeta("棱镜快拍", True, "7480389200873901373", "7480389200873901373", "5d27051542122aa977e365437224d57e", 1.030, True)
    """默认时长: 1.03s"""
    棱镜旋转             = TransitionMeta("棱镜旋转", True, "7522479991553084725", "7522479991553084725", "3e28b90ff45b0fb6cf823f3b6d02d10f", 2.000, True)
    """默认时长: 2.00s"""
    棱镜火花             = TransitionMeta("棱镜火花", True, "7530076666152897845", "7530076666152897845", "34e07f5481f5846d02fbfa30d841ca1b", 2.000, True)
    """默认时长: 2.00s"""
    棱镜环               = TransitionMeta("棱镜环", True, "7523075073394101565", "7523075073394101565", "02694d6f919d70105089ed938db2609f", 2.000, True)
    """默认时长: 2.00s"""
    槽位压缩             = TransitionMeta("槽位压缩", True, "7532363689756740917", "7532363689756740917", "c93407f96307f9ee83d532854488958f", 2.000, True)
    """默认时长: 2.00s"""
    模糊下扯             = TransitionMeta("模糊下扯", True, "7488162268937456897", "7488162268937456897", "1373461f181464d05b42f53ff12ac077", 1.000, True)
    """默认时长: 1.00s"""
    模糊冲刺             = TransitionMeta("模糊冲刺", True, "7529789778410147133", "7529789778410147133", "b2854ae9d9fc4dce52fd4e1d3b07f486", 2.000, True)
    """默认时长: 2.00s"""
    模糊切换             = TransitionMeta("模糊切换", True, "7460777316336012605", "7460777316336012605", "8a5364b64213637619532080944ec126", 2.000, True)
    """默认时长: 2.00s"""
    模糊扩展             = TransitionMeta("模糊扩展", True, "7532010757303651637", "7532010757303651637", "e5d5cd6dbf74981c33bb135a279ec091", 2.000, True)
    """默认时长: 2.00s"""
    模糊放大             = TransitionMeta("模糊放大", True, "7303475529380794881", "7303475529380794881", "7c0ef1a54495f7cd9343efe2acc57b26", 1.000, True)
    """默认时长: 1.00s"""
    模糊旋转             = TransitionMeta("模糊旋转", True, "7532829697491651901", "7532829697491651901", "762707d05f8bc05e78eaa052247054da", 2.000, True)
    """默认时长: 2.00s"""
    模糊横移             = TransitionMeta("模糊横移", True, "7317281163750412801", "7317281163750412801", "aa2ce5c9b13a62881d04f9c23aa30678", 0.800, True)
    """默认时长: 0.80s"""
    模糊滑动             = TransitionMeta("模糊滑动", True, "7496787298000899381", "7496787298000899381", "73ee13d94a9522c655abe8ef9ecabcea", 1.330, True)
    """默认时长: 1.33s"""
    模糊滑动_2           = TransitionMeta("模糊滑动 2", True, "7502407728015379773", "7502407728015379773", "73ee13d94a9522c655abe8ef9ecabcea", 1.330, True)
    """默认时长: 1.33s"""
    模糊滚动             = TransitionMeta("模糊滚动", True, "7524929604147006721", "7524929604147006721", "64a24fa005f4f4c93f10b339d6758075", 2.000, True)
    """默认时长: 2.00s"""
    模糊熄灭             = TransitionMeta("模糊熄灭", True, "7500850273519242549", "7500850273519242549", "7fdcdc84c263ffb84242214b41e34403", 2.000, True)
    """默认时长: 2.00s"""
    模糊缩小             = TransitionMeta("模糊缩小", True, "7298273321471185410", "7298273321471185410", "742e708ac73c3a335a41133684c488ed", 1.200, True)
    """默认时长: 1.20s"""
    模糊震波             = TransitionMeta("模糊震波", True, "7524868159409507585", "7524868159409507585", "a07615810c040027cf58e80d47ecf108", 1.170, True)
    """默认时长: 1.17s"""
    横向微震             = TransitionMeta("横向微震", True, "7403334295193915921", "7403334295193915921", "c3c9b35342f9cc1daa938cb512a71baa", 1.000, True)
    """默认时长: 1.00s"""
    横向拉伸             = TransitionMeta("横向拉伸", True, "7497030693864688912", "7497030693864688912", "c867a13afa6c0176082394fbd774c73f", 1.200, True)
    """默认时长: 1.20s"""
    横向显现             = TransitionMeta("横向显现", True, "7496367341647744317", "7496367341647744317", "ab868c406ed7acb28611af25f67f23a4", 2.000, True)
    """默认时长: 2.00s"""
    横向滑动             = TransitionMeta("横向滑动", True, "7441496905806254609", "7441496905806254609", "9023b03b64ddd87133a3ed36e60d14a1", 1.530, True)
    """默认时长: 1.53s"""
    横条挤压             = TransitionMeta("横条挤压", True, "7371030476548477456", "7371030476548477456", "6bbc30d59ef4fd16e4ba6656129cfd95", 1.200, True)
    """默认时长: 1.20s"""
    樱花翻转             = TransitionMeta("樱花翻转", True, "7475094120252411189", "7475094120252411189", "0cd5cd28707dbccd02e51edd6a23abff", 2.000, True)
    """默认时长: 2.00s"""
    橙色屏幕             = TransitionMeta("橙色屏幕", True, "7511654334036200765", "7511654334036200765", "1d95c61e777b75e4495bff4a4004e60e", 2.000, True)
    """默认时长: 2.00s"""
    橙色闪光             = TransitionMeta("橙色闪光", True, "7476050946133380405", "7476050946133380405", "85d0d2017adf085a0ddf1f58255bd40b", 1.000, True)
    """默认时长: 1.00s"""
    歌曲更改             = TransitionMeta("歌曲更改", True, "7525724308916669749", "7525724308916669749", "55c6ae1f908c7209dfcbb4d1c8407e91", 2.000, True)
    """默认时长: 2.00s"""
    气态绘画             = TransitionMeta("气态绘画", True, "7533872057910594877", "7533872057910594877", "5d9eb960fd7effee1ba1872817f32c42", 2.000, True)
    """默认时长: 2.00s"""
    气泡水滴             = TransitionMeta("气泡水滴", True, "7532037948858961213", "7532037948858961213", "8a90c19ce900f3bf1ec684e4bcc81322", 2.000, True)
    """默认时长: 2.00s"""
    水墨渲染             = TransitionMeta("水墨渲染", True, "7533785546766732597", "7533785546766732597", "1bb63e7055662b735050598e6b5f5b8a", 2.000, True)
    """默认时长: 2.00s"""
    水平旋转             = TransitionMeta("水平旋转", True, "7496847789293374773", "7496847789293374773", "680274b970db6a6e746192a25f12fbbd", 2.000, True)
    """默认时长: 2.00s"""
    水晶簇               = TransitionMeta("水晶簇", True, "7533187978886171965", "7533187978886171965", "434bc196017c33368e8cfeaf33ce0220", 2.000, True)
    """默认时长: 2.00s"""
    水晶葡萄             = TransitionMeta("水晶葡萄", True, "7532388477585902909", "7532388477585902909", "c51d0966723ab0ba798f616bde107d94", 2.000, True)
    """默认时长: 2.00s"""
    水波切换             = TransitionMeta("水波切换", True, "7464655880542260541", "7464655880542260541", "f035e3c17c970d8cb12f79b5a7695419", 1.000, True)
    """默认时长: 1.00s"""
    水滴                 = TransitionMeta("水滴", True, "7220666274618020354", "7220666274618020354", "d5fa6a1daecd2c45b0414626a69e7674", 0.500, True)
    """默认时长: 0.50s"""
    水滴_II              = TransitionMeta("水滴 II", True, "7233667650130285057", "7233667650130285057", "eebf40246476d57ccbf8bbdf15864864", 0.900, True)
    """默认时长: 0.90s"""
    水滴溶解             = TransitionMeta("水滴溶解", True, "7397628078475710977", "7397628078475710977", "ea2d35628f0f6cbc703f7632fbc0588e", 1.000, True)
    """默认时长: 1.00s"""
    水纹变形特效         = TransitionMeta("水纹变形特效", True, "7480568455167577405", "7480568455167577405", "9c911b31be472a940f6ede3bb2fb5835", 2.000, True)
    """默认时长: 2.00s"""
    水面涟漪             = TransitionMeta("水面涟漪", True, "7475286070070874641", "7475286070070874641", "dcf55349bddb306515d0fabe78a6a2ec", 2.000, True)
    """默认时长: 2.00s"""
    汇聚                 = TransitionMeta("汇聚", True, "7316358321215115777", "7316358321215115777", "3bb1668888e7e87764d03b15733370fb", 1.000, True)
    """默认时长: 1.00s"""
    沙漏                 = TransitionMeta("沙漏", True, "7488157950079536385", "7488157950079536385", "a3c38a05652bec89eb692706273675dd", 1.000, True)
    """默认时长: 1.00s"""
    波光粼粼             = TransitionMeta("波光粼粼", True, "7361758943661527569", "7361758943661527569", "da913924bc6975821de103b371d540ff", 1.167, True)
    """默认时长: 1.17s"""
    波动_II              = TransitionMeta("波动 II", True, "7296433991844893186", "7296433991844893186", "337e9e287b6a6cfc73ac09db043811b6", 0.500, True)
    """默认时长: 0.50s"""
    波动故障             = TransitionMeta("波动故障", True, "7223646678018953730", "7223646678018953730", "bd7d819531a9d2b044f823080aa0fc1c", 0.600, True)
    """默认时长: 0.60s"""
    波浪变形特效         = TransitionMeta("波浪变形特效", True, "7480576184372186429", "7480576184372186429", "77067cd8ef0775bdca82b9df94357399", 2.000, True)
    """默认时长: 2.00s"""
    波浪滚动             = TransitionMeta("波浪滚动", True, "7532522344397425981", "7532522344397425981", "c878a3b322f7b026ff797d3e4ed58fa8", 1.300, True)
    """默认时长: 1.30s"""
    波点乱码             = TransitionMeta("波点乱码", True, "7478589595412599313", "7478589595412599313", "1ddfc71829fc328f3d7ebfcd5d2cd40f", 1.000, True)
    """默认时长: 1.00s"""
    波点闪切             = TransitionMeta("波点闪切", True, "7534567014518607120", "7534567014518607120", "b5852daaeb90d7763456481be1383151", 1.530, True)
    """默认时长: 1.53s"""
    波点震动             = TransitionMeta("波点震动", True, "7460417887610606096", "7460417887610606096", "6071fa8c77ff073aa82c04fc95e5ff22", 1.000, True)
    """默认时长: 1.00s"""
    波纹切换             = TransitionMeta("波纹切换", True, "7519136181943127357", "7519136181943127357", "2ee161069079b28266846ddc62f37842", 2.000, True)
    """默认时长: 2.00s"""
    波纹镜头             = TransitionMeta("波纹镜头", True, "7491876037723163965", "7491876037723163965", "cfb1a9cc734dba19c5a42b31f433bf02", 2.000, True)
    """默认时长: 2.00s"""
    洋红故障             = TransitionMeta("洋红故障", True, "7508611678364273973", "7508611678364273973", "c388e3e1fc3e9318404da3e193598462", 2.000, True)
    """默认时长: 2.00s"""
    派对流苏             = TransitionMeta("派对流苏", True, "7501543573242842421", "7501543573242842421", "c00d4e824ecce0dcd156e116eac1010d", 2.000, True)
    """默认时长: 2.00s"""
    流光                 = TransitionMeta("流光", True, "7316827855835369986", "7316827855835369986", "b074c593f0e720a85d19fc831e1eb93b", 1.267, True)
    """默认时长: 1.27s"""
    流光冲击波           = TransitionMeta("流光冲击波", True, "7504621956453420349", "7504621956453420349", "09fb07c9639d7aa7fc98293dfb1f5ee2", 1.000, True)
    """默认时长: 1.00s"""
    浏览画廊             = TransitionMeta("浏览画廊", True, "7516531585106103605", "7516531585106103605", "8d67b0cc72f461c5cb294a65e91b1cdf", 2.000, True)
    """默认时长: 2.00s"""
    浪漫光彩             = TransitionMeta("浪漫光彩", True, "7486026265573592381", "7486026265573592381", "b5eee6d7557e7ed00a94b02d44d04a2e", 2.000, True)
    """默认时长: 2.00s"""
    海浪飞溅             = TransitionMeta("海浪飞溅", True, "7519355106740014397", "7519355106740014397", "7983411917ee589df67d6a95b5210f18", 2.000, True)
    """默认时长: 2.00s"""
    涂鸦分割             = TransitionMeta("涂鸦分割", True, "7475286070075068929", "7475286070075068929", "fa622a2152277fb18cd801118b5d2708", 1.400, True)
    """默认时长: 1.40s"""
    涂鸦切换             = TransitionMeta("涂鸦切换", True, "7480772556329422141", "7480772556329422141", "e100c68351e78a66dcd992f446ed9c54", 2.000, True)
    """默认时长: 2.00s"""
    涂鸦刮擦             = TransitionMeta("涂鸦刮擦", True, "7468667749628218677", "7468667749628218677", "dbb26c05cb644a18f212059f29b725a4", 2.000, True)
    """默认时长: 2.00s"""
    涂鸦星星             = TransitionMeta("涂鸦星星", True, "7507524455019711797", "7507524455019711797", "4ba1fdf02fd3520f6b856080bd98d4a6", 2.000, True)
    """默认时长: 2.00s"""
    涂鸦翻转             = TransitionMeta("涂鸦翻转", True, "7477904968066862389", "7477904968066862389", "dcff78e7a5a07cfe76196bb550628ad1", 1.000, True)
    """默认时长: 1.00s"""
    涂鸦胶片             = TransitionMeta("涂鸦胶片", True, "7481551962337578245", "7481551962337578245", "60a81ad6a9bc7af20d1114d6cf929f21", 2.000, True)
    """默认时长: 2.00s"""
    涂鸦遮黑             = TransitionMeta("涂鸦遮黑", True, "7529479802693160253", "7529479802693160253", "8c15a8692be0d15f255ae13de0c46dca", 2.000, True)
    """默认时长: 2.00s"""
    液体扩散             = TransitionMeta("液体扩散", True, "7509348608458738997", "7509348608458738997", "388ce23a4f80077e535384c231250760", 2.000, True)
    """默认时长: 2.00s"""
    液态故障             = TransitionMeta("液态故障", True, "7529375494307958069", "7529375494307958069", "d584b026e0123c8f291ddc3555b10ddb", 1.030, True)
    """默认时长: 1.03s"""
    淡入淡出闪烁         = TransitionMeta("淡入淡出闪烁", True, "7494093954380549429", "7494093954380549429", "5825e507243eee49ea5a889b5f5067a5", 2.000, True)
    """默认时长: 2.00s"""
    混乱分割             = TransitionMeta("混乱分割", True, "7504685296156527933", "7504685296156527933", "0607c6799ac7946ef527ef633d88dcf4", 2.000, True)
    """默认时长: 2.00s"""
    混乱剪裁             = TransitionMeta("混乱剪裁", True, "7520544665456758077", "7520544665456758077", "d679bb05ca5615af3fa2c631b51f2cb6", 2.000, True)
    """默认时长: 2.00s"""
    混乱旋转             = TransitionMeta("混乱旋转", True, "7519366465762430261", "7519366465762430261", "69feb2d23e597a2bede7804ade92d4ad", 2.000, True)
    """默认时长: 2.00s"""
    混音混乱             = TransitionMeta("混音混乱", True, "7506461472663342389", "7506461472663342389", "64642dbc3d0f5f41df826c0a7ff4ca5b", 1.330, True)
    """默认时长: 1.33s"""
    清洗刷新             = TransitionMeta("清洗刷新", True, "7533089117945580861", "7533089117945580861", "14f05233728437e43094b68ec8c49909", 2.000, True)
    """默认时长: 2.00s"""
    渐变律动             = TransitionMeta("渐变律动", True, "7521649397076118837", "7521649397076118837", "0ff4d3642dd86b6b4cf647092630e597", 2.000, True)
    """默认时长: 2.00s"""
    渐变撕裂             = TransitionMeta("渐变撕裂", True, "7530586033939844405", "7530586033939844405", "72dbaf585cb5eece968f800029378362", 2.000, True)
    """默认时长: 2.00s"""
    渐隐转移             = TransitionMeta("渐隐转移", True, "7497534596158901565", "7497534596158901565", "3ba6378b5c777ff9ac5ea51ccb21d5b2", 1.830, True)
    """默认时长: 1.83s"""
    溶解缩入             = TransitionMeta("溶解缩入", True, "7527499379180162320", "7527499379180162320", "e52396b91cb1a1637684670b8177c4d7", 0.460, True)
    """默认时长: 0.46s"""
    溶解轮廓             = TransitionMeta("溶解轮廓", True, "7481200576164875573", "7481200576164875573", "5c05e5fa1ababf15053ff77875416658", 2.000, True)
    """默认时长: 2.00s"""
    溶解重组             = TransitionMeta("溶解重组", True, "7508863660815617341", "7508863660815617341", "56c1db656c7d9845985d9e6c4d31a001", 2.000, True)
    """默认时长: 2.00s"""
    滑动压迫感           = TransitionMeta("滑动压迫感", True, "7451535587820999184", "7451535587820999184", "dd49d44cfd3e5f5b14e3275876fcc79c", 2.000, True)
    """默认时长: 2.00s"""
    滑动故障             = TransitionMeta("滑动故障", True, "7491731220645039413", "7491731220645039413", "8e105422768ec86b77037c4e9bc19a32", 2.000, True)
    """默认时长: 2.00s"""
    滑动模糊             = TransitionMeta("滑动模糊", True, "7526838498763001149", "7526838498763001149", "1b6c2889f020864fa5ceb066b7180f32", 2.000, True)
    """默认时长: 2.00s"""
    滑动炸裂特效         = TransitionMeta("滑动炸裂特效", True, "7480573628480752957", "7480573628480752957", "e4064c4874440a37e042e1c205acffde", 2.000, True)
    """默认时长: 2.00s"""
    滑动箭头             = TransitionMeta("滑动箭头", True, "7479030783483727165", "7479030783483727165", "b1412a75f632bb8bf7f59358d1f9b6c5", 2.000, True)
    """默认时长: 2.00s"""
    滑动网格             = TransitionMeta("滑动网格", True, "7525037964020239677", "7525037964020239677", "c7292a048dbf730d151ade4d326ba95a", 2.000, True)
    """默认时长: 2.00s"""
    滑动闪烁             = TransitionMeta("滑动闪烁", True, "7483011654595153213", "7483011654595153213", "538f2ced2166d8f9b5299423ab79ab01", 1.970, True)
    """默认时长: 1.97s"""
    滑动队列             = TransitionMeta("滑动队列", True, "7522081796700343613", "7522081796700343613", "f0f539d386db26de2567407f3ea50c1b", 2.000, True)
    """默认时长: 2.00s"""
    滑块拼贴             = TransitionMeta("滑块拼贴", True, "7241419468830675457", "7241419468830675457", "c8552ba32a7e8804013a8a1b977e23c1", 1.500, True)
    """默认时长: 1.50s"""
    滚动立方             = TransitionMeta("滚动立方", True, "7472292799543513601", "7472292799543513601", "376cd96ec36e56b7ea5b921f402fa7f3", 0.733, True)
    """默认时长: 0.73s"""
    漏光涂鸦             = TransitionMeta("漏光涂鸦", True, "7473710407333466625", "7473710407333466625", "6e181632db64337c746467341e85cb96", 2.000, True)
    """默认时长: 2.00s"""
    漏光涂鸦I            = TransitionMeta("漏光涂鸦I", True, "7502330601123433729", "7502330601123433729", "ded2917f78a3bad48387334abeb4ec28", 1.000, True)
    """默认时长: 1.00s"""
    漩涡_II              = TransitionMeta("漩涡 II", True, "7315292211673829889", "7315292211673829889", "aaa37e1978dd5da12e43ce5e80ca71cc", 0.800, True)
    """默认时长: 0.80s"""
    漩涡切换             = TransitionMeta("漩涡切换", True, "7530513414339300661", "7530513414339300661", "04df4e221e5ca9e930179ff8d1e09040", 2.000, True)
    """默认时长: 2.00s"""
    漩涡扭曲             = TransitionMeta("漩涡扭曲", True, "7527672539150028093", "7527672539150028093", "012c4b84211ce9422434f07d056c1610", 2.000, True)
    """默认时长: 2.00s"""
    漫画撕纸             = TransitionMeta("漫画撕纸", True, "7429537941518553617", "7429537941518553617", "dd36bf08f54f9bd8b6d1b03ad6057bc8", 0.800, True)
    """默认时长: 0.80s"""
    漫画面板             = TransitionMeta("漫画面板", True, "7502402763658186037", "7502402763658186037", "8954e64c450e59b125ff96e8a73268a3", 1.670, True)
    """默认时长: 1.67s"""
    激光切割             = TransitionMeta("激光切割", True, "7526825817679138101", "7526825817679138101", "57fdf2634f6a5715668849e29d51bbe4", 2.000, True)
    """默认时长: 2.00s"""
    激光碎片             = TransitionMeta("激光碎片", True, "7515937961087667509", "7515937961087667509", "57f942c9af6f1e05e189669da626d95d", 1.000, True)
    """默认时长: 1.00s"""
    激光迪斯科_2         = TransitionMeta("激光迪斯科 2", True, "7483409900689837373", "7483409900689837373", "902b2976127bf1a57053a5acc59d94f5", 2.000, True)
    """默认时长: 2.00s"""
    火幕                 = TransitionMeta("火幕", True, "7501654543680261437", "7501654543680261437", "fde074e136a4e8b83306f1d968e1384c", 2.000, True)
    """默认时长: 2.00s"""
    火焰                 = TransitionMeta("火焰", True, "7302286890244248066", "7302286890244248066", "03cf0d3864308d9237c2eb091bc05548", 0.800, True)
    """默认时长: 0.80s"""
    火焰泄漏             = TransitionMeta("火焰泄漏", True, "7488602101879262525", "7488602101879262525", "ec996387f2cd6892c104a854f836dc50", 2.000, True)
    """默认时长: 2.00s"""
    火焰爆发             = TransitionMeta("火焰爆发", True, "7510257671308692797", "7510257671308692797", "f6af963f2519e1b8b01eb142cc783746", 2.000, True)
    """默认时长: 2.00s"""
    火焰闪光             = TransitionMeta("火焰闪光", True, "7478343496286440757", "7478343496286440757", "fbba6ade7bad962d42615809e61347a5", 2.000, True)
    """默认时长: 2.00s"""
    火焰飞溅             = TransitionMeta("火焰飞溅", True, "7532473961096023349", "7532473961096023349", "52c739a0b286b7f0236bf62c3bb3a21a", 2.000, True)
    """默认时长: 2.00s"""
    火箭发射             = TransitionMeta("火箭发射", True, "7530880603823050045", "7530880603823050045", "87d6e164e018f636901f4e3b0937c222", 2.000, True)
    """默认时长: 2.00s"""
    灵魂出窍1            = TransitionMeta("灵魂出窍1", True, "7481551991009774853", "7481551991009774853", "bbf8c8aebb5eab327837649d040dbe03", 1.000, True)
    """默认时长: 1.00s"""
    灼片反影             = TransitionMeta("灼片反影", True, "7522553219185265937", "7522553219185265937", "4223dea479213d2baf4a54c368166e20", 0.600, True)
    """默认时长: 0.60s"""
    炫彩定格             = TransitionMeta("炫彩定格", True, "7503560105128987965", "7503560105128987965", "8d8c109c0b3e0b56d504d0014b41bfd0", 2.000, True)
    """默认时长: 2.00s"""
    炫彩渐隐             = TransitionMeta("炫彩渐隐", True, "7533160513291767101", "7533160513291767101", "6f73c6ae11dc9dba423a63d6ad9ebd08", 2.000, True)
    """默认时长: 2.00s"""
    炫彩耀光             = TransitionMeta("炫彩耀光", True, "7530123514611780925", "7530123514611780925", "2969aad2ab88087a57a0aba61fa146c8", 2.000, True)
    """默认时长: 2.00s"""
    点侵蚀               = TransitionMeta("点侵蚀", True, "7499167395005664573", "7499167395005664573", "e6ede4f5ed514b79a7c41b3be789c184", 2.000, True)
    """默认时长: 2.00s"""
    点击圆圈             = TransitionMeta("点击圆圈", True, "7504538050425326909", "7504538050425326909", "5af830b1d96b9844026b80690d3b254b", 2.000, True)
    """默认时长: 2.00s"""
    点击揭示             = TransitionMeta("点击揭示", True, "7499380816351431997", "7499380816351431997", "2f101796001b680b3f0c5b5046de2877", 2.000, True)
    """默认时长: 2.00s"""
    点切换               = TransitionMeta("点切换", True, "7479619485528345909", "7479619485528345909", "3481d31267e24f2537554fafbb7adeba", 2.000, True)
    """默认时长: 2.00s"""
    点阵立方             = TransitionMeta("点阵立方", True, "7532498148472655165", "7532498148472655165", "15ad1a8a4e95e84cdcd53305dcd7a9ce", 2.000, True)
    """默认时长: 2.00s"""
    炽烈变形             = TransitionMeta("炽烈变形", True, "7528377254246747445", "7528377254246747445", "e1fc4e1d8c96a087ca9ae39f659be706", 2.000, True)
    """默认时长: 2.00s"""
    烈焰升腾             = TransitionMeta("烈焰升腾", True, "7489435518934060341", "7489435518934060341", "c65289b7a86fd4cc7ef1b17aae7715d2", 2.000, True)
    """默认时长: 2.00s"""
    烈焰绽放             = TransitionMeta("烈焰绽放", True, "7522387808712019253", "7522387808712019253", "9372fe8eee5b08df32830c1c298aa5c4", 2.000, True)
    """默认时长: 2.00s"""
    烟花光斑             = TransitionMeta("烟花光斑", True, "7450390477875974673", "7450390477875974673", "e7db0e4df4fad1aeb19413ebdb8e940d", 2.000, True)
    """默认时长: 2.00s"""
    烟雾弹               = TransitionMeta("烟雾弹", True, "7369054996886721041", "7369054996886721041", "20450aa8d6ca2adf06e25c688a2645e8", 1.400, True)
    """默认时长: 1.40s"""
    热感瞬移             = TransitionMeta("热感瞬移", True, "7434741902190055953", "7434741902190055953", "1191e60e9137b28fe30a89dac52ad450", 0.800, True)
    """默认时长: 0.80s"""
    热成像               = TransitionMeta("热成像", True, "7135324299086270977", "7135324299086270977", "9ddbaf68f325c10f04ba84f22272cf40", 0.500, True)
    """默认时长: 0.50s"""
    热成像_II            = TransitionMeta("热成像 II", True, "7226980938628993537", "7226980938628993537", "cc7e6688eb34c4ee4f48cb5157e0391c", 0.900, False)
    """默认时长: 0.90s"""
    热成像运镜           = TransitionMeta("热成像运镜", True, "7488537062459575569", "7488537062459575569", "96ba736ede24ba7a5db70b7e82324976", 1.900, True)
    """默认时长: 1.90s"""
    热捕捉               = TransitionMeta("热捕捉", True, "7486995657874476341", "7486995657874476341", "11fc94b4d10e6498b82590d055a946d1", 2.000, True)
    """默认时长: 2.00s"""
    热闪                 = TransitionMeta("热闪", True, "7471459042611744053", "7471459042611744053", "c56a6c618a299556f3cdfc2ff2721fda", 1.330, True)
    """默认时长: 1.33s"""
    焦点缩放             = TransitionMeta("焦点缩放", True, "7478722953044167989", "7478722953044167989", "2ff0d3f215620c6b048fa2b09d253ca1", 2.000, True)
    """默认时长: 2.00s"""
    照片分割             = TransitionMeta("照片分割", True, "7502330503136120081", "7502330503136120081", "953a33a7418caa8909ff9d1bc556c4e1", 2.000, True)
    """默认时长: 2.00s"""
    照片堆叠             = TransitionMeta("照片堆叠", True, "7502843852999445821", "7502843852999445821", "8d752ce82fbfe26a0c65debe80e55440", 1.000, True)
    """默认时长: 1.00s"""
    照片投送             = TransitionMeta("照片投送", True, "7475286070066713104", "7475286070066713104", "a33d9d4691e8e4649993bbf81514ac0a", 1.000, True)
    """默认时长: 1.00s"""
    照片拼贴             = TransitionMeta("照片拼贴", True, "7503489502338403637", "7503489502338403637", "935347e76cada78975938b1c9903f13c", 2.000, True)
    """默认时长: 2.00s"""
    照片拼贴切换         = TransitionMeta("照片拼贴切换", True, "7473108608625036597", "7473108608625036597", "abbd4c45d61c535093f3e8546c8b43ad", 2.000, True)
    """默认时长: 2.00s"""
    照片拼贴旋转         = TransitionMeta("照片拼贴旋转", True, "7517323146001681725", "7517323146001681725", "62fa9df8a03c450b334f383d737e5af6", 2.000, True)
    """默认时长: 2.00s"""
    熔岩故障             = TransitionMeta("熔岩故障", True, "7478280570930515253", "7478280570930515253", "f780b27ee8c139bd92610fae6ce717dc", 2.000, True)
    """默认时长: 2.00s"""
    燃烧线               = TransitionMeta("燃烧线", True, "7522373474925432125", "7522373474925432125", "1975ebf17442f7b6a1f994bdff03f6ba", 2.000, True)
    """默认时长: 2.00s"""
    爆炸门               = TransitionMeta("爆炸门", True, "7529979266990132533", "7529979266990132533", "b06e7bd3164e279069fab5fbc974db16", 2.000, True)
    """默认时长: 2.00s"""
    爆竹快闪             = TransitionMeta("爆竹快闪", True, "7496863085588663613", "7496863085588663613", "0834588b7db1765361fee6669dd21283", 2.000, True)
    """默认时长: 2.00s"""
    爆闪_II              = TransitionMeta("爆闪 II", True, "7260329399516402178", "7260329399516402178", "96e672a98b09ef157224e8b1399ae316", 0.600, True)
    """默认时长: 0.60s"""
    爱心软糖             = TransitionMeta("爱心软糖", True, "7332364751176995330", "7332364751176995330", "ef23b64fbbf32418248446c9f4703589", 1.500, True)
    """默认时长: 1.50s"""
    爱心遮罩             = TransitionMeta("爱心遮罩", True, "7464124620354900497", "7464124620354900497", "9549bfeea10eb2a5b0282ce3727c853c", 2.000, True)
    """默认时长: 2.00s"""
    爱情冲击波           = TransitionMeta("爱情冲击波", True, "7470092656371141941", "7470092656371141941", "7a7f037e7535ae2d52ac9967cc564905", 1.470, True)
    """默认时长: 1.47s"""
    狗仔队               = TransitionMeta("狗仔队", True, "7494179487534337296", "7494179487534337296", "dddf41862ea13691610ac831cd629770", 2.000, True)
    """默认时长: 2.00s"""
    狗仔高光             = TransitionMeta("狗仔高光", True, "7526907641705123133", "7526907641705123133", "af72cd98f330e74c01b1b9cea0fd5112", 2.000, True)
    """默认时长: 2.00s"""
    猫眼缩放             = TransitionMeta("猫眼缩放", True, "7501226800329084221", "7501226800329084221", "7515736f64eac30506ea1629cba43f70", 2.000, True)
    """默认时长: 2.00s"""
    玫瑰闪光             = TransitionMeta("玫瑰闪光", True, "7476123409777315133", "7476123409777315133", "396b4bb7f32929825a7460e779c6e027", 2.000, True)
    """默认时长: 2.00s"""
    环回推近             = TransitionMeta("环回推近", True, "7449336423188009489", "7449336423188009489", "3ad22aeec6b193f1d3718330bafdb4ac", 1.533, True)
    """默认时长: 1.53s"""
    环形传送             = TransitionMeta("环形传送", True, "7516839435032448309", "7516839435032448309", "6aa5cf88d92edcf0e336c52f128d1a30", 2.000, True)
    """默认时长: 2.00s"""
    环形抽卡             = TransitionMeta("环形抽卡", True, "7492967783630785809", "7492967783630785809", "89ce6d1c8b94c2c2a0d81cf0c088d652", 2.000, True)
    """默认时长: 2.00s"""
    玻璃块缩放_2         = TransitionMeta("玻璃块缩放 2", True, "7475543377753247037", "7475543377753247037", "f0e57afdcc397335d7008b86c37a3d40", 2.000, True)
    """默认时长: 2.00s"""
    玻璃块缩放_3         = TransitionMeta("玻璃块缩放 3", True, "7498955462528748861", "7498955462528748861", "fac965a75f21d58ea86b27601287994f", 1.330, True)
    """默认时长: 1.33s"""
    玻璃折射             = TransitionMeta("玻璃折射", True, "7529855330600144181", "7529855330600144181", "eb36d1971f4d5cc2f8d3f0025694627c", 1.010, True)
    """默认时长: 1.01s"""
    玻璃破碎             = TransitionMeta("玻璃破碎", True, "7489313753410866493", "7489313753410866493", "c3bff951d687c110e1aa8bae3be4e13a", 2.000, True)
    """默认时长: 2.00s"""
    玻璃破碎_II          = TransitionMeta("玻璃破碎 II", True, "7249986951216894466", "7249986951216894466", "f77fe839adb1ca6cddc086834a514b79", 1.000, True)
    """默认时长: 1.00s"""
    玻璃移动             = TransitionMeta("玻璃移动", True, "7501986775225650485", "7501986775225650485", "6f52851f7b362f9dc0819321c053ec15", 1.000, True)
    """默认时长: 1.00s"""
    球体升起             = TransitionMeta("球体升起", True, "7533086448489221429", "7533086448489221429", "22595257d670267cbc60f4c43a197b88", 1.210, True)
    """默认时长: 1.21s"""
    瓶堆                 = TransitionMeta("瓶堆", True, "7505461923274640701", "7505461923274640701", "56684e8f2d75c717d850bc72e9192bf2", 2.000, True)
    """默认时长: 2.00s"""
    瓷砖合并             = TransitionMeta("瓷砖合并", True, "7519070207730535741", "7519070207730535741", "7adb3a7463efde14068953c19f9c6407", 2.000, True)
    """默认时长: 2.00s"""
    瓷砖展开             = TransitionMeta("瓷砖展开", True, "7532463398894734653", "7532463398894734653", "f795505fc788fe30154dd61efc9f3a51", 2.000, True)
    """默认时长: 2.00s"""
    甜甜圈裁剪           = TransitionMeta("甜甜圈裁剪", True, "7480060481449774389", "7480060481449774389", "c57c4e9349304d74eaf6d8f5dc91174c", 2.000, True)
    """默认时长: 2.00s"""
    生物危害视觉         = TransitionMeta("生物危害视觉", True, "7530924602185370941", "7530924602185370941", "ab6f971a8a8b0866689b2e2a9f366bf7", 2.000, True)
    """默认时长: 2.00s"""
    甩鞭转场             = TransitionMeta("甩鞭转场", True, "7486759573072956733", "7486759573072956733", "f0bdc5350abdbf613e15148b714d9faa", 2.000, True)
    """默认时长: 2.00s"""
    电光                 = TransitionMeta("电光", True, "7187963124719292929", "7187963124719292929", "6142261f8bd0361a56d15a3d408c20ab", 0.500, True)
    """默认时长: 0.50s"""
    电光_II              = TransitionMeta("电光 II", True, "7296385613161304578", "7296385613161304578", "e8a9edb89dae57afad5dfd6b707a6b57", 1.300, True)
    """默认时长: 1.30s"""
    电光涂鸦             = TransitionMeta("电光涂鸦", True, "7532813041432366397", "7532813041432366397", "8e4bebd062f461cfaccea4452f3042d1", 2.000, True)
    """默认时长: 2.00s"""
    电子叠影             = TransitionMeta("电子叠影", True, "7494179487534288144", "7494179487534288144", "d6df329f42b10a56ef94720c3bf4f6f1", 1.000, True)
    """默认时长: 1.00s"""
    电子波浪             = TransitionMeta("电子波浪", True, "7498203525801889025", "7498203525801889025", "08e908c1297374e0f2f46eb030cb5a2b", 2.000, True)
    """默认时长: 2.00s"""
    电影剪辑             = TransitionMeta("电影剪辑", True, "7477939395589393725", "7477939395589393725", "b3588f681df19157211ab50e0f741e71", 2.000, True)
    """默认时长: 2.00s"""
    电流                 = TransitionMeta("电流", True, "7406178415608336897", "7406178415608336897", "435f3111d5b73043c9da4fb52bc1c5aa", 1.167, True)
    """默认时长: 1.17s"""
    电脑故障             = TransitionMeta("电脑故障", True, "7465994510410059061", "7465994510410059061", "270d2e733ef8ca3d3048f3898ed4759a", 2.000, True)
    """默认时长: 2.00s"""
    电视故障             = TransitionMeta("电视故障", True, "7473770029234916669", "7473770029234916669", "cd7942531f5763aaa75a89930c516e8a", 1.000, True)
    """默认时长: 1.00s"""
    电视替换             = TransitionMeta("电视替换", True, "7460774612498992437", "7460774612498992437", "b6831b64a5716b658e0360967b797e40", 2.000, True)
    """默认时长: 2.00s"""
    电视穿越             = TransitionMeta("电视穿越", True, "7475286070075085313", "7475286070075085313", "d0cc5c56cfd7d2f9018ccd641bcde269", 2.500, True)
    """默认时长: 2.50s"""
    画中画变形           = TransitionMeta("画中画变形", True, "7494178825870396688", "7494178825870396688", "c2b6ed5b81db75ae30b60cf010df57e4", 2.000, True)
    """默认时长: 2.00s"""
    画笔笔触环           = TransitionMeta("画笔笔触环", True, "7480394594404814133", "7480394594404814133", "b4cd81fd1d0aca2ce9a4aeeb4691c83a", 1.670, True)
    """默认时长: 1.67s"""
    画笔重叠             = TransitionMeta("画笔重叠", True, "7487157140042386741", "7487157140042386741", "321fc8bbf8962fb0f571bb3dd5fc0f03", 1.000, True)
    """默认时长: 1.00s"""
    界面切换             = TransitionMeta("界面切换", True, "7487868908221795601", "7487868908221795601", "156dd365f750b24ff356046e43f212eb", 2.000, True)
    """默认时长: 2.00s"""
    白化像素             = TransitionMeta("白化像素", True, "7467868466817682749", "7467868466817682749", "c2fbb7bf0853a584b75c921cac115ee7", 2.000, True)
    """默认时长: 2.00s"""
    白色涂鸦             = TransitionMeta("白色涂鸦", True, "7514140433497328897", "7514140433497328897", "b651df5c2ea52c2f5aadb8b8c9f5121d", 1.000, True)
    """默认时长: 1.00s"""
    白色盒子             = TransitionMeta("白色盒子", True, "7523859464189906237", "7523859464189906237", "bfe7d46dac6a9a0ef6eb573fd2ef9dff", 1.830, True)
    """默认时长: 1.83s"""
    白闪下扯             = TransitionMeta("白闪下扯", True, "7529381356833344785", "7529381356833344785", "a0476c0ba4755c34f5c96f4d74a29056", 1.330, True)
    """默认时长: 1.33s"""
    百叶窗_II            = TransitionMeta("百叶窗 II", True, "7390264369554133521", "7390264369554133521", "f2bb5fed6d6e4914d220dfc7bd720b65", 0.800, True)
    """默认时长: 0.80s"""
    百叶翻折             = TransitionMeta("百叶翻折", True, "7529391160272375041", "7529391160272375041", "a648f960824bbda77acb0278e393ff8c", 2.000, True)
    """默认时长: 2.00s"""
    目标缩放             = TransitionMeta("目标缩放", True, "7473132945243508029", "7473132945243508029", "76482fe7a7c26ddc774750235f0a3ffe", 2.000, True)
    """默认时长: 2.00s"""
    目的地更改           = TransitionMeta("目的地更改", True, "7530542572255661373", "7530542572255661373", "ee0b9dc50ef51ac511c55f7786b6ccf8", 2.000, True)
    """默认时长: 2.00s"""
    相册翻转             = TransitionMeta("相册翻转", True, "7521660875598499133", "7521660875598499133", "49dc951e6eb695e4099987377a6f558a", 2.000, True)
    """默认时长: 2.00s"""
    相机剪影             = TransitionMeta("相机剪影", True, "7508819148424678717", "7508819148424678717", "bc30066adde95e4bea84fbbe189cc161", 2.000, True)
    """默认时长: 2.00s"""
    相机快门             = TransitionMeta("相机快门", True, "7514616723148901693", "7514616723148901693", "6aa234f36b6bb7e1e8789cdd086a862c", 1.670, True)
    """默认时长: 1.67s"""
    相机网格             = TransitionMeta("相机网格", True, "7482875592644365629", "7482875592644365629", "58c90836f3ee5340eef7f6ca43379278", 2.000, True)
    """默认时长: 2.00s"""
    相片切换             = TransitionMeta("相片切换", True, "7327641085444887042", "7327641085444887042", "0bcab7309cd00dc17a95071b62282d0a", 0.700, True)
    """默认时长: 0.70s"""
    眩晕切换             = TransitionMeta("眩晕切换", True, "7490911351397764405", "7490911351397764405", "4e4ba2572213b79b2311afa35ac12892", 2.000, True)
    """默认时长: 2.00s"""
    眼中倒影             = TransitionMeta("眼中倒影", True, "7501266205374680373", "7501266205374680373", "098733cd58223ee93e260cdc1aad53aa", 2.000, True)
    """默认时长: 2.00s"""
    瞬移切换             = TransitionMeta("瞬移切换", True, "7524326474464234813", "7524326474464234813", "5779d134c58a6cbc44b7e5828eae51f4", 2.000, True)
    """默认时长: 2.00s"""
    瞬间移动             = TransitionMeta("瞬间移动", True, "7488094700159782145", "7488094700159782145", "8f3ae25af421f026ede897c2e469449c", 2.000, True)
    """默认时长: 2.00s"""
    短路                 = TransitionMeta("短路", True, "7517183734534163765", "7517183734534163765", "a24b5ccd22034db91caf9b28a13697a8", 1.500, True)
    """默认时长: 1.50s"""
    破碎切换             = TransitionMeta("破碎切换", True, "7484058288930311477", "7484058288930311477", "80752c3c7bdd1646d3e3875905fcf388", 2.000, True)
    """默认时长: 2.00s"""
    碎片故障             = TransitionMeta("碎片故障", True, "7499016318557965629", "7499016318557965629", "14d7dc0dec7a7bd1310ffe6d23fd5869", 2.000, True)
    """默认时长: 2.00s"""
    碎片淡出             = TransitionMeta("碎片淡出", True, "7532763120234810685", "7532763120234810685", "d52c8382399c5f65ce398b2cec5ba03f", 2.000, True)
    """默认时长: 2.00s"""
    碎纸                 = TransitionMeta("碎纸", True, "7480798019957329157", "7480798019957329157", "9fdf19409e962c0870628e1c63ae8637", 2.000, True)
    """默认时长: 2.00s"""
    碎裂滑动             = TransitionMeta("碎裂滑动", True, "7512374482007248181", "7512374482007248181", "25278c520d5267eb6f9e00cd9adb05da", 2.000, True)
    """默认时长: 2.00s"""
    碎裂玻璃             = TransitionMeta("碎裂玻璃", True, "7504182795317677373", "7504182795317677373", "bc953d43922d95e08e50242f460a2313", 1.500, True)
    """默认时长: 1.50s"""
    社媒旋转             = TransitionMeta("社媒旋转", True, "7496753901786500369", "7496753901786500369", "8da1af8048cfecefe1bd3003eb586eb6", 1.500, True)
    """默认时长: 1.50s"""
    神圣闪现             = TransitionMeta("神圣闪现", True, "7503180005757832509", "7503180005757832509", "31d04ebda0e3d037cb54bd4f2f7af42a", 1.970, True)
    """默认时长: 1.97s"""
    空间上移             = TransitionMeta("空间上移", True, "7405991691762536977", "7405991691762536977", "7043746b8dd5592ffa7e5e8baec3e504", 0.500, True)
    """默认时长: 0.50s"""
    空间切分             = TransitionMeta("空间切分", True, "7524929604146990337", "7524929604146990337", "97017271def6dc9c9fae1255c91176dc", 2.000, True)
    """默认时长: 2.00s"""
    空间弹动             = TransitionMeta("空间弹动", True, "7270732725017907713", "7270732725017907713", "e86c774726c177ee17fd90f63750cf78", 1.000, False)
    """默认时长: 1.00s"""
    空间弹动_II          = TransitionMeta("空间弹动 II", True, "7270732825567957506", "7270732825567957506", "adf0c9abb5c1399909318bb603f28ad1", 1.000, False)
    """默认时长: 1.00s"""
    空间弹动_III         = TransitionMeta("空间弹动 III", True, "7270732955855622658", "7270732955855622658", "d8c4ad960be7cfbe8093fa26076ce000", 1.000, False)
    """默认时长: 1.00s"""
    空间弹动_IV          = TransitionMeta("空间弹动 IV", True, "7270732893532459522", "7270732893532459522", "fb42b8f0a30fe4a0c81c292460aabdbd", 1.000, False)
    """默认时长: 1.00s"""
    空间拖拽             = TransitionMeta("空间拖拽", True, "7501184959064050960", "7501184959064050960", "eca76ba3dc4c1542141259f6ff9855b7", 2.000, True)
    """默认时长: 2.00s"""
    空间旋转             = TransitionMeta("空间旋转", True, "7140917017556554242", "7140917017556554242", "07c37c8bcf40b83415aa6f223de2cd8a", 0.500, True)
    """默认时长: 0.50s"""
    空间旋转_II          = TransitionMeta("空间旋转 II", True, "7140917012213010945", "7140917012213010945", "43927ed137278ab2c3cf8a4933cb4169", 0.500, True)
    """默认时长: 0.50s"""
    空间旋转_III         = TransitionMeta("空间旋转 III", True, "7140917012460474881", "7140917012460474881", "7baa76e42959ee273c278389d359fc59", 0.500, True)
    """默认时长: 0.50s"""
    空间翻转_I           = TransitionMeta("空间翻转 I", True, "7224385351765201409", "7224385351765201409", "bf503312aa60ad676c20a60eab99f465", 1.200, True)
    """默认时长: 1.20s"""
    空间翻转_II          = TransitionMeta("空间翻转 II", True, "7224385518614614530", "7224385518614614530", "ee9309f01cc53522243198c4ba69ab96", 1.200, True)
    """默认时长: 1.20s"""
    空间跳跃             = TransitionMeta("空间跳跃", True, "7315287039908254209", "7315287039908254209", "63ed07f2b570de64cc83710c1543a644", 0.633, True)
    """默认时长: 0.63s"""
    空间速推             = TransitionMeta("空间速推", True, "7521492499605540113", "7521492499605540113", "2959e54f2854abffbc052d3fbb30d9bf", 1.670, True)
    """默认时长: 1.67s"""
    穿越                 = TransitionMeta("穿越", True, "7153600507632685570", "7153600507632685570", "80fb974789637e8175557c7c3e649c0e", 0.500, True)
    """默认时长: 0.50s"""
    穿越_II              = TransitionMeta("穿越 II", True, "7153601246669050369", "7153601246669050369", "aa3181f829fe16f72540cc0ec7dfb171", 0.500, True)
    """默认时长: 0.50s"""
    突然跳跃             = TransitionMeta("突然跳跃", True, "7528725971428576565", "7528725971428576565", "b36cb63cea61765d35999f0f680a6b41", 2.000, True)
    """默认时长: 2.00s"""
    窗口拼图             = TransitionMeta("窗口拼图", True, "7507967433345436989", "7507967433345436989", "3a955322ff64f23356036ea46312c962", 2.000, True)
    """默认时长: 2.00s"""
    窗口滑动             = TransitionMeta("窗口滑动", True, "7491593541378919741", "7491593541378919741", "742fe6369d5da2ec44eaef82a968930c", 2.000, True)
    """默认时长: 2.00s"""
    窗户擦拭器           = TransitionMeta("窗户擦拭器", True, "7517353962236824885", "7517353962236824885", "d8e9d184ca27bd6b55813ab7de20fc06", 2.000, True)
    """默认时长: 2.00s"""
    立体双向             = TransitionMeta("立体双向", True, "7519781499365788929", "7519781499365788929", "53d379fe6aea61ead5f61978454ae6d8", 1.130, True)
    """默认时长: 1.13s"""
    立体层次             = TransitionMeta("立体层次", True, "7509676193139002625", "7509676193139002625", "e9e03dfb519a7a96891f77aeb5492c92", 2.000, True)
    """默认时长: 2.00s"""
    立体层次II           = TransitionMeta("立体层次II", True, "7525522401363381520", "7525522401363381520", "6e471b12b12e72660ccb78a6567c2a1c", 2.000, True)
    """默认时长: 2.00s"""
    立体旋转             = TransitionMeta("立体旋转", True, "7532789997167037757", "7532789997167037757", "8038cf6a11c1ebf50351151b13f29aa0", 2.000, True)
    """默认时长: 2.00s"""
    立体翻页             = TransitionMeta("立体翻页", True, "7156927671560049153", "7156927671560049153", "ac010354774404d6b8e092120ab76772", 0.500, True)
    """默认时长: 0.50s"""
    立体翻页_II          = TransitionMeta("立体翻页 II", True, "7156927910291444225", "7156927910291444225", "a033fe7038252ba812a4377ff3326acf", 0.500, True)
    """默认时长: 0.50s"""
    立体雪花             = TransitionMeta("立体雪花", True, "7460417887614800385", "7460417887614800385", "41e3531e65c2e20167f04f683b697ecb", 1.500, True)
    """默认时长: 1.50s"""
    立方体旋转_2         = TransitionMeta("立方体旋转 2", True, "7475369896805731645", "7475369896805731645", "77eca5e250af5c41a816dacf66973257", 2.000, True)
    """默认时长: 2.00s"""
    立方体脸部           = TransitionMeta("立方体脸部", True, "7490571483882786109", "7490571483882786109", "17e5f81f9f8014dc41eb390f2f185029", 2.000, True)
    """默认时长: 2.00s"""
    立方体集群           = TransitionMeta("立方体集群", True, "7530875917325978933", "7530875917325978933", "4f3c0587d8aec8db191f7db95700e6d6", 2.000, True)
    """默认时长: 2.00s"""
    立方旋转             = TransitionMeta("立方旋转", True, "7495955168006130960", "7495955168006130960", "bd1c333d5dd5023902f91a9b98293c88", 2.000, True)
    """默认时长: 2.00s"""
    立方脸部             = TransitionMeta("立方脸部", True, "7532395886731726133", "7532395886731726133", "a2db2c1a7549615dfc697abdda7d8818", 2.000, True)
    """默认时长: 2.00s"""
    立方重组             = TransitionMeta("立方重组", True, "7481543292295875845", "7481543292295875845", "d1797f2a98af2f1f7fe1de84eff155d9", 1.670, True)
    """默认时长: 1.67s"""
    竖线拉伸             = TransitionMeta("竖线拉伸", True, "7384055737749606929", "7384055737749606929", "1c711d1f9f91c08d324e071d5b70273e", 1.000, True)
    """默认时长: 1.00s"""
    简单模糊             = TransitionMeta("简单模糊", True, "7524932829382200637", "7524932829382200637", "b8b80fa598dc183cbe667ff85209643f", 2.000, True)
    """默认时长: 2.00s"""
    简单的鞭打           = TransitionMeta("简单的鞭打", True, "7530102679947726133", "7530102679947726133", "cf989dcd21e63a51a5012821f1688912", 1.970, True)
    """默认时长: 1.97s"""
    简单翻页             = TransitionMeta("简单翻页", True, "7530469760765545729", "7530469760765545729", "44e0d3deaff4e898edb90e357f0600b5", 1.000, True)
    """默认时长: 1.00s"""
    简单闪回             = TransitionMeta("简单闪回", True, "7530510276920151349", "7530510276920151349", "229d180ae939f8559a973e17b72915fe", 2.000, True)
    """默认时长: 2.00s"""
    箭头向上             = TransitionMeta("箭头向上", True, "7478336076973739317", "7478336076973739317", "790f8477ec27bcf9df943cf0c03e65a9", 2.000, True)
    """默认时长: 2.00s"""
    粉红爆炸             = TransitionMeta("粉红爆炸", True, "7519476295932169533", "7519476295932169533", "6f7c6e181fc101d759d14eb3e2457d77", 2.000, True)
    """默认时长: 2.00s"""
    粉色迷幻             = TransitionMeta("粉色迷幻", True, "7476362104732142909", "7476362104732142909", "c3c314085f9828275f09644f5c446a4d", 1.000, True)
    """默认时长: 1.00s"""
    粒子传送门           = TransitionMeta("粒子传送门", True, "7480386757264035077", "7480386757264035077", "b43c8942b17a192d11926c6a8323dc95", 1.030, True)
    """默认时长: 1.03s"""
    粗糙涂鸦             = TransitionMeta("粗糙涂鸦", True, "7501632655067237685", "7501632655067237685", "e73a517f46009ee593f5fb26c88c1ee3", 1.470, True)
    """默认时长: 1.47s"""
    紫红闪光             = TransitionMeta("紫红闪光", True, "7511289323417832765", "7511289323417832765", "69f3d181cc702c226461c0042807849d", 2.000, True)
    """默认时长: 2.00s"""
    紫色摩擦             = TransitionMeta("紫色摩擦", True, "7501736161992363325", "7501736161992363325", "ed46fe10e6dc658e62a6c22a07789d15", 1.000, True)
    """默认时长: 1.00s"""
    红光                 = TransitionMeta("红光", True, "7485281982293773573", "7485281982293773573", "e6b5cc460be2274831cca97683518276", 2.000, True)
    """默认时长: 2.00s"""
    红光扫描             = TransitionMeta("红光扫描", True, "7494179518366682369", "7494179518366682369", "08c1045ddf53c31f673df6482bbbad10", 1.000, True)
    """默认时长: 1.00s"""
    红外闪光             = TransitionMeta("红外闪光", True, "7507533701262200125", "7507533701262200125", "dca80f41c9d4630644dd18cb8390289a", 2.000, True)
    """默认时长: 2.00s"""
    红白闪切             = TransitionMeta("红白闪切", True, "7494174523856637185", "7494174523856637185", "0116181a4e15bf4b63b84a7c3c75474f", 2.000, True)
    """默认时长: 2.00s"""
    红胶片               = TransitionMeta("红胶片", True, "7501621038665452853", "7501621038665452853", "c34fc28f9f466bf54a56e4d586d0c0e2", 1.270, True)
    """默认时长: 1.27s"""
    红色滑动             = TransitionMeta("红色滑动", True, "7472440027163659573", "7472440027163659573", "5ce81b7fc18f3417b25dc9d878b8590b", 1.000, True)
    """默认时长: 1.00s"""
    红色闪电             = TransitionMeta("红色闪电", True, "7530444522224946493", "7530444522224946493", "bc59a048d3f802d6052994fdff58f3c9", 2.000, True)
    """默认时长: 2.00s"""
    纵向滑动             = TransitionMeta("纵向滑动", True, "7434830442294940176", "7434830442294940176", "9359f18a23d5ebfafc54489696912f2b", 1.330, True)
    """默认时长: 1.33s"""
    纸团                 = TransitionMeta("纸团", True, "7249296835204878850", "7249296835204878850", "283ecb29f26d13d371658f0b8b476776", 0.700, True)
    """默认时长: 0.70s"""
    纸张侵蚀             = TransitionMeta("纸张侵蚀", True, "7494301651147181365", "7494301651147181365", "24441d053bc8b0a41d4c0135578a38e7", 1.030, True)
    """默认时长: 1.03s"""
    纸张撕裂特效         = TransitionMeta("纸张撕裂特效", True, "7480823803426180405", "7480823803426180405", "50e10cd61080db0cabc2b7c4adab14df", 2.000, True)
    """默认时长: 2.00s"""
    纸张旋转             = TransitionMeta("纸张旋转", True, "7527969637217226037", "7527969637217226037", "56c8fea57ab689d9a44bdf4c2bfb970a", 2.000, True)
    """默认时长: 2.00s"""
    纸张飞落             = TransitionMeta("纸张飞落", True, "7483777646350863622", "7483777646350863622", "6c6b3cdd05b5f5fc9faa26cb25739d9f", 3.000, True)
    """默认时长: 3.00s"""
    纸撕裂               = TransitionMeta("纸撕裂", True, "7479446296781131069", "7479446296781131069", "80106598863b19f33187062fcd1cae8f", 2.000, True)
    """默认时长: 2.00s"""
    纸质快转             = TransitionMeta("纸质快转", True, "7496725459804130577", "7496725459804130577", "9a6804e7b75f856935f71537d76ce647", 1.000, True)
    """默认时长: 1.00s"""
    线性加深             = TransitionMeta("线性加深", True, "7508373543030099253", "7508373543030099253", "d63121f3e1a8ce7c9b64a3599263e120", 1.880, True)
    """默认时长: 1.88s"""
    线描转换             = TransitionMeta("线描转换", True, "7529379707423427857", "7529379707423427857", "38816ea93352f1c74b134020f29afcf5", 1.600, True)
    """默认时长: 1.60s"""
    绘画画廊             = TransitionMeta("绘画画廊", True, "7486947189051116853", "7486947189051116853", "7dc599c439eface7eb3e0106b30a3602", 2.000, True)
    """默认时长: 2.00s"""
    绽放剪切             = TransitionMeta("绽放剪切", True, "7532815007394909493", "7532815007394909493", "cdbbfa1fc9327a5ca4865aef3e5a267f", 2.000, True)
    """默认时长: 2.00s"""
    绿光波纹             = TransitionMeta("绿光波纹", True, "7497042437244849425", "7497042437244849425", "a3f2bb7a332195c7eea35004da509403", 1.440, True)
    """默认时长: 1.44s"""
    绿色危机             = TransitionMeta("绿色危机", True, "7530595714104184117", "7530595714104184117", "ed81987bb2853ab8572ec60af2693c32", 2.000, True)
    """默认时长: 2.00s"""
    编织解构             = TransitionMeta("编织解构", True, "7525472025335352629", "7525472025335352629", "a9c64b9ea4beab68c70b439dc034217d", 2.000, True)
    """默认时长: 2.00s"""
    缩小滑动             = TransitionMeta("缩小滑动", True, "7529810187897589045", "7529810187897589045", "1371971fb021899e317f7d3e789bacab", 2.000, True)
    """默认时长: 2.00s"""
    缩放切换             = TransitionMeta("缩放切换", True, "7464433696658001213", "7464433696658001213", "9cbc9874d2253f26b9890a10ecc22cc1", 2.000, True)
    """默认时长: 2.00s"""
    缩放旋转             = TransitionMeta("缩放旋转", True, "7502070589943729461", "7502070589943729461", "cb7b996313b3759b33af13d4a37486c1", 2.000, True)
    """默认时长: 2.00s"""
    缩放燃烧             = TransitionMeta("缩放燃烧", True, "7497676149984628029", "7497676149984628029", "614cb8a6ecab26d7168fdb3586c2ca53", 2.000, True)
    """默认时长: 2.00s"""
    缩放翻转             = TransitionMeta("缩放翻转", True, "7499084090306563381", "7499084090306563381", "570f879eb60e783ae2c2bbd84fa3874d", 2.000, True)
    """默认时长: 2.00s"""
    缩放轮播             = TransitionMeta("缩放轮播", True, "7502402658632879413", "7502402658632879413", "dd57fafd9e5314ef09d911e03f34d5a8", 2.000, True)
    """默认时长: 2.00s"""
    缩放闪光             = TransitionMeta("缩放闪光", True, "7494201303480929597", "7494201303480929597", "321756cb7648a089541558f7b4837e2c", 2.000, True)
    """默认时长: 2.00s"""
    网屏缩小             = TransitionMeta("网屏缩小", True, "7523589126025694517", "7523589126025694517", "150abe2b5ab23a0382717840619f5d1d", 2.000, True)
    """默认时长: 2.00s"""
    网格打乱             = TransitionMeta("网格打乱", True, "7502255978226699581", "7502255978226699581", "65f2024dedf17dd3fbe05a613dc5a5f2", 2.000, True)
    """默认时长: 2.00s"""
    网格漂移             = TransitionMeta("网格漂移", True, "7532185328619097405", "7532185328619097405", "521940326aa74e654daea4ede1c30014", 2.000, True)
    """默认时长: 2.00s"""
    网格闪白             = TransitionMeta("网格闪白", True, "7473710408839205392", "7473710408839205392", "96a9854a6f160a2442d424eef0018a1e", 1.000, True)
    """默认时长: 1.00s"""
    网点幻灯片           = TransitionMeta("网点幻灯片", True, "7510095200740478269", "7510095200740478269", "d27fe6e38efe3bf45eb603502ebba5cf", 1.050, True)
    """默认时长: 1.05s"""
    美元                 = TransitionMeta("美元", True, "7239970629103915521", "7239970629103915521", "b687f35ba28dc6a6c847a48c186134c0", 2.500, True)
    """默认时长: 2.50s"""
    美元_II              = TransitionMeta("美元 II", True, "7242153752742859265", "7242153752742859265", "381208220de27552f3a491a67f16c347", 1.500, True)
    """默认时长: 1.50s"""
    美元模糊             = TransitionMeta("美元模糊", True, "7232243463238980097", "7232243463238980097", "9b702b87e2a9f05f698ff291f23b69db", 0.800, True)
    """默认时长: 0.80s"""
    美元符号             = TransitionMeta("美元符号", True, "7509676014394526977", "7509676014394526977", "8cdcf79f79971cffefd83407f0f3df0b", 0.730, True)
    """默认时长: 0.73s"""
    翻折转图             = TransitionMeta("翻折转图", True, "7529379876139207937", "7529379876139207937", "f767ee04c8705646b7ee62bbfc779bbc", 2.000, True)
    """默认时长: 2.00s"""
    翻滚切换             = TransitionMeta("翻滚切换", True, "7519449781823868213", "7519449781823868213", "f5bf73085118d8b8811c69a143196c20", 2.000, True)
    """默认时长: 2.00s"""
    翻转                 = TransitionMeta("翻转", True, "7483068557224398133", "7483068557224398133", "d01c8e2cca994f33fa6fb2e27d897c83", 2.000, True)
    """默认时长: 2.00s"""
    翻转与扩写           = TransitionMeta("翻转与扩写", True, "7525403132357070141", "7525403132357070141", "48d1269641c86c6c66399b32f03d59b0", 2.000, True)
    """默认时长: 2.00s"""
    翻转与阳光           = TransitionMeta("翻转与阳光", True, "7491159982793067829", "7491159982793067829", "fb79a175196b391a66870849a7e98c15", 2.000, True)
    """默认时长: 2.00s"""
    翻转视角             = TransitionMeta("翻转视角", True, "7507477574705073461", "7507477574705073461", "7e273715ee2383e4680e230f7ba06366", 2.000, True)
    """默认时长: 2.00s"""
    翻页_Ⅱ               = TransitionMeta("翻页 Ⅱ", True, "7223703402511864322", "7223703402511864322", "7720214c69eaa3203c3edda2027b28d4", 0.900, True)
    """默认时长: 0.90s"""
    耀斑切换             = TransitionMeta("耀斑切换", True, "7514973919183441213", "7514973919183441213", "563dcdf26f29e63d8337d799fe1e6616", 1.170, True)
    """默认时长: 1.17s"""
    聚光灯               = TransitionMeta("聚光灯", True, "7327168546239156737", "7327168546239156737", "2c181bfed420de070eeee7386555e001", 1.100, True)
    """默认时长: 1.10s"""
    聚焦                 = TransitionMeta("聚焦", True, "7481197929991064893", "7481197929991064893", "98b1d0a4eb4ba6eece62a0a0f9bb738b", 2.000, True)
    """默认时长: 2.00s"""
    胶卷1                = TransitionMeta("胶卷1", True, "7480765716522601783", "7480765716522601783", "29f43dc3573b35b2648e215154f4edf6", 1.000, True)
    """默认时长: 1.00s"""
    胶卷                 = TransitionMeta("胶卷", True, "7480767012130557239", "7480767012130557239", "fec78e05b7e0ba65b2a1e989d0874c15", 1.000, True)
    """默认时长: 1.00s"""
    胶卷滑动             = TransitionMeta("胶卷滑动", True, "7439647267226653200", "7439647267226653200", "ebbf5882c3c8bcaec96da67a69dbb9b4", 2.000, True)
    """默认时长: 2.00s"""
    胶片切换             = TransitionMeta("胶片切换", True, "7483025566426238213", "7483025566426238213", "e1f0298e13d0f77ef070e72a60b038fb", 1.000, True)
    """默认时长: 1.00s"""
    胶片孔痕             = TransitionMeta("胶片孔痕", True, "7491885785793318160", "7491885785793318160", "7fdb924f33240a3f23889ab83dd0db93", 1.000, True)
    """默认时长: 1.00s"""
    胶片定格             = TransitionMeta("胶片定格", True, "7216189745699754498", "7216189745699754498", "f36645cf45aa2c1e8dc20ff0b7c7f978", 1.000, True)
    """默认时长: 1.00s"""
    胶片擦除             = TransitionMeta("胶片擦除", True, "7303835940022129153", "7303835940022129153", "4bbb3dcb507832529d7a18020c8fc88d", 0.800, True)
    """默认时长: 0.80s"""
    胶片模糊             = TransitionMeta("胶片模糊", True, "7460753045761036801", "7460753045761036801", "a4efe5e3a9fd8ce07b1760f5e998acc4", 1.330, True)
    """默认时长: 1.33s"""
    胶片污渍             = TransitionMeta("胶片污渍", True, "7507456997516692752", "7507456997516692752", "e388999a566b09adbf47996a59135f43", 1.420, True)
    """默认时长: 1.42s"""
    胶片滚动             = TransitionMeta("胶片滚动", True, "7314908403996824066", "7314908403996824066", "1d9051f9b3bd0ef3725b7b8c85468abb", 0.600, True)
    """默认时长: 0.60s"""
    胶片磨花             = TransitionMeta("胶片磨花", True, "7483777166560316677", "7483777166560316677", "08f3e9ba317ebdf3b48dee56f4f04659", 1.000, True)
    """默认时长: 1.00s"""
    脏乱                 = TransitionMeta("脏乱", True, "7496720036237692213", "7496720036237692213", "653d1ccd8b2c7f42f5395a101e3ccd66", 1.000, True)
    """默认时长: 1.00s"""
    膨胀扭曲             = TransitionMeta("膨胀扭曲", True, "7532849296803220797", "7532849296803220797", "fb7bb86f72941eefe1c1392b777d0158", 2.000, True)
    """默认时长: 2.00s"""
    自动对焦             = TransitionMeta("自动对焦", True, "7489309435890847037", "7489309435890847037", "fe378a95b54d34458d508aeb6834dca4", 1.000, True)
    """默认时长: 1.00s"""
    航班目的地           = TransitionMeta("航班目的地", True, "7517254905330011445", "7517254905330011445", "16b53ae5cbf02d16e80846457bb2060b", 2.000, True)
    """默认时长: 2.00s"""
    色块故障             = TransitionMeta("色块故障", True, "7131931016733659649", "7131931016733659649", "3652ef78e81c327ae6f0e7570bdfbdcb", 0.500, True)
    """默认时长: 0.50s"""
    色彩溶解_V           = TransitionMeta("色彩溶解 V", True, "7172120845001691650", "7172120845001691650", "da37129b95501377039f01acfded91fc", 0.500, True)
    """默认时长: 0.50s"""
    色彩溶解_Ⅳ           = TransitionMeta("色彩溶解 Ⅳ", True, "7172120952593977857", "7172120952593977857", "a113cd4e04b969f3d988d76899885d42", 0.500, True)
    """默认时长: 0.50s"""
    色彩负片             = TransitionMeta("色彩负片", True, "7439647269390914065", "7439647269390914065", "c33d27f49534075f9076aa97ad06351f", 2.000, True)
    """默认时长: 2.00s"""
    色散光斑             = TransitionMeta("色散光斑", True, "7475631107128431105", "7475631107128431105", "9e98c87337be1d0e14acf933b9a2d13e", 1.270, True)
    """默认时长: 1.27s"""
    色散拖尾2            = TransitionMeta("色散拖尾2", True, "7475286070062486032", "7475286070062486032", "fde48a235a439fe944335ccd2cead2a7", 1.600, True)
    """默认时长: 1.60s"""
    色散拖尾             = TransitionMeta("色散拖尾", True, "7475286070070891025", "7475286070070891025", "ae02c207a59ce63b35ab45697f92d8b3", 2.130, True)
    """默认时长: 2.13s"""
    色散模糊             = TransitionMeta("色散模糊", True, "7227001050266341890", "7227001050266341890", "663e43aea68b3f7c0a367b8926c5b3ef", 0.600, True)
    """默认时长: 0.60s"""
    色散漩涡             = TransitionMeta("色散漩涡", True, "7402986435537539601", "7402986435537539601", "15a84ee616e08311c77dffe269288c63", 0.800, True)
    """默认时长: 0.80s"""
    色散闪烁             = TransitionMeta("色散闪烁", True, "7234817586234397186", "7234817586234397186", "2d9f72076aeefe8f52dfd1a012cd5127", 0.800, True)
    """默认时长: 0.80s"""
    色散闪烁_II          = TransitionMeta("色散闪烁 II", True, "7275970446573441538", "7275970446573441538", "b6defe3162ba39c33049b99ae39cc7e1", 0.700, True)
    """默认时长: 0.70s"""
    色散闪烁_III         = TransitionMeta("色散闪烁 III", True, "7291584475232735746", "7291584475232735746", "22fd25b359ad4baafef284653a4372d6", 0.700, True)
    """默认时长: 0.70s"""
    色相照片拼贴         = TransitionMeta("色相照片拼贴", True, "7526846226495524157", "7526846226495524157", "6da380be525d8a4e3460e731892c3813", 2.000, True)
    """默认时长: 2.00s"""
    艺术涂鸦             = TransitionMeta("艺术涂鸦", True, "7270787614205022722", "7270787614205022722", "de3335951f887d9daf922b379fc231b1", 0.600, True)
    """默认时长: 0.60s"""
    艺术涂鸦_II          = TransitionMeta("艺术涂鸦 II", True, "7271056479698817538", "7271056479698817538", "af3a222a23b96b4d8c217ee87dde288d", 0.500, True)
    """默认时长: 0.50s"""
    花卉剪纸             = TransitionMeta("花卉剪纸", True, "7498252933805444413", "7498252933805444413", "3aed9531240c0f452bc156ba348cb833", 2.000, True)
    """默认时长: 2.00s"""
    花瓣飞舞             = TransitionMeta("花瓣飞舞", True, "7532383684662480181", "7532383684662480181", "2996782c3969bfc94b0f4b03d56e08a4", 2.000, True)
    """默认时长: 2.00s"""
    草图转场             = TransitionMeta("草图转场", True, "7441466472959840784", "7441466472959840784", "fba0166dc7c61408454dc5e60071dda7", 1.000, True)
    """默认时长: 1.00s"""
    荡漾                 = TransitionMeta("荡漾", True, "7239639077547414018", "7239639077547414018", "45cbb89503fc04ed3f2ef8aa6e17483c", 1.000, True)
    """默认时长: 1.00s"""
    荧光律动             = TransitionMeta("荧光律动", True, "7259960407257780737", "7259960407257780737", "c520c98250ae887e185600c1f907018b", 0.800, True)
    """默认时长: 0.80s"""
    荧光胶片             = TransitionMeta("荧光胶片", True, "7416204024044589584", "7416204024044589584", "69b78a8f16b76aeaf838ced328610f77", 0.700, True)
    """默认时长: 0.70s"""
    蓄力放大             = TransitionMeta("蓄力放大", True, "7486291046461213958", "7486291046461213958", "1b1e2a7c5dc8d195774b5ce7677903a4", 2.560, True)
    """默认时长: 2.56s"""
    蓝光扫描             = TransitionMeta("蓝光扫描", True, "7291923867235258882", "7291923867235258882", "95462badbbb87bd7dc4e1d7b04e58306", 1.000, True)
    """默认时长: 1.00s"""
    蓝光溶解             = TransitionMeta("蓝光溶解", True, "7480387155659951415", "7480387155659951415", "7a3113207fb222b10763203a8252b503", 2.000, True)
    """默认时长: 2.00s"""
    蓝色捕捉             = TransitionMeta("蓝色捕捉", True, "7497282766573194549", "7497282766573194549", "944bdf775dcb1ebc6fe5f2ed45dd1775", 2.000, True)
    """默认时长: 2.00s"""
    蛋壳裂纹             = TransitionMeta("蛋壳裂纹", True, "7517904720841674045", "7517904720841674045", "f61c4d4a0ee25bf8669fea652652dd6d", 2.000, True)
    """默认时长: 2.00s"""
    融化                 = TransitionMeta("融化", True, "7494172773342858549", "7494172773342858549", "f7595bbf009faa2ab78c8f5541850fad", 1.930, True)
    """默认时长: 1.93s"""
    融化_II              = TransitionMeta("融化 II", True, "7200649164533797378", "7200649164533797378", "74a83d45bdccf5d27bd4b55ddd2733f3", 0.500, True)
    """默认时长: 0.50s"""
    融化轮廓             = TransitionMeta("融化轮廓", True, "7498348335217003837", "7498348335217003837", "bfe55d6ea364383f89a920e52821f7e0", 2.000, True)
    """默认时长: 2.00s"""
    融化金               = TransitionMeta("融化金", True, "7509410046711844149", "7509410046711844149", "60d421d4b68fdda71dd8ee5b206a2829", 2.000, True)
    """默认时长: 2.00s"""
    融化飞溅             = TransitionMeta("融化飞溅", True, "7525399673863949629", "7525399673863949629", "6d19226dbd51859791b540d0eedfdacd", 2.000, True)
    """默认时长: 2.00s"""
    螺旋上升             = TransitionMeta("螺旋上升", True, "7488999593271676213", "7488999593271676213", "63bff85dbc3258b4e34270b1cca03e60", 2.000, True)
    """默认时长: 2.00s"""
    血色闪烁             = TransitionMeta("血色闪烁", True, "7426273536546705937", "7426273536546705937", "7b36ddff84bae2afa85432cb5fdac1f4", 0.700, True)
    """默认时长: 0.70s"""
    街头路标             = TransitionMeta("街头路标", True, "7480386954878782726", "7480386954878782726", "07087d637f8244de00860e8ddff6822e", 1.000, True)
    """默认时长: 1.00s"""
    衰退爆炸             = TransitionMeta("衰退爆炸", True, "7500522230451899701", "7500522230451899701", "03f15057e0ecb0b90a21f8a3ec888b2a", 2.000, True)
    """默认时长: 2.00s"""
    被撕裂               = TransitionMeta("被撕裂", True, "7494279326951640373", "7494279326951640373", "54922ca68b318b300b7fc696e10e22d0", 1.970, True)
    """默认时长: 1.97s"""
    被破坏的文件         = TransitionMeta("被破坏的文件", True, "7530114957791251773", "7530114957791251773", "42d993fdacf3c9e11338f2513282e88e", 2.000, True)
    """默认时长: 2.00s"""
    裂开的立方体         = TransitionMeta("裂开的立方体", True, "7513217052555971893", "7513217052555971893", "9f46c0cf4718d4f8ce87a618b9121e81", 2.000, True)
    """默认时长: 2.00s"""
    裂拼闪现             = TransitionMeta("裂拼闪现", True, "7507452260234857729", "7507452260234857729", "83fec939112b09ff5175d3b3a7380cea", 2.000, True)
    """默认时长: 2.00s"""
    西瓜乐趣             = TransitionMeta("西瓜乐趣", True, "7527569677350980917", "7527569677350980917", "907b8e7eb46de2768175ce993db0ce5a", 2.000, True)
    """默认时长: 2.00s"""
    视窗_95              = TransitionMeta("视窗 95", True, "7508657154354662717", "7508657154354662717", "f2899822e6948b3870c43d283e2a5553", 2.000, True)
    """默认时长: 2.00s"""
    视觉嗡嗡             = TransitionMeta("视觉嗡嗡", True, "7530512775311871293", "7530512775311871293", "208d056367791a208710532ee5c782ee", 2.000, True)
    """默认时长: 2.00s"""
    角落挥摆             = TransitionMeta("角落挥摆", True, "7530679003854818613", "7530679003854818613", "d8470753982b196eeed00a6d1e011b47", 2.000, True)
    """默认时长: 2.00s"""
    角落阴燃             = TransitionMeta("角落阴燃", True, "7494169851242630453", "7494169851242630453", "5d53edfae3f55ed91e9b581d76d06d14", 2.000, True)
    """默认时长: 2.00s"""
    负向故障             = TransitionMeta("负向故障", True, "7468297672261160245", "7468297672261160245", "6e2f66ad64b8d8f17215e85e72d15f41", 2.000, True)
    """默认时长: 2.00s"""
    负圆                 = TransitionMeta("负圆", True, "7527707579376586037", "7527707579376586037", "889b4959dfe6253990e5e1bc2a56458a", 2.000, True)
    """默认时长: 2.00s"""
    负片粉色_2           = TransitionMeta("负片粉色 2", True, "7501668225239862581", "7501668225239862581", "abf2a99a49bc759de318a17c0e3e431d", 2.000, True)
    """默认时长: 2.00s"""
    负片红               = TransitionMeta("负片红", True, "7508780193679494461", "7508780193679494461", "fa55003af93304d9b15e0a420cef836f", 2.000, True)
    """默认时长: 2.00s"""
    负片鱼眼             = TransitionMeta("负片鱼眼", True, "7475286070066680336", "7475286070066680336", "2904af976996b914144cb779fbc5b57a", 1.040, True)
    """默认时长: 1.04s"""
    负粉色               = TransitionMeta("负粉色", True, "7479475689041775925", "7479475689041775925", "bb0b11b1643beb3fea5d68cc1bd778c3", 2.000, True)
    """默认时长: 2.00s"""
    负蓝                 = TransitionMeta("负蓝", True, "7478447976030129461", "7478447976030129461", "19967138fa4b9ce4a986a2250664c81d", 2.000, True)
    """默认时长: 2.00s"""
    负面标记             = TransitionMeta("负面标记", True, "7514699093675871549", "7514699093675871549", "27b9f4ffb647cf2bd20a8eebc094ad77", 1.070, True)
    """默认时长: 1.07s"""
    资金翻转             = TransitionMeta("资金翻转", True, "7499741781005700405", "7499741781005700405", "eaf9da3b89385de785bb7444a74fa9bb", 2.000, True)
    """默认时长: 2.00s"""
    赛博朋克             = TransitionMeta("赛博朋克", True, "7208021852059341314", "7208021852059341314", "5fb25d89204b60ea36d36a0903acd189", 0.500, True)
    """默认时长: 0.50s"""
    赛博马赛克           = TransitionMeta("赛博马赛克", True, "7451535587812577809", "7451535587812577809", "b6858b185f28ea0995283665badf7a5a", 2.000, True)
    """默认时长: 2.00s"""
    超音速               = TransitionMeta("超音速", True, "7533423103704173877", "7533423103704173877", "82f08fd0ebe4e5265aebd8152eff8a2d", 2.000, True)
    """默认时长: 2.00s"""
    跳动炫光             = TransitionMeta("跳动炫光", True, "7522416981501283585", "7522416981501283585", "e326ef3b1591e439c11ef8f078e988ab", 1.320, True)
    """默认时长: 1.32s"""
    跳跃切换             = TransitionMeta("跳跃切换", True, "7484300610502757685", "7484300610502757685", "ce717010db4149c0bcf672ef95e03227", 2.000, True)
    """默认时长: 2.00s"""
    转换切屏             = TransitionMeta("转换切屏", True, "7460417887614833153", "7460417887614833153", "adfc0587ab09ddf884a92d63f744de64", 1.000, True)
    """默认时长: 1.00s"""
    轮胎刮痕             = TransitionMeta("轮胎刮痕", True, "7490512651563355445", "7490512651563355445", "a4328dbd63f48e8cf705ee112b9599ad", 2.000, True)
    """默认时长: 2.00s"""
    轻巧叠影             = TransitionMeta("轻巧叠影", True, "7496722952331775248", "7496722952331775248", "28aed8ac68e17adc502073e58a9bd0ba", 1.000, True)
    """默认时长: 1.00s"""
    轻盈模糊             = TransitionMeta("轻盈模糊", True, "7524931212050238773", "7524931212050238773", "cc83bf4582acfed5aa92b5d51c015c26", 2.000, True)
    """默认时长: 2.00s"""
    轻盈爆裂             = TransitionMeta("轻盈爆裂", True, "7514768843533815093", "7514768843533815093", "4facd00adba45edd6f6d402287432bf2", 1.000, True)
    """默认时长: 1.00s"""
    边框切换             = TransitionMeta("边框切换", True, "7438462581448118785", "7438462581448118785", "0c5440042359e1d8affab2b2631c23f8", 2.000, True)
    """默认时长: 2.00s"""
    边框左切             = TransitionMeta("边框左切", True, "7460018714931368465", "7460018714931368465", "fe358e88fa7f2c919d7f2d0b72ef5734", 1.000, True)
    """默认时长: 1.00s"""
    边角拍击             = TransitionMeta("边角拍击", True, "7532009542578752829", "7532009542578752829", "e41d75511c229e922aefc093ecbdc507", 2.000, True)
    """默认时长: 2.00s"""
    运镜压缩             = TransitionMeta("运镜压缩", True, "7451535589557408272", "7451535589557408272", "43f8c66c156a4bc8cf48809a908c8f14", 2.000, True)
    """默认时长: 2.00s"""
    进阶旋转             = TransitionMeta("进阶旋转", True, "7501955747937275152", "7501955747937275152", "f1781f5ca26d955ec2a5828a12c397ba", 1.000, True)
    """默认时长: 1.00s"""
    迷幻波纹             = TransitionMeta("迷幻波纹", True, "7443649875188666897", "7443649875188666897", "45b2ac1b9cea1a001a43e673151d1e34", 1.000, True)
    """默认时长: 1.00s"""
    迷幻震动             = TransitionMeta("迷幻震动", True, "7283390255405732354", "7283390255405732354", "a075e7a59f0dbdcbaf7cd06f653e48ce", 0.800, True)
    """默认时长: 0.80s"""
    迷幻频闪             = TransitionMeta("迷幻频闪", True, "7438462583511716368", "7438462583511716368", "74e7013b196e25699e436052c3a3a39f", 1.000, True)
    """默认时长: 1.00s"""
    选择切换             = TransitionMeta("选择切换", True, "7479031143313018173", "7479031143313018173", "8d7f521a88400c3fcda1e8b2108471b7", 2.000, True)
    """默认时长: 2.00s"""
    透明光晕             = TransitionMeta("透明光晕", True, "7495962407844449537", "7495962407844449537", "745d3233374d8dcd1a457a90971cad21", 1.670, True)
    """默认时长: 1.67s"""
    透镜上移             = TransitionMeta("透镜上移", True, "7508898871397993744", "7508898871397993744", "fb6fbc2dd0269915eb597b589306afa9", 1.670, True)
    """默认时长: 1.67s"""
    透镜下移             = TransitionMeta("透镜下移", True, "7524918593293716752", "7524918593293716752", "e0f1f95071a37b1874b9e77da0e2d878", 1.670, True)
    """默认时长: 1.67s"""
    透镜故障             = TransitionMeta("透镜故障", True, "7131930234890228226", "7131930234890228226", "bc652327bcde0e6bf9db8a89d371dd05", 0.500, True)
    """默认时长: 0.50s"""
    逐一裁剪             = TransitionMeta("逐一裁剪", True, "7532137142416428349", "7532137142416428349", "26fb85311c53b90ce664cf7f084f1be8", 2.000, True)
    """默认时长: 2.00s"""
    部分闪白             = TransitionMeta("部分闪白", True, "7460753045769425409", "7460753045769425409", "8dd90fdcb8091724213012cadd64c405", 1.200, True)
    """默认时长: 1.20s"""
    重叠                 = TransitionMeta("重叠", True, "7519749185780993341", "7519749185780993341", "8772490a2acd3fedfc71a24501124f21", 2.000, True)
    """默认时长: 2.00s"""
    重叠上滑             = TransitionMeta("重叠上滑", True, "7233341677081989633", "7233341677081989633", "2444a42adbc6f8de79871ce358c41df6", 1.200, True)
    """默认时长: 1.20s"""
    重叠渐隐             = TransitionMeta("重叠渐隐", True, "7521649607093374269", "7521649607093374269", "9b2388f9320df9ad5187983b72d5aa71", 2.000, True)
    """默认时长: 2.00s"""
    重复切换             = TransitionMeta("重复切换", True, "7482638340492217661", "7482638340492217661", "ef07f42c2641f2bc1902838fc9196288", 2.000, True)
    """默认时长: 2.00s"""
    重复底片             = TransitionMeta("重复底片", True, "7503378726835604752", "7503378726835604752", "777c8d95252fb5eb01e5598af31d5835", 0.770, True)
    """默认时长: 0.77s"""
    重影上划             = TransitionMeta("重影上划", True, "7496753901786516753", "7496753901786516753", "57084a875e9c819c7ead540928299a52", 2.000, True)
    """默认时长: 2.00s"""
    重新定位             = TransitionMeta("重新定位", True, "7516761807428619573", "7516761807428619573", "2c1512b966478589f42a5ed4406f7c91", 2.000, True)
    """默认时长: 2.00s"""
    重新排列             = TransitionMeta("重新排列", True, "7529909473314475325", "7529909473314475325", "14814ed93c2bd6f45d79da269759c132", 2.000, True)
    """默认时长: 2.00s"""
    重绘闪现             = TransitionMeta("重绘闪现", True, "7532727620761357629", "7532727620761357629", "19750e7392ec5f8e1721a6461fd74851", 2.000, True)
    """默认时长: 2.00s"""
    金沙                 = TransitionMeta("金沙", True, "7441433701344350737", "7441433701344350737", "21a5ca5fc6862b1baa4813f2c0ff294d", 1.740, True)
    """默认时长: 1.74s"""
    金粉                 = TransitionMeta("金粉", True, "7527216963395915069", "7527216963395915069", "e11f2af5e40876186eb02d5deff19fcb", 2.000, True)
    """默认时长: 2.00s"""
    金色铭牌             = TransitionMeta("金色铭牌", True, "7528382384497085749", "7528382384497085749", "9bd268160da4ddc39e8c58ae6cd0cda9", 2.000, True)
    """默认时长: 2.00s"""
    钻石开场             = TransitionMeta("钻石开场", True, "7501529352799014197", "7501529352799014197", "b7ebf13228921e6c74af88bb645471ae", 2.000, True)
    """默认时长: 2.00s"""
    钻石模糊             = TransitionMeta("钻石模糊", True, "7231814219224584706", "7231814219224584706", "fbc9483a98c8833500620a03bce6f11b", 0.600, True)
    """默认时长: 0.60s"""
    钻石消融             = TransitionMeta("钻石消融", True, "7528323435307584821", "7528323435307584821", "ce15c92d35509eea3f0d318686d47e8e", 2.000, True)
    """默认时长: 2.00s"""
    铃铛                 = TransitionMeta("铃铛", True, "7533229202837982517", "7533229202837982517", "0a01f15838438d093e4c0b1a4c01fd6d", 2.000, True)
    """默认时长: 2.00s"""
    银杏雨               = TransitionMeta("银杏雨", True, "7532037317125492029", "7532037317125492029", "b7cb23f9a7510af7adfb2150ee310ed2", 2.000, True)
    """默认时长: 2.00s"""
    错位的碎片           = TransitionMeta("错位的碎片", True, "7499048871029460285", "7499048871029460285", "04288344440360497990d651c55073bd", 2.000, True)
    """默认时长: 2.00s"""
    镜像翻转             = TransitionMeta("镜像翻转", True, "7527904696636329277", "7527904696636329277", "7d3f2907e48b9920b6fab0c2d53747e5", 1.030, True)
    """默认时长: 1.03s"""
    镜头右移             = TransitionMeta("镜头右移", True, "7504170649745739024", "7504170649745739024", "8917169aa570c98c9e69bd1e2dea2f26", 0.900, True)
    """默认时长: 0.90s"""
    镜头模糊             = TransitionMeta("镜头模糊", True, "7491592800354438453", "7491592800354438453", "5f7f2c0182cb468cff60232c44ee66be", 2.000, True)
    """默认时长: 2.00s"""
    镜头炫彩             = TransitionMeta("镜头炫彩", True, "7480456936144506165", "7480456936144506165", "85e691c4d62221123a4d14087722bad0", 2.000, True)
    """默认时长: 2.00s"""
    镜头缩小             = TransitionMeta("镜头缩小", True, "7481267417465785661", "7481267417465785661", "bff4456ef5e53ecd84adf9af47c04701", 2.000, True)
    """默认时长: 2.00s"""
    镜头速移             = TransitionMeta("镜头速移", True, "7417794480444543489", "7417794480444543489", "30be83d2e7ed1f2f1fe74b9cfe51c206", 0.567, True)
    """默认时长: 0.57s"""
    镜头重叠             = TransitionMeta("镜头重叠", True, "7532081762239925557", "7532081762239925557", "633a5cada39c3e71b47c86c3ebca1bbe", 2.000, True)
    """默认时长: 2.00s"""
    长曝光               = TransitionMeta("长曝光", True, "7309465900317413889", "7309465900317413889", "c239e26c5f99cf83cabd28f63d04b93f", 1.000, True)
    """默认时长: 1.00s"""
    闪光像素             = TransitionMeta("闪光像素", True, "7480387177277345079", "7480387177277345079", "883966ba4e68bc1b8203ba01a84c59de", 0.830, True)
    """默认时长: 0.83s"""
    闪光弹               = TransitionMeta("闪光弹", True, "7482887919804452149", "7482887919804452149", "32ab704d29fdeb85b482c1bc7aa615ce", 2.000, True)
    """默认时长: 2.00s"""
    闪光波纹             = TransitionMeta("闪光波纹", True, "7508696606183673149", "7508696606183673149", "9cececb87ea3391e2a0483cffeb472f1", 1.000, True)
    """默认时长: 1.00s"""
    闪光金               = TransitionMeta("闪光金", True, "7519745560044145973", "7519745560044145973", "8ef699cc027790acc275ca332dfa4d61", 1.830, True)
    """默认时长: 1.83s"""
    闪光鱼眼             = TransitionMeta("闪光鱼眼", True, "7477828540960887313", "7477828540960887313", "bef113aea41eb10bbc4f4504d5be7c2d", 2.000, True)
    """默认时长: 2.00s"""
    闪动光斑_II          = TransitionMeta("闪动光斑 II", True, "7148715284650529281", "7148715284650529281", "bf73c3a29a035c01b46e9aa26d78b0b6", 0.500, True)
    """默认时长: 0.50s"""
    闪动斜线             = TransitionMeta("闪动斜线", True, "7529380337030368513", "7529380337030368513", "f3f650289bbc9d240a068d4685f682b5", 1.000, True)
    """默认时长: 1.00s"""
    闪回                 = TransitionMeta("闪回", True, "7252586720078598658", "7252586720078598658", "0a22de17ce5c2fd97f2bd77aa115de77", 0.200, True)
    """默认时长: 0.20s"""
    闪拍                 = TransitionMeta("闪拍", True, "7494174953546206517", "7494174953546206517", "a892288b97aaacb5281f2e39ffe0dc12", 2.000, True)
    """默认时长: 2.00s"""
    闪烁失调             = TransitionMeta("闪烁失调", True, "7520144276693486909", "7520144276693486909", "698793e80a2363ab259e397ef3dffae2", 2.000, True)
    """默认时长: 2.00s"""
    闪电岩石             = TransitionMeta("闪电岩石", True, "7485945910707375413", "7485945910707375413", "58375ab1383f2a40756484ad9d52ab0c", 2.000, True)
    """默认时长: 2.00s"""
    闪白_II              = TransitionMeta("闪白 II", True, "7293035683499741698", "7293035683499741698", "9a1089fc9fefe2a79a71c37c1bc5831a", 0.300, True)
    """默认时长: 0.30s"""
    闪耀方块             = TransitionMeta("闪耀方块", True, "7516939638506917173", "7516939638506917173", "07126fbc6db30e2ba85880666eb37347", 2.000, True)
    """默认时长: 2.00s"""
    闪黑_II              = TransitionMeta("闪黑 II", True, "7267836273539158530", "7267836273539158530", "1ecd9bf4057919c5aa78002f97e715de", 0.600, True)
    """默认时长: 0.60s"""
    阳光光感             = TransitionMeta("阳光光感", True, "7511719916135779645", "7511719916135779645", "13d7ef572a3a381016ddf8ae4c205504", 2.000, True)
    """默认时长: 2.00s"""
    阳光擦拭             = TransitionMeta("阳光擦拭", True, "7528328568519019837", "7528328568519019837", "e4e693a9235843af444fbc325b450d35", 2.000, True)
    """默认时长: 2.00s"""
    雨刷转场             = TransitionMeta("雨刷转场", True, "7451535589544825360", "7451535589544825360", "2fc9fdbde5b730255e5ffd39c610d735", 2.000, True)
    """默认时长: 2.00s"""
    雪崩                 = TransitionMeta("雪崩", True, "7498300135865109821", "7498300135865109821", "fc4d2229d30f53c3ee660440c7ad8136", 2.000, True)
    """默认时长: 2.00s"""
    雪花四散             = TransitionMeta("雪花四散", True, "7446316654000132624", "7446316654000132624", "3982224ea3c1b93e9d6aab2f3039dc78", 2.000, True)
    """默认时长: 2.00s"""
    雪花环绕             = TransitionMeta("雪花环绕", True, "7446316654000083472", "7446316654000083472", "b6b74d907b71741dab39e489ce7ec387", 2.000, True)
    """默认时长: 2.00s"""
    震动_II              = TransitionMeta("震动 II", True, "7197297099879223810", "7197297099879223810", "f5685f90de96d6541417f0331f84de8a", 1.000, True)
    """默认时长: 1.00s"""
    震动条形             = TransitionMeta("震动条形", True, "7460753045761053185", "7460753045761053185", "7605705d52850083d4ed2a4df415a8e3", 1.000, True)
    """默认时长: 1.00s"""
    震动波纹             = TransitionMeta("震动波纹", True, "7460018714943951361", "7460018714943951361", "23de0890ead240fa453ad8a4553f7339", 1.000, True)
    """默认时长: 1.00s"""
    震感放大             = TransitionMeta("震感放大", True, "7508566073042537729", "7508566073042537729", "a3680427cbf54fcd044c4e987fa31e23", 1.000, True)
    """默认时长: 1.00s"""
    震感缩小             = TransitionMeta("震感缩小", True, "7524051031626501392", "7524051031626501392", "f86bc302b81a2a5538c6cbb8bba41baf", 1.000, True)
    """默认时长: 1.00s"""
    震荡波切换           = TransitionMeta("震荡波切换", True, "7517215448493051189", "7517215448493051189", "0aafb632387091ae93b717424d6c7c5a", 2.000, True)
    """默认时长: 2.00s"""
    霓虹涂鸦             = TransitionMeta("霓虹涂鸦", True, "7508635213119917373", "7508635213119917373", "5cfd98c995a9a0386cd1c2d97a648ff8", 0.480, True)
    """默认时长: 0.48s"""
    霓虹渗漏             = TransitionMeta("霓虹渗漏", True, "7533082978721795381", "7533082978721795381", "33495728309eaf107fb1c0f27e544839", 2.000, True)
    """默认时长: 2.00s"""
    霓虹热浪             = TransitionMeta("霓虹热浪", True, "7494165023573527861", "7494165023573527861", "97e1c81e1dad835e2c3f20baf54edb36", 2.000, True)
    """默认时长: 2.00s"""
    霓虹负片闪烁         = TransitionMeta("霓虹负片闪烁", True, "7508593076311510325", "7508593076311510325", "34d4793fde994c184187e8d00e20f368", 1.480, True)
    """默认时长: 1.48s"""
    霓虹阴影             = TransitionMeta("霓虹阴影", True, "7517597546601008437", "7517597546601008437", "96689ab7e9c4a65239ddf76f54101662", 1.930, True)
    """默认时长: 1.93s"""
    青色故障             = TransitionMeta("青色故障", True, "7478256640764988725", "7478256640764988725", "2a11af18013bcb2721029ed7806555df", 2.000, True)
    """默认时长: 2.00s"""
    靛蓝闪烁             = TransitionMeta("靛蓝闪烁", True, "7521671166113647933", "7521671166113647933", "24fb4bfc9e858d19f6c5a104c272c55c", 2.000, True)
    """默认时长: 2.00s"""
    音乐播放器_3         = TransitionMeta("音乐播放器 3", True, "7517812432232910141", "7517812432232910141", "e72a47679ea456c9b40e0c3fb47ffd71", 2.000, True)
    """默认时长: 2.00s"""
    顺时针三角           = TransitionMeta("顺时针三角", True, "7451535589381247489", "7451535589381247489", "d02963275288ab14e24791ad2c0edd78", 1.500, True)
    """默认时长: 1.50s"""
    顺时针转场           = TransitionMeta("顺时针转场", True, "7489338236137917757", "7489338236137917757", "ca24f1962ae0bf9b15af7e16b508bbbf", 1.000, True)
    """默认时长: 1.00s"""
    顺时针闪烁           = TransitionMeta("顺时针闪烁", True, "7522709766183996733", "7522709766183996733", "dcdd460cdc5b9409a0dc3e3c7e49477a", 1.830, True)
    """默认时长: 1.83s"""
    顺滑标记             = TransitionMeta("顺滑标记", True, "7498633498979241269", "7498633498979241269", "b8d8c55d473501b4115af2e4677a3e78", 2.000, True)
    """默认时长: 2.00s"""
    频闪_II              = TransitionMeta("频闪 II", True, "7245192723077009921", "7245192723077009921", "0d95b71df07de567e9c059d816acc984", 0.450, True)
    """默认时长: 0.45s"""
    频闪_III             = TransitionMeta("频闪 III", True, "7283447840276222466", "7283447840276222466", "8b3a79e4c6e6edcbf3bc57b3a4ace998", 0.400, True)
    """默认时长: 0.40s"""
    颗粒模糊             = TransitionMeta("颗粒模糊", True, "7494174523856653569", "7494174523856653569", "3cd807cd0013ff8c6c1466b3f76fa414", 2.000, True)
    """默认时长: 2.00s"""
    颠覆变形             = TransitionMeta("颠覆变形", True, "7530513667964570941", "7530513667964570941", "313411ce3dcb2bb530b25423a7b0bbc8", 2.000, True)
    """默认时长: 2.00s"""
    马赛克_II            = TransitionMeta("马赛克 II", True, "7325373955789820418", "7325373955789820418", "ae0b3790268f6ce8df4500bbcfb648fd", 0.800, True)
    """默认时长: 0.80s"""
    验证码切换_2         = TransitionMeta("验证码切换 2", True, "7471271684763356469", "7471271684763356469", "d615128084f9fb7a7450192819a84c1c", 2.000, True)
    """默认时长: 2.00s"""
    验证码点击           = TransitionMeta("验证码点击", True, "7529757964266147125", "7529757964266147125", "f95954118e17f5f67c8567340f59469c", 2.000, True)
    """默认时长: 2.00s"""
    高速滑动             = TransitionMeta("高速滑动", True, "7207719995063669250", "7207719995063669250", "1eef7a9f264a07ade4ee77353f96a6a4", 0.500, True)
    """默认时长: 0.50s"""
    鬼魅转曲             = TransitionMeta("鬼魅转曲", True, "7517541037095537981", "7517541037095537981", "a53a5b54e14820f3f11079805a808dff", 2.000, True)
    """默认时长: 2.00s"""
    魔方碎片             = TransitionMeta("魔方碎片", True, "7489053131456793917", "7489053131456793917", "4b74c0e81a9d4eaa5bf67e6599518437", 2.000, True)
    """默认时长: 2.00s"""
    魔法爱心             = TransitionMeta("魔法爱心", True, "7470416935662916112", "7470416935662916112", "96e18feb9590341fe5a08db633b0b6a9", 1.800, True)
    """默认时长: 1.80s"""
    鱼眼                 = TransitionMeta("鱼眼", True, "7160964049818096129", "7160964049818096129", "0319d3f53fd0e79e7e7165f27d7eb9bb", 0.500, True)
    """默认时长: 0.50s"""
    鱼眼_II              = TransitionMeta("鱼眼 II", True, "7160964137332249089", "7160964137332249089", "6705e7c01ad8518db1428a34b1357d8f", 0.500, True)
    """默认时长: 0.50s"""
    鱼眼_III             = TransitionMeta("鱼眼 III", True, "7271057010760618498", "7271057010760618498", "cdaf9cd4712f5f8061110dfed13738fd", 1.333, True)
    """默认时长: 1.33s"""
    鱼眼快照             = TransitionMeta("鱼眼快照", True, "7528339818967813437", "7528339818967813437", "9cdf43644f90077432e5a4d606c0114b", 2.000, True)
    """默认时长: 2.00s"""
    鱼眼扭曲             = TransitionMeta("鱼眼扭曲", True, "7480387155659967799", "7480387155659967799", "384c938380506e3709554c5beee2b135", 1.830, True)
    """默认时长: 1.83s"""
    鱼眼拍摄             = TransitionMeta("鱼眼拍摄", True, "7507554056991296821", "7507554056991296821", "1a5389263f7b2cdd117c0794cfdd8bd1", 2.000, True)
    """默认时长: 2.00s"""
    鱼眼旋转             = TransitionMeta("鱼眼旋转", True, "7477828540973453825", "7477828540973453825", "3cbd30182bdac51704b205bd05a4a3a7", 1.000, True)
    """默认时长: 1.00s"""
    鱼眼波纹             = TransitionMeta("鱼眼波纹", True, "7434830442273968656", "7434830442273968656", "f6d9afd9764c5fc849db3ca346d81997", 0.600, True)
    """默认时长: 0.60s"""
    黏滑飞溅             = TransitionMeta("黏滑飞溅", True, "7529701802241953085", "7529701802241953085", "f3a8fadaab2b543f3dfef0ae785aad33", 2.000, True)
    """默认时长: 2.00s"""
    黑板擦除             = TransitionMeta("黑板擦除", True, "7434830442257191441", "7434830442257191441", "783cfcdc22f1067cd50142b6731f0b92", 2.000, True)
    """默认时长: 2.00s"""
    黑白摇镜             = TransitionMeta("黑白摇镜", True, "7288578706417652225", "7288578706417652225", "cc6bea0aa49c6824aa42d0448d6d0080", 0.700, True)
    """默认时长: 0.70s"""
    黑白暂停             = TransitionMeta("黑白暂停", True, "7522793047139142973", "7522793047139142973", "286adc7fe236d9355173f4d2a92c5e9a", 2.000, True)
    """默认时长: 2.00s"""
    黑白重影             = TransitionMeta("黑白重影", True, "7506007805166406913", "7506007805166406913", "1307f3b7d8cc9b01cb7088e2fb642146", 1.000, True)
    """默认时长: 1.00s"""
    黑白闪现             = TransitionMeta("黑白闪现", True, "7248940490211463681", "7248940490211463681", "3922babba632da7545c9b507dff666a1", 0.600, True)
    """默认时长: 0.60s"""
